{"totalResults":15018,"articles":[{"source":{"id":"","name":"Lifehacker.com"},"author":"Lindsey Ellefson","title":"10 Common Household Items That Are Using Too Much Energy","description":"Saving energy is always important, but with prices rising, electricity and heating bills are an especially hot topic right now, so to speak. There are plenty of ways to cut down on energy usebut you have to identify the main energy-sucking offenders lurking ","publishedAt":"2022-10-31T20:00:00Z","content":"If you still have a set-top DVR or a cable box, its probably using more energy than you think. Per How-to Geek, DVR boxes could use 25 wats or more and cable boxes can use 15. Televisions, too, are a "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"ESA mulls Solaris plan to beam solar energy from space","description":"The European Space Agency is considering the 'Solaris Initiative' plan to collect solar energy in orbit and beaming electricity back to Earth.","publishedAt":"2022-11-22T01:00:43Z","content":"Space chiefs are to investigate whether electricity could be beamed wirelessly from space into millions of homes.\r\nThe European Space Agency will this week likely approve a three-year study to see if "},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Fact Check","title":"Fact Check-F-credit message on electricity meters means friendly credit, not free credit for asylum seekers - Reuters","description":"Thousands of people have watched a man misreading an electricity meter in a social media video where he falsely claims that it reveals asylum seekers in Britain are given free credit for household electricity costs.","publishedAt":"2022-11-01T16:56:00Z","content":"Thousands of people have watched a man misreading an electricity meter in a social media video where he falsely claims that it reveals asylum seekers in Britain are given free credit for household el "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bosnia's power exports at risk as people switch to electricity for heating - Reuters","description":"Bosnia, the Balkans' sole exporter of electricity, may be forced to cut exports as Bosnians turn to subsidised electricity for heating after a jump in prices for other fuels, including gas, firewood and wood pellets.","publishedAt":"2022-11-04T13:15:00Z","content":"SARAJEVO, Nov 4 (Reuters) - Bosnia, the Balkans' sole exporter of electricity, may be forced to cut exports as Bosnians turn to subsidised electricity for heating after a jump in prices for other fue "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Moldova electricity supplies hit by cut in Russian gas - Reuters","description":"A 40 cut in deliveries of Russian natural gas is hitting Moldova's ability to provide sufficient electricity for its 2.5 million people, the deputy prime minister of the small ex-Soviet state said on Monday.","publishedAt":"2022-10-31T23:00:00Z","content":"CHISINAU, Oct 31 (Reuters) - A 40 cut in deliveries of Russian natural gas is hitting Moldova's ability to provide sufficient electricity for its 2.5 million people, the deputy prime minister of the "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Japan asks households, companies to conserve electricity during winter - Reuters","description":"Japan said on Tuesday it will ask households and companies across the country to conserve electricity within \"a reasonable range\" during the peak winter demand season to alleviate a possible power crunch in the world's third largest economy.","publishedAt":"2022-11-01T10:29:00Z","content":"TOKYO, Nov 1 (Reuters) - Japan said on Tuesday it will ask households and companies across the country to conserve electricity within \"a reasonable range\" during the peak winter demand season to alle "},{"source":{"id":"engadget","name":"Engadget"},"author":"Igor Bonifacic","title":"GM says it's ready to power all its US facilities with renewable energy by 2025","description":"General Motors is on track to secure 100 percent of the electricity it needs to power all of its US facilities with renewable energy by 2025. On Wednesday, the automaker announced\r\n it recently finalized the sourcing agreements it needs to make that feat a re","publishedAt":"2022-10-26T20:00:43Z","content":"General Motors is on track to secure 100 percent of the electricity it needs to power all of its US facilities with renewable energy by 2025. On Wednesday, the automaker announced\r\n it recently final "},{"source":{"id":"engadget","name":"Engadget"},"author":"Steve Dent","title":"New French law will require parking lots to install solar panels","description":"In 2020, France was the only EU nation not to meet its obligations for the development of renewable energy, as it still relies primarily on nuclear power. Now, the French Senate has approved a bill that should increase that markedly, requiring parking lots wi","publishedAt":"2022-11-09T10:04:35Z","content":"In 2020, France was the only EU nation not to meet its obligations for the development of renewable energy, as it still relies primarily on nuclear power. Now, the French Senate has approved a bill t "},{"source":{"id":"","name":"The Guardian"},"author":"Graeme Wearden","title":"Energy bills drive UK inflation to 40-year high of 11.1  business live","description":"Inflation continued to accelerate last month, lifted by gas and electricity bills, and pricier foodGas and electricity prices made the largest upward contribution to inflation, despite the governments energy price guarantee.Rising food prices also made a lar","publishedAt":"2022-11-16T07:03:53Z","content":"Newsflash: UK inflation hits 11.1\r\nUK inflation has hit a new 40-year high and even higher than feared.\r\nThe UKs annual inflation rate has risen to 11.1 in October, after millions of households wer "},{"source":{"id":"","name":"The Guardian"},"author":"Miles Brignall","title":"Energy bills: thousands of UK households in limbo over 400 support","description":"Concerns grow that people relying on communal heating may not receive state discount promisedThousands of people living in homes with centrally supplied electricity are still waiting to hear if and when the UK government will pay them the 400 promised under ","publishedAt":"2022-11-11T11:35:53Z","content":"Thousands of people living in homes with centrally supplied electricity are still waiting to hear if and when the UK government will pay them the 400 promised under the energy bills support scheme.\r "},{"source":{"id":"","name":"Hackaday"},"author":"Lewin Day","title":"Real Minecraft Furnace Generates Electricity From Coal","description":"Theres a furnace in Minecraft that is used to power all kinds of things in the game. [Joel] of Joel Creates decided he wanted to build a real-world replica, and did exactly that. The furnace","publishedAt":"2022-11-19T06:00:28Z","content":"Theres a furnace in Minecraft that is used to power all kinds of things in the game. [Joel] of Joel Creates decided he wanted to build a real-world replica, and did exactly that.\r\nThe furnace consis "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"German economy ministry wants to skim electricity windfall profit from November - draft paper - Reuters","description":"Germany's economy ministry wants to begin skimming off electricity providers' windfall profits retroactively from November, according to a draft paper seen by Reuters.","publishedAt":"2022-11-09T11:16:00Z","content":"BERLIN, Nov 9 (Reuters) - Germany's economy ministry wants to begin skimming off electricity providers' windfall profits retroactively from November, according to a draft paper seen by Reuters.\r\nOnly "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Finland introduces scheme to prevent power blackouts - Reuters","description":"Finland's national power grid operator said on Friday it will introduce voluntary procedures for companies and the public sector to help prevent electricity shortages.","publishedAt":"2022-11-11T12:45:00Z","content":"OSLO, Nov 11 (Reuters) - Finland's national power grid operator said on Friday it will introduce voluntary procedures for companies and the public sector to help prevent electricity shortages.\r\nThe N "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Lebanon raises cost of electricity for first time since 1990s  spokesperson - Reuters.com","description":"Lebanon's state power company Electricite du Liban (EDL) raised the price it charges for electricity for first time since the 1990s on Tuesday, an EDL spokesperson said.","publishedAt":"2022-11-01T13:02:00Z","content":"BEIRUT, Nov 1 (Reuters) - Lebanon's state power company Electricite du Liban (EDL) raised the price it charges for electricity for first time since the 1990s on Tuesday, an EDL spokesperson said.\r\nPo "},{"source":{"id":"","name":"Energy News Network"},"author":"Joshua Haiar","title":"This Is How South Dakota Gets Most of Its Energy","description":"The state produces twice as much electricity as it uses, exporting the rest to nearby states.","publishedAt":"2022-11-10T16:10:00Z","content":"Wind has surpassed hydroelectric power as the largest generator of electricity in South Dakota.\r\nLast year, over 52 of the electricity generated in the state came from wind turbines.\r\nThat's because "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Czech utility CEZ raises 2022 profit outlook as electricity prices rise - Reuters","description":"CEZ a href=\"\" target=\"_blank\"(CEZP.PR)/a lifted its full-year earnings outlook on Thursday, after the Czech utility posted a threefold rise in adjusted net profit in the third quarter on the back of soaring electri","publishedAt":"2022-11-10T07:00:28Z","content":"PRAGUE, Nov 10 (Reuters) - CEZ (CEZP.PR) lifted its full-year earnings outlook on Thursday, after the Czech utility posted a threefold rise in adjusted net profit in the third quarter on the back of  "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Ukraine war: Germany looks to renewables after Russian invasion","description":"Russia's invasion of Ukraine has crystallised the need for clean, renewable energy in Germany.","publishedAt":"2022-11-21T02:40:34Z","content":"As Germany struggles with the energy crisis sparked by the Russian invasion of Ukraine, many communities there are looking with added urgency at ways to try to wean themselves off gas and oil. Abensb "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Germany to cap electricity prices for households, industry - govt draft - Reuters.com","description":"Germany will introduce a price cap on electricity for households and industrial consumers as part of measures to help Europe's largest economy weather an energy crisis, according to a draft document from the chancellery seen by Reuters on Tuesday.","publishedAt":"2022-11-01T14:34:00Z","content":"BERLIN, Nov 1 (Reuters) - Germany will introduce a price cap on electricity for households and industrial consumers as part of measures to help Europe's largest economy weather an energy crisis, acco "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Ukraine urges limiting electricity use and readies voluntary Kherson evacuation - Reuters","description":"Ukraine urged residents of Kyiv and several other areas to limit electricity use as it seeks to recover from Russian strikes on the power grid while the elderly and vulnerable were preparing for a voluntary evacuation of war-ravaged Kherson.","publishedAt":"2022-11-21T23:30:00Z","content":"KYIV, Nov 22 (Reuters) - Ukraine urged residents of Kyiv and several other areas to limit electricity use as it seeks to recover from Russian strikes on the power grid while the elderly and vulnerabl "},{"source":{"id":"","name":"The Guardian"},"author":"Alex Lawson Energy correspondent","title":"National Grid creates 50m emergency fund for vulnerable households","description":"UK electricity distributor warns of exponential increase in customers seeking help with their energy billsThe chief executive of National Grid has warned of an exponential increase in customers seeking help with their energy bills as the company created a","publishedAt":"2022-11-01T06:00:02Z","content":"The chief executive of National Grid has warned of an exponential increase in customers seeking help with their energy bills as the company created a 50m emergency support fund.\r\nJohn Pettigrew said "},{"source":{"id":"","name":"The Guardian"},"author":"Kalyeena Makortoff","title":"Stronger profits at British Gas owner fuels new move to hand cash to shareholders","description":"Higher electricity and gas prices offset weaker performance in Centricas household servicesBritish Gas owner Centrica has revealed plans to hand more money back to shareholders, as stronger profits from high electricity and gas prices help offset poor perfor","publishedAt":"2022-11-10T09:11:41Z","content":"British Gas owner Centrica has revealed plans to hand more money back to shareholders, as stronger profits from high electricity and gas prices help offset poor performance of its retail arm.\r\nIn an  "},{"source":{"id":"","name":"VentureBeat"},"author":"Florian Douetteau, Dataiku","title":"Everyday AI could become as ubiquitous and necessary as electricity","description":"Like electricity, there will likely be a day when we cant imagine life without AI.Theres a lot of work to do to put the pieces into place.","publishedAt":"2022-10-26T18:07:00Z","content":"Register now for your free virtual pass to the Low-Code/No-Code Summit this November 9. Hear from executives from Service Now, Credit Karma, Stitch Fix, Appian, and more. Learn more.\r\nArtificial inte "},{"source":{"id":"","name":"The Guardian"},"author":"Alex Lawson Energy correspondent","title":"Britains biggest suppliers to offer discounts for off-peak electricity usage","description":"Ofgem approves National Grid scheme that could cut household bills by 100 this winter and reduce risk of power cutsBritains biggest energy suppliers have signed up to a scheme that will offer discounts to customers who cut their electricity usage at peak ti","publishedAt":"2022-11-04T13:39:38Z","content":"Britains biggest energy suppliers have signed up to a scheme that will offer discounts to customers who cut their electricity usage at peak times.\r\nThe sector regulator Ofgem formally approved a Nati "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Ukraine war: Kyiv water supply restored but blackouts remain","description":"Parts of Kyiv fall dark, despite power and water being restored after Russian attacks on Monday.","publishedAt":"2022-11-01T19:26:58Z","content":"The authorities in Kyiv say water and power supplies have been restored, a day after a wave of Russian attacks on the Ukrainian capital's infrastructure. \r\nAnnouncing the resumption of services, Kyiv "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Analysis: Hydro giant Canada faces provincial divides in electrification drive - Reuters","description":"Abundant hydropower in Canada, the world's third-biggest producer of the low-emissions electricity source, gives it a headstart on cleaning up its grid in a global drive to electrify vehicles and buildings and slow climate change.","publishedAt":"2022-10-27T10:11:00Z","content":"WINNIPEG, Manitoba, Oct 27 (Reuters) - Abundant hydropower in Canada, the world's third-biggest producer of the low-emissions electricity source, gives it a headstart on cleaning up its grid in a glo "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Nord Pool sets new Baltic power price thresholds to prevent spikes - Reuters.com","description":"Physical electricity exchange Nord Pool said on Wednesday it will introduce new price thresholds in its Baltic day-ahead market, permitting a second auction that could limit spikes like the one seen in August.","publishedAt":"2022-11-16T10:14:00Z","content":"OSLO, Nov 16 (Reuters) - Physical electricity exchange Nord Pool said on Wednesday it will introduce new price thresholds in its Baltic day-ahead market, permitting a second auction that could limit  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"German producer prices unexpectedly fall in October - Reuters","description":"German producer prices fell unexpectedly on the month in October, due primarily to a dip in prices for electricity and distributed natural gas, according to data released on Monday.","publishedAt":"2022-11-21T07:09:00Z","content":"BERLIN, Nov 21 (Reuters) - German producer prices fell unexpectedly on the month in October, due primarily to a dip in prices for electricity and distributed natural gas, according to data released o "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Energy crisis chips away at Europe's industrial might - Reuters.com","description":"Europe needs its industrial companies to save energy amid soaring costs and shrinking supplies, and they are delivering - demand for natural gas and electricity both fell in the past quarter.","publishedAt":"2022-11-02T05:17:00Z","content":"LONDON, Nov 2 (Reuters) - Europe needs its industrial companies to save energy amid soaring costs and shrinking supplies, and they are delivering - demand for natural gas and electricity both fell in "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"COP 27- U.S. House Republicans to press need for minerals at climate talks - Reuters","description":"Republican U.S. representatives heading to U.N. climate talks in Egypt plan to discuss developing critical minerals used in everything from nuclear energy and electricity transmission to batteries for electric vehicles, the head of the delegation said on Wedn","publishedAt":"2022-11-02T22:19:00Z","content":"WASHINGTON, Nov 2 (Reuters) - Republican U.S. representatives heading to U.N. climate talks in Egypt plan to discuss developing critical minerals used in everything from nuclear energy and electricit "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"North America at risk of tight electric supplies this winter -NERC - Reuters","description":"A large portion of North America is at risk of insufficient electricity supplies during peak winter conditions, the organization responsible for the reliability of the U.S. and Canadian power grids said on Thursday.","publishedAt":"2022-11-17T19:33:00Z","content":"Nov 17 (Reuters) - A large portion of North America is at risk of insufficient electricity supplies during peak winter conditions, the organization responsible for the reliability of the U.S. and Can "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Irish inflation hits 38-year high of 9.2 - Reuters","description":"Annual inflation in Ireland hit a 38-year high of 9.2 in October, up from 8.2 a month earlier after fresh electricity and gas price increases kicked in, Central Statistics Office data showed on Thursday.","publishedAt":"2022-11-10T11:18:00Z","content":"DUBLIN, Nov 10 (Reuters) - Annual inflation in Ireland hit a 38-year high of 9.2 in October, up from 8.2 a month earlier after fresh electricity and gas price increases kicked in, Central Statistic "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Octopus Energy to buy failed British energy supplier Bulb - Reuters.com","description":"Britain said on Saturday it had approved a deal for Octopus Energy to buy smaller firm Bulb, which was one of the largest energy suppliers to collapse last year due to soaring wholesale gas and electricity prices.","publishedAt":"2022-10-29T08:39:00Z","content":"LONDON, Oct 29 (Reuters) - Britain said on Saturday it had approved a deal for Octopus Energy to buy smaller firm Bulb, which was one of the largest energy suppliers to collapse last year due to soar "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Kyiv, other regions set for longer-than-planned blackouts after Russia strikes - Reuters","description":"The Ukrainian capital Kyiv and four regions may have to cut electricity supplies for longer than planned after Russian strikes overnight targeting energy infrastructure, a senior official said on Thursday.","publishedAt":"2022-10-27T18:10:00Z","content":"KYIV, Oct 27 (Reuters) - The Ukrainian capital Kyiv and four regions may have to cut electricity supplies for longer than planned after Russian strikes overnight targeting energy infrastructure, a se "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Pressure growing on Germany to accept gas price cap - Czech minister - Reuters","description":"A large group of European countries will keep pressuring Germany to accept a price cap on gas used for electricity generation, Czech Finance Minister Zbynek Stanjura said on Wednesday.","publishedAt":"2022-11-09T09:33:00Z","content":"PRAGUE, Nov 9 (Reuters) - A large group of European countries will keep pressuring Germany to accept a price cap on gas used for electricity generation, Czech Finance Minister Zbynek Stanjura said on "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Finland may resume OL3 nuclear tests on Dec 11, operator says - Reuters","description":"Test production of electricity at Finland's much-delayed Olkiluoto 3 nuclear reactor will restart on Dec. 11 at the earliest, while regular output is at best set to begin on Jan. 22, operator Teollisuuden Voima (TVO) said on Monday.","publishedAt":"2022-11-21T19:41:00Z","content":"OSLO, Nov 21 (Reuters) - Test production of electricity at Finland's much-delayed Olkiluoto 3 nuclear reactor will restart on Dec. 11 at the earliest, while regular output is at best set to begin on  "},{"source":{"id":"","name":"The Guardian"},"author":"Chaminda Jayanetti","title":"More than two million UK households are in debt on their electricity bills","description":"People are already unplugging fridges, washing clothes by hand and skipping meals  with worse to come this winter, Citizens Advice warnsThe number of UK households in arrears on their energy bills soared to record levels in the second quarter of this year, w","publishedAt":"2022-10-22T14:00:10Z","content":"The number of UK households in arrears on their energy bills soared to record levels in the second quarter of this year, with more than two million behind on their electricity payments.\r\nData from th "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"ashoaibinsider.com (Alia Shoaib)","title":"Kyiv preparing for possible total evacuation of its 3 million residents if the city loses electricity supply, report says","description":"A Kyiv official said residents would be requested to leave if the electricity grid failed amid the Russian blitz on energy infrastructure, the NYT reported.","publishedAt":"2022-11-06T16:21:29Z","content":"Kyiv is preparing for an emergency evacuation of its approximately three million residents if the city loses electricity due to ongoing Russian attacks, The New York Times reported.\r\nAfter suffering  "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"ztayebbusinessinsider.com (Zahra Tayeb)","title":"Europeans' gas bills have more than doubled even as governments pledge billions to cushion against soaring price rises","description":"Gas bills have increased by 111 while electricity bills have increased by 69 in all EU capitals since last October, according to VaasaETT.","publishedAt":"2022-11-07T15:44:37Z","content":"Europeans' natural gas bills have more than doubled since last year, even as governments spend billions to protect consumers from surging energy bills.\r\nAccording to energy consultancy VaasaETT, gas "},{"source":{"id":"","name":"The Guardian"},"author":"Isobel Koshiw, Lorenzo Tondo and Artem Mazhulin in Kherson","title":"I advise people to leave: Khersons leaders toil to turn city around","description":"After the euphoria of the Ukrainian citys recapture, many of its people are living at rock bottom, lacking the basics to surviveulliRussia-Ukraine war  latest news updates/li/ulBefore the war, the problems faced by the residents of Kherson were simi","publishedAt":"2022-11-18T11:05:49Z","content":"Before the war, the problems faced by the residents of Kherson were similar to those in many European cities: salaries, corruption, addiction, the need to improve public services. Now they centre on  "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"insiderinsider.com (James O'Malley)","title":"India is harnessing renewable energy through the world's biggest solar farm. Here's how it happened.","description":"The largest solar farm in the world is located in Rajasthan, India, and generates enough electricity to power 4.5 million homes.","publishedAt":"2022-11-22T20:27:32Z","content":"As the world slowly moves toward renewable energy, one of the most complex dimensions of the transition is the obligation imposed upon developing countries, which also suffer some of the worst impact "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Ukraine war: Kyiv warns Iran of consequences for supporting Russia","description":"Western officials believe Russia is using Iranian drones to target Ukrainian infrastructure.","publishedAt":"2022-11-05T15:51:01Z","content":"Kyiv has warned Iran that the \"consequences\" of supporting Russia in its war against Ukraine are greater than the \"benefits\".\r\nIt comes after Iran admitted for the first time it has supplied drones t "},{"source":{"id":"engadget","name":"Engadget"},"author":"Kris Holt","title":"UN warns there's currently 'no credible pathway' to keep temperature rise under 1.5C","description":"The United Nations\r\n has issued another\r\n stark warning that, under current policies, the planet is falling far short of the Paris Agreement goal of keeping the rise in global temperatures below 1.5 degrees Celsius. That's the threshold scientists say we have","publishedAt":"2022-10-27T14:43:23Z","content":"The United Nations\r\n has issued another\r\n stark warning that, under current policies, the planet is falling far short of the Paris Agreement goal of keeping the rise in global temperatures below 1.5  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Spain's gas demand for power generation jumped 80 in Jan-Sep, Enagas says - Reuters","description":"Demand for natural gas for power generation in Spain rose 80 in the first nine months of the year as neighbouring France and Portugal imported more electricity from the country, gas grid operator Enagas a href=\"\" tar","publishedAt":"2022-10-25T06:32:00Z","content":"MADRID, Oct 25 (Reuters) - Demand for natural gas for power generation in Spain rose 80 in the first nine months of the year as neighbouring France and Portugal imported more electricity from the co "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Czech lawmakers approve windfall tax on energy firms, banks - Reuters","description":"The Czech lower house of parliament approved on Friday a steep 60 windfall tax on energy firms and banks, aiming to raise 3.4 billion next year from profits deemed excessive to fund help for people and firms hit by soaring electricity and gas prices.","publishedAt":"2022-11-04T14:06:00Z","content":"PRAGUE, Nov 4 (Reuters) - The Czech lower house of parliament approved on Friday a steep 60 windfall tax on energy firms and banks, aiming to raise 3.4 billion next year from profits deemed excessi "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Heineken South Africa bets on solar to cut carbon emissions - Reuters","description":"A new solar power plant at the South African arm of Heineken NV a href=\"\" target=\"_blank\"(HEIN.AS)/a will supply 30 of a brewery's electricity demand, the brewer said on Wednesday, the latest company to seek an al","publishedAt":"2022-10-26T16:23:00Z","content":"JOHANNESBURG, Oct 26 (Reuters) - A new solar power plant at the South African arm of Heineken NV (HEIN.AS) will supply 30 of a brewery's electricity demand, the brewer said on Wednesday, the latest  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Germany needs gas turbines fast to stabilise power grids, says GE - Reuters.com","description":"Germany is moving too slowly to achieve the 30 gigawatts (GW) of gas turbine capacity by 2030 needed to stabilise its electricity distribution networks, plant maker General Electric (GE) a href=\"\" target=\"_blank\"(GE.N)","publishedAt":"2022-11-15T12:16:00Z","content":"FRANKFURT, Nov 15 (Reuters) - Germany is moving too slowly to achieve the 30 gigawatts (GW) of gas turbine capacity by 2030 needed to stabilise its electricity distribution networks, plant maker Gene "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"EU to provide aid to Ukraine over winter before possible hostility flareup - Reuters","description":"The EU will provide temporary cold-weather shelter, generators and electricity grid-repair kits to Ukraine to help it tide over the winter ahead of a possible flare-up of hostilities in the conflict with Russia, the bloc's crisis management commissioner Janez","publishedAt":"2022-11-17T11:46:00Z","content":"BRUSSELS, Nov 17 (Reuters) - The EU will provide temporary cold-weather shelter, generators and electricity grid-repair kits to Ukraine to help it tide over the winter ahead of a possible flare-up of "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"China Hongqiao: Plan to shift aluminium output on track despite Yunnan's power woes - Reuters.com","description":"China Hongqiao Group a href=\"\" target=\"_blank\"(1378.HK)/a will stick to its plan of moving 2 million tonnes of capacity to the country's southwest by the end of next year despite recent electricity supply disruptio","publishedAt":"2022-11-01T04:04:00Z","content":"BEIJING, Nov 1 (Reuters) - China Hongqiao Group (1378.HK) will stick to its plan of moving 2 million tonnes of capacity to the country's southwest by the end of next year despite recent electricity s "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"UK's Hunt says average household energy bill to rise, keeps cap - Reuters UK","description":"British finance minister Jeremy Hunt said the cost of an average household energy bill would rise to 3,000 pounds (3,555) a year from April after he reined in the scale of support for gas and electricity, but kept a price cap until 2024.","publishedAt":"2022-11-17T13:10:00Z","content":"LONDON, Nov 17 (Reuters) - British finance minister Jeremy Hunt said the cost of an average household energy bill would rise to 3,000 pounds (3,555) a year from April after he reined in the scale of "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Czech proposed power revenue cap to bring much higher revenue than expected, minister says - Reuters","description":"A Czech proposal to impose staggered revenue caps on prices charged by electricity producers by the type of power plants they operate would bring much higher revenue next year than 15 billion crowns (620.50 million) budgeted so far, Finance Minister Zbynek S","publishedAt":"2022-11-09T09:40:00Z","content":"PRAGUE, Nov 9 (Reuters) - A Czech proposal to impose staggered revenue caps on prices charged by electricity producers by the type of power plants they operate would bring much higher revenue next ye "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"France spends 8.4 bln euro to help companies with energy bills - Reuters","description":"France will spend 8.4 billion euros (8.67 billion) to help companies pay their energy bills, in a bid to cushion the impact of rising electricity and gas prices and help them compete with German businesses, its finance minister said on Saturday.","publishedAt":"2022-11-19T17:06:00Z","content":"PARIS, Nov 19 (Reuters) - France will spend 8.4 billion euros (8.67 billion) to help companies pay their energy bills, in a bid to cushion the impact of rising electricity and gas prices and help th "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Brazil's Eletrobras offers buyout to cut over 2300 jobs, a fifth of workforce - Reuters.com","description":"Brazil's electricity company Eletrobras a href=\"\" target=\"_blank\"(ELET6.SA)/a offered on Friday a voluntary buyout to well over 2,000 people representing roughly 22 of its workforce, in a first major cost cutting","publishedAt":"2022-10-28T23:41:00Z","content":"SAO PAULO, Oct 28 (Reuters) - Brazil's electricity company Eletrobras (ELET6.SA) offered on Friday a voluntary buyout to well over 2,000 people representing roughly 22 of its workforce, in a first m "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Evonik taps into EnBW wind park in industry's clean energy push - Reuters.com","description":"Evonik a href=\"\" target=\"_blank\"(EVKn.DE)/a secured about 100 megawatts (MW) of electricity per year from an EnBW a href=\"\" target=\"_blank\"(EBKG.DE)/a offshore wind park","publishedAt":"2022-11-03T10:15:00Z","content":"FRANKFURT, Nov 3 (Reuters) - Evonik (EVKn.DE) secured about 100 megawatts (MW) of electricity per year from an EnBW (EBKG.DE) offshore wind park, the latest in a string of German corporations to bulk "},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"'We are not afraid of the dark': Zelenskiy - Reuters","description":"Ukrainian President Volodymyr Zelenskiy late on Thursday (October 27) stood outside in the dark beside the wreckage of a downed drone and vowed that widespread Russian attacks on power plants would not break Ukrainian spirits. Kyiv and four regions may have t","publishedAt":"2022-10-28T09:08:38Z","content":"Posted \r\nUkrainian President Volodymyr Zelenskiy late on Thursday (October 27) stood outside in the dark beside the wreckage of a downed drone and vowed that widespread Russian attacks on power plant "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Analysis: COP27 fossil fuel lobbyists criticised as Africa energy debate simmers - Reuters","description":"African activists have called at the U.N. COP27 climate summit in Egypt for an end to expansion of fossil fuels on the continent, highlighting that the industry has left a large share of people still without electricity and mired in poverty.","publishedAt":"2022-11-10T20:25:00Z","content":"SHARM EL-SHEIKH, Egypt, Nov 10 (Thomson Reuters Foundation) - African activists have called at the U.N. COP27 climate summit in Egypt for an end to expansion of fossil fuels on the continent, highlig "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Dubai utility DEWA Q3 net profit up 10 to 863 mln - Reuters","description":"Dubai Electricity and Water Authority a href=\"\" target=\"_blank\"(DEWAA.DU)/a reported a 10 increase in third-quarter net profit to 3.17 billion dirhams (863 million) on Thursday, boosted by higher energy and wate","publishedAt":"2022-11-10T08:46:00Z","content":"DUBAI, Nov 10 (Reuters) - Dubai Electricity and Water Authority (DEWAA.DU) reported a 10 increase in third-quarter net profit to 3.17 billion dirhams (863 million) on Thursday, boosted by higher en "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Finland faces increased uncertainty around power supply, grid operator says - Reuters","description":"Finland's national power grid operator said on Tuesday the unavailability of the much-delayed Olkiluoto 3 (OL3) nuclear reactor increases uncertainty around the country's power sufficiency, especially in January.","publishedAt":"2022-11-22T11:18:00Z","content":"COPENHAGEN, Nov 22 (Reuters) - Finland's national power grid operator said on Tuesday the unavailability of the much-delayed Olkiluoto 3 (OL3) nuclear reactor increases uncertainty around the country "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Who will pay for Indonesia's clean energy bill","description":"The G20 is expected to unveil a climate deal to speed up Indonesia's transition to clean energy.","publishedAt":"2022-11-15T00:13:24Z","content":"Driving over the volcanic peaks which run through Bali, you pass scenes of natural and human-fashioned beauty that have made this \"island of the gods\" the jewel in Indonesia's tourist crown. \r\nAs you "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Angely Mercado","title":"A Carbon Capture Company Wants to Sell Credits on Tech That Hasnt Been Commercially Tested Yet","description":"UK-based clean energy company Drax Group is looking to sell offset credits tied to U.S.-based power plants that the company hasnt even built yet, Bloomberg reports. While the company is being vague about specifics, Drax says its first biomass plant with ca","publishedAt":"2022-11-05T00:00:00Z","content":"UK-based clean energy company Drax Group is looking to sell offset credits tied to U.S.-based power plants that the company hasnt even built yet, Bloomberg reports. While the company is being vague a "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Analysis: Energy market turmoil shakes Europe's green power plan - Reuters","description":"Europe's plan to roughly double renewable power generation by the end of the decade to cut its emissions and reliance on imported Russian fuel is under threat from market turbulence that has shaken the economics of the shift to low carbon energy.","publishedAt":"2022-11-03T06:47:00Z","content":"Nov 3 (Reuters) - Europe's plan to roughly double renewable power generation by the end of the decade to cut its emissions and reliance on imported Russian fuel is under threat from market turbulence "},{"source":{"id":"","name":"The Guardian"},"author":"Nicola Davis Science correspondent","title":"Spray-on metallic plastic could be used for wearable electronics","description":"Metallopolymer conducts electricity and can be painted, sprayed or moulded into any shapeA plastic material that has metallic properties and remains stable even when heated, chilled, left in the air or exposed to acid has been revealed, with researchers sayin","publishedAt":"2022-10-26T17:22:14Z","content":"A plastic material that has metallic properties and remains stable even when heated, chilled, left in the air or exposed to acid has been revealed, with researchers saying it could prove valuable in  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"UK's Hunt hikes energy windfall tax, extends it to power firms - Reuters UK","description":"British finance minister Jeremy Hunt said on Thursday the government would increase a windfall tax on oil and gas firms and extend it to power generation firms as he seeks to raise money to plug a major hole in the public finances.","publishedAt":"2022-11-17T11:57:00Z","content":"LONDON, Nov 17 (Reuters) - British finance minister Jeremy Hunt said on Thursday the government would increase a windfall tax on oil and gas firms and extend it to power generation firms as he seeks  "},{"source":{"id":"","name":"Lifehacker.com"},"author":"Becca Lewis","title":"Take These Safety Precautions Before Any DIY Project","description":"Doing your own home improvement projects and maintenance can be rewarding: In addition to saving money, theres a sense of accomplishment that comes with completing a task yourself. But accident rates for DIY enthusiasts might be higher than you think, so pra","publishedAt":"2022-10-24T15:00:00Z","content":"Doing your own home improvement projects and maintenance can be rewarding: In addition to saving money, theres a sense of accomplishment that comes with completing a task yourself. But accident rates "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"UK's SSE posts higher half-year profit on high prices, thermal power output - Reuters.com","description":"SSE Plc a href=\"\" target=\"_blank\"(SSE.L)/a, a British renewable power generator and network operator, posted a higher half-year profit on Wednesday, buoyed by strong performances from its thermal power plants amid hi","publishedAt":"2022-11-16T07:30:00Z","content":"Nov 16 (Reuters) - SSE Plc (SSE.L), a British renewable power generator and network operator, posted a higher half-year profit on Wednesday, buoyed by strong performances from its thermal power plant "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"German household gas prices rise 17.7 in H1 2022 - Reuters","description":"Gas prices for German households increased by 17.7 on average in the first half of this year from the second half of 2021, the Federal Statistics Office a href=\"\" target=\"_blank\"said on Monday/a.","publishedAt":"2022-10-31T07:33:00Z","content":"BERLIN, Oct 31 (Reuters) - Gas prices for German households increased by 17.7 on average in the first half of this year from the second half of 2021, the Federal Statistics Office said on Monday.\r\nE "},{"source":{"id":"","name":"Hackaday"},"author":"Lewin Day","title":"Dancers Now Help Power Glasgow Nightclub","description":"Humanity thus far has supplied most of its electricity needs by burning stuff, mostly very old stuff that burns great but is hard to replace. That stuff is getting increasingly expensive, and the p","publishedAt":"2022-10-24T14:00:34Z","content":"Humanity thus far has supplied most of its electricity needs by burning stuff, mostly very old stuff that burns great but is hard to replace. That stuff is getting increasingly expensive, and the pol "},{"source":{"id":"","name":"Hackaday"},"author":"Bryan Cockfield","title":"Keeping an Eye on Heating Oil","description":"Energy costs around the world are going up, whether its electricity, natural gas, or gasoline. This is leading to a lot of people looking for ways to decrease their energy use, especially he","publishedAt":"2022-11-02T15:30:18Z","content":"Energy costs around the world are going up, whether its electricity, natural gas, or gasoline. This is leading to a lot of people looking for ways to decrease their energy use, especially heading in "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Millions of lives under threat in Ukraine this winter - WHO","description":"Millions are at risk as winter sets in as many are without power, a WHO official warns.","publishedAt":"2022-11-21T17:53:12Z","content":"The lives of millions will be under threat in Ukraine this winter, the World Health Organization says. \r\nHalf of Ukraine's energy infrastructure is either damaged or destroyed, and 10 million are cur "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"In cold Ukraine village, Banksy mural offers warm bath - Reuters","description":"As they head into a cold winter, residents of a bombed-out Ukrainian village say they appreciate a warm bath in a mural painted by graffiti artist Banksy.","publishedAt":"2022-11-21T14:30:00Z","content":"HORENKA, Ukraine, Nov 21 (Reuters) - As they head into a cold winter, residents of a bombed-out Ukrainian village say they appreciate a warm bath in a mural painted by graffiti artist Banksy.\r\nThe mu "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Growing number of Germans won't be left in dark with blackout courses - Reuters","description":"Once purely the stuff of action movie plots, the prospect of the lights going out in Europe's biggest economy has become a conceivable threat during the current energy crisis.","publishedAt":"2022-11-11T17:16:00Z","content":"BERLIN, Nov 11 (Reuters) - Once purely the stuff of action movie plots, the prospect of the lights going out in Europe's biggest economy has become a conceivable threat during the current energy cris "},{"source":{"id":"engadget","name":"Engadget"},"author":"Mariella Moon","title":"Toyota's 2023 Prius is the most fuel-efficient vehicle in the lineup","description":"Toyota has unveiled the latest Prius at an event on the eve of the 2022 Los Angeles Auto Show, and it says the model is the most fuel-efficient entry in the lineup to date. The company designed the 2023 Prius, which will come in LE, XLE and Limited grades, wi","publishedAt":"2022-11-17T06:45:47Z","content":"Toyota has unveiled the latest Prius at an event on the eve of the 2022 Los Angeles Auto Show, and it says the model is the most fuel-efficient entry in the lineup to date. The company designed the 2 "},{"source":{"id":"","name":"The Guardian"},"author":"Dan Sabbagh in Kyiv","title":"Ukraine faces winter humanitarian crisis with energy grid on the brink","description":"Exclusive: Energy boss says virtually all non-nuclear power stations hit by Russian attacksulliRussia-Ukraine war  latest news updates/li/ulUkraine faces a winter humanitarian crisis unless it can prevent a collapse in its electricity supply caused","publishedAt":"2022-11-01T11:17:23Z","content":"Ukraine faces a winter humanitarian crisis unless it can prevent a collapse in its electricity supply caused by the relentless campaign of Russian bombing, the chief executive of the countrys nationa "},{"source":{"id":"","name":"Slashdot.org"},"author":"BeauHD","title":"California Regulators Propose Cutting Compensation For Rooftop Solar","description":"An anonymous reader quotes a report from the New York Times: For a second time in less than a year, regulators in California moved on Thursday to roll back the compensation that homeowners receive from utilities for the excess electricity their rooftop solar ","publishedAt":"2022-11-11T13:00:00Z","content":"For a second time in less than a year, regulators in California moved on Thursday to roll back the compensation that homeowners receive from utilities for the excess electricity their rooftop solar p "},{"source":{"id":"wired","name":"Wired"},"author":"William Ralston","title":"No, Qatars World Cup Cant Be Classed as Carbon-Neutral","description":"Despite efforts to reduce emissions, the 2022 FIFA tournament is highly carbon-intensive. And its road to net-zero relies on questionable carbon credits.","publishedAt":"2022-11-14T12:00:00Z","content":"Since controversially being awarded the 2022 FIFA World Cup back in 2010, Qatar has promised that the soccer tournamentwhich kicks off on November 20will be carbon-neutral. This would be an impressiv "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Ukrainians dance in the dark to battle power cuts","description":"Kremenchuk is among the worst-hit cities and Ukrainians say Russia's tactics only make them angrier.","publishedAt":"2022-11-07T12:20:22Z","content":"Russia's continuing assault on Ukraine's energy infrastructure with missile and drone strikes has seen the country's power reportedly cut by a third, with the grid operator now urging people to cut t "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Explainer: How Reuters analyzed emission rates for U.S. campus power plants - Reuters","description":"U.S. colleges like to stress their green credentials. Many also use some of the dirtiest fuels to power their campuses - and crank out pollution at higher rates than the typical commercial power plant, a href=\"","publishedAt":"2022-11-11T12:03:00Z","content":"Nov 11 (Reuters) - U.S. colleges like to stress their green credentials. Many also use some of the dirtiest fuels to power their campuses - and crank out pollution at higher rates than the typical co "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"New Slovak nuclear plant moves closer to launch - Reuters","description":"Slovakia's new 471 megawatt (MW) Mochovce Unit 3 nuclear power plant over the weekend took another step towards being ready to launch in early 2023, reaching a sustained chain reaction state, utility Slovenske Elektrarne said on its website.","publishedAt":"2022-10-24T10:30:00Z","content":"PRAGUE, Oct 24 (Reuters) - Slovakia's new 471 megawatt (MW) Mochovce Unit 3 nuclear power plant over the weekend took another step towards being ready to launch in early 2023, reaching a sustained ch "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Kyiv may face 'complete shutdown', nearly half Ukraine's energy system disabled - Reuters.com","description":"Kyiv city authorities warned on Friday that a \"complete shutdown\" of the capital's power grid was possible and Ukraine's prime minister said almost half the country's energy system had been disabled by a href=\"/world/europe/ukraine-hails-chinas-opposition-nu","publishedAt":"2022-11-18T17:40:00Z","content":"KYIV, Nov 18 (Reuters) - Kyiv city authorities warned on Friday that a \"complete shutdown\" of the capital's power grid was possible and Ukraine's prime minister said almost half the country's energy  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Ukrainians likely to live with blackouts until March-end - energy provider - Reuters","description":"Ukrainians are most likely to live with blackouts at least until the end of March, the head of a major energy provider said on Monday, as the government started free evacuations for people in Kherson to other regions.","publishedAt":"2022-11-21T23:37:00Z","content":"KYIV, Nov 21 (Reuters) - Ukrainians are most likely to live with blackouts at least until the end of March, the head of a major energy provider said on Monday, as the government started free evacuati "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Zelenskiy, standing in the dark, says 'shelling will not break us' - Reuters","description":"President Volodymyr Zelenskiy on Thursday stood outside in the dark beside the wreckage of a downed drone and vowed that widespread Russian attacks on power plants would not break Ukrainian spirits.","publishedAt":"2022-10-27T22:14:00Z","content":"Oct 27 (Reuters) - President Volodymyr Zelenskiy on Thursday stood outside in the dark beside the wreckage of a downed drone and vowed that widespread Russian attacks on power plants would not break  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Benin tests power of a rural mini-grid with 1.7 MW solar project - Reuters","description":"NEoT Offgrid Africa, an energy investment platform, founded by France's EDF a href=\"\" target=\"_blank\"(EDF.PA)/a and Paris-based asset manager Meridiam, on Monday said they were working with two other companies to de","publishedAt":"2022-11-14T11:34:02Z","content":"DAKAR, Nov 14 (Reuters) - NEoT Offgrid Africa, an energy investment platform, founded by France's EDF (EDF.PA) and Paris-based asset manager Meridiam, on Monday said they were working with two other  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Africa deserves right to use natural gas reserves - AfDB chief - Reuters.com","description":"The right of African countries to use their natural gas reserves should be reflected in any deal at the COP27 climate talks, the president of the African Development Bank told Reuters, even as some nations push to see use of the fuel curtailed.","publishedAt":"2022-11-15T15:24:00Z","content":"SHARM EL-SHEIKH, Nov 15 (Reuters) - The right of African countries to use their natural gas reserves should be reflected in any deal at the COP27 climate talks, the president of the African Developme "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Mondrian painting sells for record 51m at auction","description":"A 1930s painting by the Dutch artist has sold for 51m (43m) in New York - a record for his work.","publishedAt":"2022-11-15T12:43:38Z","content":"A 1930s painting by Piet Mondrian has sold for 51m (43m) in a New York auction, a record for the artist's work.\r\nThe piece was last sold in 1983 for 2.15m, which is equivalent to 6.4m (5.4m) in  "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"kduffyinsider.com (Kate Duffy)","title":"20 crew members supply Roman Abramovich's 600 million superyacht with provisions, electricity, and water every day as the Ukraine war wages on, report says","description":"Roman Abramovich's Solaris yacht has a truckload of food, including 20 cases of asparagus, delivered every week, a port worker told The NYT.","publishedAt":"2022-10-24T12:03:16Z","content":"A 600 million superyacht linked to Russian billionaire Roman Abramovich is being supplied with daily provisions amid the Ukraine war, The New York Times reported on Sunday.\r\nTwenty crew members tend "},{"source":{"id":"","name":"Boing Boing"},"author":"Rob Beschizza","title":"Why aren't you using a more efficient chest refrigerator","description":"Chest freezers with optional refrigerator modes are readily available. Why aren't you using one instead of an electricity-guzzling freestanding fridge Kris de Decker extols the virtues of chest refrigerators' vastly-improved efficiency and lower power consum","publishedAt":"2022-11-04T19:00:56Z","content":"Chest freezers with optional refrigerator modes are readily available. Why aren't you using one instead of an electricity-guzzling freestanding fridge Kris de Decker extols the virtues of chest refr "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Umar Shakir","title":"Honda sets up the first motorcycle battery swap station for its mobile power packs","description":"Honda has delivered its first station that lets electric motorcycle owners quickly swap batteries without waiting to charge. The first Power Pack Exchanger e: is for a Honda joint venture with Yamaha, Suzuki, and Kawasaki.","publishedAt":"2022-10-28T21:05:19Z","content":"Honda sets up the first motorcycle battery swap station for its mobile power packs\r\nHonda sets up the first motorcycle battery swap station for its mobile power packs\r\n / Gogoros got some big competi "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Justine Calma","title":"Californias last operating nuclear plant just got a 1.1 billion lifeline","description":"The Department of Energy announced new funding for Californias embattled Diablo Canyon nuclear power plant. The plant has become emblematic of a national debate over the future of nuclear energy.","publishedAt":"2022-11-22T18:00:18Z","content":"Californias last operating nuclear plant just got a 1.1 billion lifeline\r\nCalifornias last operating nuclear plant just got a 1.1 billion lifeline\r\n / The Diablo Canyon Power Plant is a major flash "},{"source":{"id":"cnn","name":"CNN"},"author":"Ivana Kottasov, Olga Voitovych, Nic Robertson","title":"Ukrainians are dreading the 'darkest winter' as Russia takes aim at the power grid","description":"As winter edges ever closer, Alla Melnychuk and her neighbors are racing against the time to save what little they have left.","publishedAt":"2022-10-29T00:42:59Z","content":"As winter edges ever closer in Ukraine, Alla Melnychuk and her neighbors are racing against the time to save what little they have left. \r\nTheir apartment building in Irpin was hit during some of the "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"China Sept aluminium output rises 9.3 y/y as power restrictions ease - Reuters","description":"China's primary aluminium production rose 9.3 in September from a year earlier, official data showed on Monday, with smelters in a few main regions ramping up output after authorities in the world's top metal producer relaxed power restrictions.","publishedAt":"2022-10-24T04:39:11Z","content":"BEIJING, Oct 24 (Reuters) - China's primary aluminium production rose 9.3 in September from a year earlier, official data showed on Monday, with smelters in a few main regions ramping up output afte "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Cuba welcomes 7th powership to its fleet in struggle to keep lights on - Reuters","description":"Cuba welcomed on Tuesday a seventh floating power plant to its growing fleet of shipboard generators as the communist-run country seeks to bolster its grid and bring relief to citizens who for months have suffered daily, hours-long blackouts.","publishedAt":"2022-11-15T16:13:00Z","content":"HAVANA, Nov 15 (Reuters) - Cuba welcomed on Tuesday a seventh floating power plant to its growing fleet of shipboard generators as the communist-run country seeks to bolster its grid and bring relief "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Ukraine races to restore power after Russian missile barrage - Reuters.com","description":"Power was fully restored on Wednesday in seven Ukrainian regions, including in the capital Kyiv, less that 24 hours after a a href=\"/world/europe/two-explosions-heard-ukraines-capital-smoke-rising-over-city-2022-11-15/\"Russian missile barrage/a on energy ","publishedAt":"2022-11-16T10:46:00Z","content":"KYIV, Nov 16 (Reuters) - Power was fully restored on Wednesday in seven Ukrainian regions, including in the capital Kyiv, less that 24 hours after a Russian missile barrage on energy infrastructure a "},{"source":{"id":"","name":"Science Daily"},"author":"","title":"Insects contribute to atmospheric electricity","description":"By measuring the electrical fields near swarming honeybees, researchers have discovered that insects can produce as much atmospheric electric charge as a thunderstorm cloud. This type of electricity helps shape weather events, aids insects in finding food, an","publishedAt":"2022-10-24T17:10:48Z","content":"By measuring the electrical fields near swarming honeybees, researchers have discovered that insects can produce as much atmospheric electric charge as a thunderstorm cloud. This type of electricity  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"UK to extend windfall taxes on energy firms -The Times - Reuters UK","description":"British Prime Minister Rishi Sunak and Chancellor of the Exchequer Jeremy Hunt are planning to extend windfall taxes on oil and gas companies to raise nearly 40 billion pounds (45.55 billion) over the five years, The Times reported on Wednesday.","publishedAt":"2022-11-02T22:53:00Z","content":"Nov 2 (Reuters) - British Prime Minister Rishi Sunak and Chancellor of the Exchequer Jeremy Hunt are planning to extend windfall taxes on oil and gas companies to raise nearly 40 billion pounds (45. "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"India's Sept. infrastructure output up 7.9 y/y - govt - Reuters India","description":"India's infrastructure output expanded 7.9 year-on-year in September, government data showed on Monday, compared to upwardly revised 4.1 growth in the previous month.","publishedAt":"2022-10-31T12:21:00Z","content":"NEW DELHI, Oct 31 (Reuters) - India's infrastructure output expanded 7.9 year-on-year in September, government data showed on Monday, compared to upwardly revised 4.1 growth in the previous month.\r "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"National Grid expects to invest up to 40 billion stg through 2026 - Reuters","description":"Britain's National Grid a href=\"\" target=\"_blank\"(NG.L)/a said on Thursday it expects to invest up to 40 billion pounds (45.55 billion) between 2022 and 2026, with a strong focus on decarbonisation of energy networks.","publishedAt":"2022-11-10T07:07:57Z","content":"Nov 10 (Reuters) - Britain's National Grid (NG.L) said on Thursday it expects to invest up to 40 billion pounds (45.55 billion) between 2022 and 2026, with a strong focus on decarbonisation of energ "},{"source":{"id":"","name":"Artofmanliness.com"},"author":"Brett  Kate McKay","title":"Sunday Firesides: Creativity Needs a Conduit","description":"To reach your desk lamp, the electricity thats made at a generating station must travel along transmission lines, distribution lines, and the wires that connect to the outlets in your home. Power requires a conduit through which to flow. This is as true for","publishedAt":"2022-10-23T03:46:58Z","content":"To reach your desk lamp, the electricity thats made at a generating station must travel along transmission lines, distribution lines, and the wires that connect to the outlets in your home.\r\nPower r "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Russian attacks on Ukraine's water, energy supplies particularly heinous -State Dept - Reuters.com","description":"Russia's attacks on Ukrainian water and energy supplies are aimed at exacerbating human suffering and are particularly heinous, U.S. State Department spokesman Ned Price told reporters on Tuesday.","publishedAt":"2022-11-01T18:20:00Z","content":"WASHINGTON, Nov 1 (Reuters) - Russia's attacks on Ukrainian water and energy supplies are aimed at exacerbating human suffering and are particularly heinous, U.S. State Department spokesman Ned Price "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"S.Africa's Eskom to implement 'stage 4' power cuts from Sunday noon - Reuters","description":"South Africa's Eskom will implement \"Stage 4 power\" cuts from noon on Sunday until early Monday morning, before switching between \"Stage 4\" and \"Stage 3\" until Wednesday, the power utility said in a statement.","publishedAt":"2022-10-23T09:51:00Z","content":"CAPE TOWN, Oct 23 (Reuters) - South Africa's Eskom will implement \"Stage 4 power\" cuts from noon on Sunday until early Monday morning, before switching between \"Stage 4\" and \"Stage 3\" until Wednesday "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"EPH to shift energy trading activities from Czech Republic after windfall tax approved - Reuters","description":"Czech-based energy group EPH will shift its energy commodities trading abroad in reaction to windfall tax approved by the lower house of parliament on Friday, the company said.","publishedAt":"2022-11-04T15:42:00Z","content":"PRAGUE, Nov 4 (Reuters) - Czech-based energy group EPH will shift its energy commodities trading abroad in reaction to windfall tax approved by the lower house of parliament on Friday, the company sa "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Why an old train could point to a clean energy future","description":"Progress is being made on systems to make hydrogen more economical to store and transport.","publishedAt":"2022-11-08T00:02:15Z","content":"An old diesel freight train in British Columbia, Canada is about to get a new lease of life.\r\nLocal firm Hydrogen in Motion (H2M) is currently converting the Green Goat locomotive to run on a mix of  "}]}