{"totalResults":3459,"articles":[{"source":{"id":"","name":"Gizmodo.com"},"author":"Germain Lussier","title":"A Friday the 13th Prequel Series Is Coming to Peacock","description":"It's called Crystal Lake, will be run by Hannibal's Bryan Fuller, but will contain no Jason Voorhees hockey masks.","publishedAt":"2022-10-31T19:25:00Z","content":"Its a Halloween miracle: Friday the 13th is coming back. Sort of. \r\nPeacock just announced a straight-to-series order for a new show called Crystal Lake, which is described as a Friday the 13th expan "},{"source":{"id":"cnn","name":"CNN"},"author":"Ben Church","title":"Vegas Golden Knights star Phil Kessel breaks NHL record after not missing a game for almost 13 years","description":"Vegas Golden Knights star Phil Kessel has broken the National Hockey League (NHL) 'ironman' record after he played his 990th consecutive game on Tuesday.","publishedAt":"2022-10-26T10:18:39Z","content":"Vegas Golden Knights star Phil Kessel has broken the National Hockey League (NHL) ironman record after he played his 990th consecutive game on Tuesday. \r\nIn taking to the ice against the San Jose Sha "},{"source":{"id":"nhl-news","name":"NHL News"},"author":"Nicholas J. Cotsonika","title":"Daniel, Henrik Sedin discuss NHL careers ahead of Hall of Fame inductions - NHL.com","description":"olliDaniel, Henrik Sedin discuss NHL careers ahead of Hall of Fame inductionsNHL.com\r\n/liliSedin twins, Luongo, Alfredsson lead Hockey Hall of Fames class of 2022Sportsnet.ca\r\n/liliSedin twins, Luongo, Alfredsson lead Hockey Hall of Fame's cl","publishedAt":"2022-11-12T21:15:12Z","content":"TORONTO -- Brian Burke was the general manager of the Vancouver Canucks when they maneuvered in the 1999 NHL Draft to select the Sedin twins, Daniel at No. 2, Henrik at No. 3.He said he gave a speech "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Ovechkin breaks Howe's record for most goals with one team - Reuters","description":"Washington Capitals' Alex Ovechkin broke Hall of Famer Gordie Howe's record for the most goals scored with a single National Hockey League (NHL) franchise on Saturday, earning his 787th career goal in the second period against the Arizona Coyotes.","publishedAt":"2022-11-06T01:18:00Z","content":"Nov 5 (Reuters) - Washington Capitals' Alex Ovechkin broke Hall of Famer Gordie Howe's record for the most goals scored with a single National Hockey League (NHL) franchise on Saturday, earning his 7 "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"After long World Cup absence, Canada ready to showcase new level - Reuters","description":"When Canada take to the pitch in their first World Cup match in 36 years on Wednesday, a country enamoured with ice hockey will showcase how much its men's soccer has evolved since they crashed out of the 1986 tournament winless and goalless.","publishedAt":"2022-11-22T17:23:00Z","content":"DOHA, Nov 22 (Reuters) - When Canada take to the pitch in their first World Cup match in 36 years on Wednesday, a country enamoured with ice hockey will showcase how much its men's soccer has evolved "},{"source":{"id":"","name":"Seths.blog"},"author":"Seth Godin","title":"Product idea: Talking discs","description":"Many offices and public settings are putting up clear plexiglas barriers to insulate staff from the spread of disease. While we can easily see through these partitions, it ends up creating a lot of yelling. What if there were a disc, about the size of a hocke","publishedAt":"2022-10-23T08:30:00Z","content":"Many offices and public settings are putting up clear plexiglas barriers to insulate staff from the spread of disease. While we can easily see through these partitions, it ends up creating a lot of y "},{"source":{"id":"","name":"Seths.blog"},"author":"Seth Godin","title":"No competition","description":"Theres no competition for cookbooks on making food out of soccer balls and hockey pucks. Theres no competition for software that charges you to find out the temperature on Mars. Theres no competition for a service that counts how many pairs of shoes you ow","publishedAt":"2022-11-20T10:40:00Z","content":"Theres no competition for cookbooks on making food out of soccer balls and hockey pucks.\r\nTheres no competition for software that charges you to find out the temperature on Mars.\r\nTheres no compet "},{"source":{"id":"wired","name":"Wired"},"author":"Matt Simon","title":"Scientists Are Uncovering Ominous Waters Under Antarctic Ice","description":"A super-pressurized, 290-mile-long river is running under the ice sheet. That could be bad news for sea-level rise.","publishedAt":"2022-11-08T13:00:00Z","content":"Its not a tremendous amount of melt per square foot. But over an area thats the size of two large European countries, that scales up. What we concluded is the melting is really smallit's like a milli "},{"source":{"id":"","name":"Sportsnet.ca"},"author":"","title":"Canadiens Nick Suzuki is a game-changing talent not seen by fans in a generation - Sportsnet.ca","description":"olliCanadiens Nick Suzuki is a game-changing talent not seen by fans in a generationSportsnet.ca\r\n/liliFlyers  Canadiens 11/19  NHL Highlights 2022NHL\r\n/liliNick Suzuki shootout winner Montreal Canadiens beat Philadelphia FlyersTSN\r\n/li","publishedAt":"2022-11-20T18:25:00Z","content":"Montreal Canadiens Nick Suzuki scores against Philadelphia Flyers goaltender Carter Hart during shootout NHL hockey action in Montreal, Saturday, November 19, 2022. (Graham Hughes/CP)"},{"source":{"id":"","name":"Montreal Gazette"},"author":"Pat Hickey","title":"Decisions loom for Canadiens' defence as Mike Matheson returns - Montreal Gazette","description":"olliDecisions loom for Canadiens' defence as Mike Matheson returnsMontreal Gazette\r\n/liliIce Chips: Mike Matheson season debut Montreal CanadiensTSN\r\n/liliDefenceman Mike Matheson set to make Canadiens debut Saturday vs. FlyersSportsnet.ca\r\n","publishedAt":"2022-11-18T19:46:27Z","content":"Article content\r\nDefenceman Mike Matheson is poised to make his Canadiens debut Saturday against the Philadelphia Flyers (7 p.m., CITY SNE, TVA Sports, TSN 690 Radio, 98.5 FM).\r\nArticle content\r\nThe  "},{"source":{"id":"","name":""},"author":"The Canadian Press","title":"Kadri, Flames stay red hot in win over Penguins - TSN","description":"olliKadri, Flames stay red hot in win over PenguinsTSN\r\n/liliKadri, Huberdeau lead Flames to dominant victory over PenguinsSportsnet.ca\r\n/liliPenguins  Flames 10/25  NHL Highlights 2022NHL\r\n/liliOverconfidence  Suprise: Carter Admits ","publishedAt":"2022-10-26T05:28:40Z","content":"CALGARY It has been a smooth transition in Calgary for Nazem Kadri.\r\nKadri remained red-hot on Tuesday, extending his NHL points streak to six games with two goals and an assist to lead the Flames to "},{"source":{"id":"","name":"Sportsnet.ca"},"author":"","title":"Flames looking to regain form with injuries, pressure mounting during losing streak - Sportsnet.ca","description":"olliFlames looking to regain form with injuries, pressure mounting during losing streakSportsnet.ca\r\n/liliFlames' Huberdeau sidelined day-to-day with upper-body injuryTSN\r\n/liliThe revamped Calgary Flames are still building chemistry. Whats t","publishedAt":"2022-11-09T21:47:00Z","content":"The Hockey Central panel talks about Calgary Flames head coach Darryl Sutter's comments to the media about his team's lack of defensive depth, and whether they were intended to criticize management o "},{"source":{"id":"","name":"Sportsnet.ca"},"author":"","title":"Senators Josh Norris doesnt need surgery, to be re-evaluated in January - Sportsnet.ca","description":"olliSenators Josh Norris doesnt need surgery, to be re-evaluated in JanuarySportsnet.ca\r\n/liliNorris: Feels good to be rehabbing with the goal of coming back this seasonTSN\r\n/liliInjury Updates: Norris, Saad, Matheson, Mitchellprohockeyrum","publishedAt":"2022-11-07T16:37:00Z","content":"Ottawa Senators' Josh Norris, left, and Philadelphia Flyers' Travis Konecny battle for the puck during the second period of an NHL hockey game, Friday, April 29, 2022, in Philadelphia. (Matt Slocum/A "},{"source":{"id":"","name":"Sportsnet.ca"},"author":"","title":"Maple Leafs' Ilya Samsonov returns to ice, timeline for return uncertain - Sportsnet.ca","description":"olliMaple Leafs' Ilya Samsonov returns to ice, timeline for return uncertainSportsnet.ca\r\n/liliMaple Leafs Injury Report: Goalies and defencemenPension Plan Puppets\r\n/liliMaple Leafs sign Keith Petruzzelli to NHL dealBreakfast Television\r\n/","publishedAt":"2022-11-08T17:29:00Z","content":"Ottawa Senators' Claude Giroux (28) shoots as Toronto Maple Leafs goaltender Ilya Samsonov (35) and Auston Matthews (34) try to make the save during second period NHL hockey action in Toronto on Satu "},{"source":{"id":"","name":""},"author":"TSN.ca Staff","title":"Ice Chips: Mike Matheson season debut Montreal Canadiens - TSN","description":"olliIce Chips: Mike Matheson season debut Montreal CanadiensTSN\r\n/liliDefenceman Mike Matheson set to make Canadiens debut Saturday vs. FlyersSportsnet.ca\r\n/liliDecisions loom for Canadiens' defence as Mike Matheson returnsMontreal Gazette\r\n","publishedAt":"2022-11-19T16:18:07Z","content":"Keep updated on all the injury news and roster updates from around the NHL with daily Ice Chips.\r\nMontreal Canadiens\r\nDefenceman Mike Matheson will make his season debut on Saturday against the Phila "},{"source":{"id":"","name":"Makezine.com"},"author":"David Calkins","title":"Getting Involved: Robot Sports Arent Just Combat  Theres Something Fun for Everyone","description":"From 1997 to 2004, I competed around the world in a number of different robot categories, primarily sumo robots. I also worked a lot of shows (judges are always in demand) while teaching robotics at San Francisco State University. One thing I noticed in that ","publishedAt":"2022-11-14T16:00:00Z","content":"From 1997 to 2004, I competed around the world in a number of different robot categories, primarily sumo robots. I also worked a lot of shows (judges are always in demand) while teaching robotics at  "},{"source":{"id":"abc-news","name":"ABC News"},"author":"Teddy Grant","title":"16 High school hockey players injured after semi-truck crashes into team bus","description":"At least 16 were injured Saturday night, after a tractor-trailer ran a red light and slammed into a bus carrying high school hockey players in Warsaw, Indiana.","publishedAt":"2022-11-13T22:38:57Z","content":"At least 16 were injured Saturday night, after a tractor-trailer ran a red light and slammed into a bus carrying high school hockey players in Warsaw, Indiana, according to law enforcement officials. "},{"source":{"id":"nhl-news","name":"NHL News"},"author":"Mike G. Morreale","title":"2023 Draft: Bedard gets A on Central Scouting's players to watch list - NHL.com","description":"olli2023 Draft: Bedard gets A on Central Scouting's players to watch listNHL.com\r\n/liliCan Adam Fantilli make a legit case to go No. 1 over Bedard in the 2023 NHL draftYahoo Canada Sports\r\n/liliCranbrook Bucks LW hits preliminary watch list f","publishedAt":"2022-10-25T15:00:00Z","content":"Connor Bedard, the projected No. 1 pick in the 2023 NHL Draft, earned an A rating on NHL Central Scouting's preliminary players to watch list presented by BioSteel released Tuesday.The list is a comp "},{"source":{"id":"","name":"Maple Leafs Hot Stove"},"author":"Zach Payne","title":"Toronto Maple Leafs at Los Angeles Kings - Game 9 Preview, Projected Lines  TV Info - Maple Leafs Hot Stove","description":"olliToronto Maple Leafs at Los Angeles Kings - Game 9 Preview, Projected Lines  TV InfoMaple Leafs Hot Stove\r\n/liliHockey Night in Canada: Maple Leafs vs. KingsCBC Sports\r\n/liliMaple Leafs' struggles continue in uninspiring loss to KingsSp","publishedAt":"2022-10-29T18:56:49Z","content":"After back-to-back losses, the Maple Leafs are looking to get their road trip back on track as they continue their trek through California with their annual stop in Los Angeles (7 p.m. EST, Sportsnet "},{"source":{"id":"","name":"YouTube"},"author":"","title":"Penguins  Blackhawks 11/20  NHL Highlights 2022 - NHL","description":"olliPenguins  Blackhawks 11/20  NHL Highlights 2022NHL\r\n/liliMalkin scores in 1,000th game, Penguins beat Blackhawks on night honouring HossaSportsnet.ca\r\n/liliPenguins Takeaways: Why the Penguins Struggled, Crosby Rescues 5-3 Win in Chicago","urlToImage":"","publishedAt":"2022-11-21T03:20:16Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":"","name":"YouTube"},"author":"","title":"Eichel's superhuman effort gives the Golden Knights the OT win - NHL","description":"olliEichel's superhuman effort gives the Golden Knights the OT winNHL\r\n/liliEichel scores in OT to lift Golden Knights over JetsSportsnet.ca\r\n/liliGame 9: Jets vs Golden Knights pre-game reportIllegal Curve Hockey\r\n/liliMorning Skate Rep","urlToImage":"","publishedAt":"2022-10-31T02:45:59Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":"","name":"YouTube"},"author":"","title":"Golden Knights  Canadiens 11/5  NHL Highlights 2022 - NHL","description":"olliGolden Knights  Canadiens 11/5  NHL Highlights 2022NHL\r\n/liliGolden Knights beat Canadiens to extend winning streak to seven gamesSportsnet.ca\r\n/liliCanadiens vs. Golden Knights: Game thread, rosters, lines, how to watchHabs Eyes on th","urlToImage":"","publishedAt":"2022-11-06T02:19:49Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":"","name":""},"author":"TSN.ca Staff","title":"Nikolaj Ehlers Winnipeg Jets sports hernia surgery - TSN","description":"olliNikolaj Ehlers Winnipeg Jets sports hernia surgeryTSN\r\n/liliJets' Ehlers to have sports hernia surgery, expected to return this seasonSportsnet.ca\r\n/liliJets forward Nikolaj Ehlers to have sports hernia surgeryNHL.com\r\n/liliJets Need","publishedAt":"2022-11-19T17:15:56Z","content":"Winnipeg Jets forward Nikolaj Ehlers will undergo sports hernia surgery, head coach Rick Bowness said on Saturday.\r\nNHLJets Bowness said Ehlers felt something wasnt right in the October 17 game in  "},{"source":{"id":"abc-news","name":"ABC News"},"author":"Aaron Katersky, Emily Shapiro","title":"Man gets 25 years in 'brutal killing' of Queens mom","description":"David Bonola was sentenced Wednesday to 25 years in prison for stabbing Orsolya Gaal to death and dragging her body in a hockey bag down a New York City street.","publishedAt":"2022-11-16T18:09:39Z","content":"A man was sentenced Wednesday to 25 years in prison for stabbing a New York City mom of two to death and dumping her body in one of her son's hockey bags.\r\nDavid Bonola, 44, pleaded guilty earlier th "},{"source":{"id":"engadget","name":"Engadget"},"author":"Daniel Cooper","title":"iRobots flagship Roomba Combo J7 earned its place in my smart home","description":"For most people, theres no such thing as an essential Roomba if you can work your own vacuum cleaner. Theyre nice to have, and do a job, but youll get better results if you can put the work in yourself. They also require more management than Rosie the Robo","publishedAt":"2022-11-17T15:00:10Z","content":"For most people, theres no such thing as an essential Roomba if you can work your own vacuum cleaner. Theyre nice to have, and do a job, but youll get better results if you can put the work in yourse "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Arun Srinivasan","title":"Maple Leafs fans give Borje Salming massive ovations during two tributes - Yahoo Canada Sports","description":"olliMaple Leafs fans give Borje Salming massive ovations during two tributesYahoo Canada Sports\r\n/liliWhy emotional Brje Salming reception hits home for young Maple LeafsSportsnet.ca\r\n/liliToronto Maple Leafs welcome back Brje SalmingNH","publishedAt":"2022-11-13T00:26:00Z","content":"Hockey Hall of Fame member and former Toronto Maple Leafs Brje Salming waves to the crowd. (Photo by Mark Blinch/NHLI via Getty Images)\r\nToronto Maple Leafs legend Borje Salming was honoured ahead o "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"Ryan Reynolds at the Canadian Tire Centre Tuesday - CTV News Ottawa","description":"olliRyan Reynolds at the Canadian Tire Centre TuesdayCTV News Ottawa\r\n/liliOwnership hopeful Ryan Reynolds gets ovation from Senators fans at CTCSportsnet.ca\r\n/liliCanadian actor Ryan Reynolds confirms interest in buying Ottawa SenatorsCBC.c","publishedAt":"2022-11-09T10:30:25Z","content":"Canadian actor Ryan Reynolds was in attendance at the Canadian Tire Centre Tuesday night.\r\nHe waved to the crowd from a private suite on the 100 level when introduced during the first period of the g "},{"source":{"id":"","name":"The Guardian"},"author":"Andy Bull","title":"A new consensus Change in the air as concussion conference kicks off  Andy Bull","description":"Much is at stake as the sixth International Consensus Conference on Concussion in Sport gets under way in AmsterdamYou may not know that the sixth International Consensus Conference on Concussion in Sport is being held in Amsterdam this week. You may never ev","publishedAt":"2022-10-27T07:00:23Z","content":"You may not know that the sixth International Consensus Conference on Concussion in Sport is being held in Amsterdam this week. You may never even have heard of the Concussion in Sport Group who are  "},{"source":{"id":"","name":"Toronto Sun"},"author":"Steve Simmons","title":"SIMMONS: Maple Leafs GM Kyle Dubas stays silent in the midst of a crisis - Toronto Sun","description":"olliSIMMONS: Maple Leafs GM Kyle Dubas stays silent in the midst of a crisisToronto Sun\r\n/liliMcIndoe: The Maple Leafs are a mess and its hard to watch, in more ways than oneThe Athletic\r\n/liliStruggling Maple Leafs rally around Mitch Marner ","publishedAt":"2022-11-01T22:24:47Z","content":"Article content\r\nThey stood along the railing at the Ford Performance Centre president Brendan Shanahan, beside general manager Kyle Dubas, beside special assistant Jason Spezza, beside assistant GM  "},{"source":{"id":"","name":"HYPEBEAST"},"author":"infohypebeast.com (HYPEBEAST)","title":"Canyaon Crafts Custom Boots From Hockey Gloves","description":"Canyaon, born Alexander \"Sasha\" Osipov, is a 22-year-old sneaker customizer out of Russia who's made waves with his out-of-the-box ideas such as blood pack-infused Nikes, unofficial Arc'teryx x Corona low-top boots, and a Nike Air Cabbage. Trained as an elect","publishedAt":"2022-11-18T10:17:44Z","content":"Canyaon, born Alexander Sasha Osipov, is a 22-year-old sneaker customizer out of Russia whos made waves with his out-of-the-box ideas such as blood pack-infused Nikes, unofficial Arcteryx x Coron "},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Mike Brehm, USA TODAY","title":"Boston Bruins part ways with controversial Mitchell Miller two days after signing him","description":"Mitchell Miller had admitted in an Ohio juvenile court to bullying a Black classmate who had developmental disabilities when he was 14.","publishedAt":"2022-11-07T03:13:36Z","content":"The Boston Bruins parted ways Sunday with Mitchell Miller, the controversial defenseman they had signed to an entry-level contract on Friday, and issued an apology to the victim of his bullying.\r\nMil "},{"source":{"id":"nhl-news","name":"NHL News"},"author":"Canucks Communications","title":"CSE, Rogers Communications  Sportsnet Announce Partnership Extension - NHL.com","description":"olliCSE, Rogers Communications  Sportsnet Announce Partnership ExtensionNHL.com\r\n/liliCanucks to host \"major news\" press conference on Monday  OffsideDaily Hive\r\n/liliCanucks, Rogers and Sportsnet announce 10-year partnership extensionSpor","publishedAt":"2022-10-31T21:27:34Z","content":"October 31, Vancouver, B.C. - Canucks Sports amp; Entertainment (CSE), Rogers Communications and Sportsnet today announced a new agreement that will see the long-time partners continue to collaborat "},{"source":{"id":"","name":"NPR"},"author":"Bill Chappell","title":"NHL team yanks contract of a player who bullied a Black classmate with disabilities","description":"It's the second time Mitchell Miller's path to the NHL has been abruptly blocked. The mother of the student who was abused tells NPR that her son is still struggling.","publishedAt":"2022-11-07T21:58:39Z","content":"The Boston Bruins have cut ties with Mitchell Miller after current players and the NHL spoke out against Miller's signing. Miller admitted to bullying a Black classmate with developmental disabilitie "},{"source":{"id":"","name":"The Guardian"},"author":"Paul MacInnes","title":"One third of people injured playing sport report long-term effects in survey","description":"ulliStudy by Podium charity and YouGov reveals troubling trends/liliMajority do not know how to minimise risk during sport/li/ulA third of people who have suffered a sporting injury say they are still affected by the consequences today, amid warni","publishedAt":"2022-11-10T06:00:47Z","content":"A third of people who have suffered a sporting injury say they are still affected by the consequences today, amid warnings that injuries must be taken more seriously by participants and governing bod "},{"source":{"id":"polygon","name":"Polygon"},"author":"Austen Goslin","title":"Hannibal creators Friday the 13th rebootseries cantuse Jason","description":"Crystal Lake will be a Friday the 13th prequel, created by Hannibals Bryan Fuller, and produced by A24, the studio behind movies like The Witch and shows like Euphoria. Jason Voorhees will not be in the series.","publishedAt":"2022-10-31T21:46:28Z","content":"One of the most famous slasher franchises around is coming back, but without its iconic killer. Friday the 13th is getting a prequel series at Peacock, which will be written and showrun by Bryan Full "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"NHL roundup: Alex Ovechkin nets NHL-record 787th goal with one team - Reuters","description":"Nick Ritchie capped a two-goal performance by scoring with 35.4 seconds remaining in the third period on Saturday, as the Arizona Coyotes overcame Alex Ovechkin's NHL-record 787th goal with one franchise to post a 3-2 victory over the host Washington Capitals.","publishedAt":"2022-11-06T07:56:00Z","content":"November 6 - Nick Ritchie capped a two-goal performance by scoring with 35.4 seconds remaining in the third period on Saturday, as the Arizona Coyotes overcame Alex Ovechkin's NHL-record 787th goal w "},{"source":{"id":"nhl-news","name":"NHL News"},"author":"Dave McCarthy","title":"Maple Leafs not focused on coach Keefe's job security - NHL.com","description":"olliMaple Leafs not focused on coach Keefe's job securityNHL.com\r\n/liliShould Leafs Coaching Staff Hold Star Players More Accountable For Play Of Late  Tim and FriendsSPORTSNET\r\n/liliStruggling Maple Leafs rally around Mitch Marner and Sheld","publishedAt":"2022-11-01T23:43:01Z","content":"TORONTO -- The Toronto Maple Leafs are only focused on improving, not coach Sheldon Keefe's job security.\"We're out there trying to win games, that's all we are thinking about,\" defenseman Morgan Rie "},{"source":{"id":"","name":"Vancouver Is Awesome"},"author":"Daniel Wagner","title":"Retooling on the fly has led to endless mediocrity for the Canucks - Vancouver Is Awesome","description":"olliRetooling on the fly has led to endless mediocrity for the CanucksVancouver Is Awesome\r\n/liliAfter jerseys thrown, Canucks feel fan frustrations: Its something that hits homeSportsnet.ca\r\n/liliMiller: Up to fans 'if they want to throw t","publishedAt":"2022-10-24T21:00:59Z","content":"Fan frustration with the Vancouver Canucks came to a head on Saturday night at their home opener.\r\nAfter losing five-straight games on the road to start the season, the Canucks crashed and burned on "},{"source":{"id":"","name":"Sports Illustrated"},"author":"Wilton Jackson","title":"Ovechkin Makes NHL History With Record-Breaking Goal for Capitals","description":"The Capitals star added another outstanding feat to his future Hall of Fame hockey career.","publishedAt":"2022-11-06T02:25:02Z","content":"Alex Ovechkin added another outstanding feat to his future Hall of Fame hockey career.\r\nOvechkin notched his 787th goal with the Capitals against the Coyotes on Saturday, setting a NHL record for the "},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Mike Chiari","title":"Former All-Star P.K. Subban to Join ESPN as Hockey Analyst After Retiring from NHL","description":"ESPN a href=\"\"announced/a Thursday that former Montreal...","publishedAt":"2022-11-10T14:15:36Z","content":"Isaiah Trickey/FilmMagic\r\nESPN announced Thursday that former Montreal Canadiens defenseman P.K. Subban will join the network as an NHL analyst.\r\nSubban, who signed a three-year contract with ESPN fo "},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joe Yerdon","title":"The 8 Biggest Disappointments of the 2022-2023 NHL Season So Far","description":"One of the beauties of life is that for everything that\nhappens, there is balance. Thats even true in hockey Earlier this week, Sara Civian looked\nat a...","publishedAt":"2022-10-28T11:56:15Z","content":"Andrew Bershaw /Icon_Sportswire\r\nFirst off, everything is fine with the Avalanche. They're off to a great start and the team still plays fast and dangerous hockey. But they're doing it without Gabrie "},{"source":{"id":"","name":"The New Yorker"},"author":"Nick Paumgarten","title":"Into the Gizzverse with Shrimp and Juicy","description":"Two members of the Australian rock band King Gizzard  the Lizard Wizardwhich just released its sixth album in the past yearspend a rare day off at a skate park in Brooklyn.","publishedAt":"2022-10-31T10:00:00Z","content":"King Gizzard amp; the Lizard Wizard, the pretty-much-every-genre rock band from Australia, boarded a tour bus in Montreal at 2A.M. one night this month and arrived in Brooklyn nine hours later. No  "},{"source":{"id":"bloomberg","name":"Bloomberg"},"author":"","title":"Question 1, Bostonian Spending and Hockey Masks","description":"Baystate Business Hour","publishedAt":"2022-11-04T22:43:44Z","content":"Baystate Business Hour Podcast Browse all episodesBloomberg Baystate Business\r\nWith Tom Moroney, Joe Shortsleeve, Anne Mostue and Janet Wu\r\n11-4-22\r\nDoug Banks, Boston Business Journal editor-in-chie "},{"source":{"id":"","name":"Sports Illustrated"},"author":"Zach Koons","title":"Michigan State Hockey Player Says Opponent Used Racial Slurs","description":"The senior says the incidents took place during a Nov. 11 game against Ohio State.","publishedAt":"2022-11-22T15:59:27Z","content":"A Michigan State hockey player said he was the target of a racial slur on multiple occasions during a game against Ohio State earlier this month.\r\nJagger Joshua, who is Black, took to social media Mo "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"England and Wales Hockey World Cup bid unsuccessful","description":"England and Wales have been unsuccessful in their bid to host the men's Hockey World Cup in 2026.","publishedAt":"2022-11-03T16:22:24Z","content":"The last time the men's World Cup was held in the United Kingdom was in 1986\r\nEngland and Wales have been unsuccessful in their bid to host the men's Hockey World Cup in 2026.\r\nBelgium and the Nether "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Nottingham Panthers sack head coach Graham","description":"Nottingham Panthers sack head coach Gary Graham after less than four months with the Elite Ice Hockey League side.","publishedAt":"2022-11-22T10:36:25Z","content":"The Nottingham Panthers job was Gary Graham's first in British ice hockey\r\nNottingham Panthers have sacked head coach Gary Graham after less than four months with the Elite Ice Hockey League side.\r\nT "},{"source":{"id":"","name":"Maple Leafs Hot Stove"},"author":"Anthony Petrielli","title":"Game in 10: Maple Leafs struggle to break through offensively in loss to Pittsburgh - Maple Leafs Hot Stove","description":"olliGame in 10: Maple Leafs struggle to break through offensively in loss to PittsburghMaple Leafs Hot Stove\r\n/liliMaple Leafs dealt yet another painful lesson on what it means to be eliteSportsnet.ca\r\n/liliToronto Maple Leafs Need 4 Points Fr","publishedAt":"2022-11-12T03:14:31Z","content":"Before we get into the game, lets take a moment to recognize Brje Salming.\r\nWhat a powerful ovation and moment it was to see him standing arm-in-arm alongside Darryl Sittler and Mats Sundin. There c "},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Scott Polacek","title":"Michigan State's Jagger Joshua Says Ohio State Hockey Player Used Racial Slur","description":"Jagger Joshua, who is a forward on Michigan State's men's hockey team, said an Ohio State player used a racial slur \"during a game between the two Big Ten...","publishedAt":"2022-11-22T00:50:18Z","content":"Scott W. Grau/Icon Sportswire via Getty Images\r\nJagger Joshua, who is a forward on Michigan State's men's hockey team, said an Ohio State player directed a racial slur at him \"multiple times\" during  "},{"source":{"id":"","name":"The Guardian"},"author":"Patrick Wintour in Bali","title":"Sergei Lavrov, a fixture of Russian diplomacy facing his toughest test in Ukraine","description":"That Moscows foreign minister has outlasted seven US secretaries of state is testament to his usefulness to Vladimir PutinulliRussia-Ukraine war  latest news updates/li/ulIf Sergei Lavrov, the 72-year-old whiskey-drinking Russian foreign minister, h","publishedAt":"2022-11-15T08:30:14Z","content":"If Sergei Lavrov, the 72-year-old whiskey-drinking Russian foreign minister, had indeed suffered a heart flutter soon after stepping off the plane in Bali it would have been understandable for a man  "},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joe Yerdon","title":"Predicting Team USA's Roster for the 2025 World Cup of Hockey","description":"Being tapped to be the (imaginary) general manager of Team USA for the 2025 World Cup of Hockey is a tremendous honor I was proud to accept. After all, its...","publishedAt":"2022-11-21T13:09:56Z","content":"AP Photo/Jeffrey T. Barnes\r\nFirst line: Jason Robertson, Auston Matthews, Alex DeBrincat\r\nSecond line: Matthew Tkachuk, Jack Eichel, Cole Caufield\r\nThird line: Brady Tkachuk, Tage Thompson, Jack Hugh "},{"source":{"id":"","name":"Digital Trends"},"author":"Simon Cohen","title":"A Canadian grocery store is selling second-gen AirPods for just 89","description":"A discount grocery chain in Ontario, Canada just became the best place to buy Apple's iconic AirPods.","publishedAt":"2022-11-08T18:33:37Z","content":"Canada, the home of hockey, doughnuts, and free health care, is now one of the best places to buy the second-gen Apple AirPods. In an unusual move, No Frills  a grocery chain owned by Canadian food  "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Audra Heinrichs","title":"Man Admits to Killing Former Lover After 'Heated Argument' Over Affair","description":"On an early morning in April, the remains of Orsolya Gaal, an NYC-based mother of two, were found by a man walking his dog in a park near where she lived...","publishedAt":"2022-11-04T14:00:00Z","content":"Photo: zz/GWR/STAR MAX/IPx ,Orsolya Gaal Facebook (AP)\r\nOn an early morning in April, the remains of Orsolya Gaal, an NYC-based mother of two, were found by a man walking his dog in a park near where "},{"source":{"id":"","name":"NPR"},"author":"The Associated Press","title":"Red Bull Formula One owner Dietrich Mateschitz dies at 78","description":"Austrian billionaire Mateschitz was co-founder of energy drink company Red Bull, which says it sold nearly 10 billion cans of its caffeine and taurine-based drink in 172 countries worldwide last year.","publishedAt":"2022-10-23T07:09:41Z","content":"Dietrich Mateschitz, co-founder of energy drink company Red Bull and founder and owner of the Red Bull Formula One racing team, speaks on June 13, 2022, in Salzburg, Austria.\r\nAP\r\nAUSTIN, Texas Austr "},{"source":{"id":"","name":"Entrepreneur"},"author":"Eric Ryan","title":"Setting Measurable Goals Is Critical to Your Strategic Plan (and Your Success). Here's Why.","description":"If you want your business to meet its goals, achieve greater organizational capacity, hit its mission, generate more revenue and be more financially secure, here's what you need to do.","publishedAt":"2022-11-03T12:00:00Z","content":"As an entrepreneur or business leader, there are myriad reasons why you should care about goals: They help lead you in the right direction for your vision; they motivate teams and hold them accountab "},{"source":{"id":"","name":"Entrepreneur"},"author":"Jeff Walker","title":"How to Get the Most Out of Every Opportunity","description":"Opportunities may be everywhere but delivering value from them is the real measure of success.","publishedAt":"2022-11-01T14:36:00Z","content":"Identifying opportunity is at the core of what every entrepreneur does.\r\nThat's where my co-founders and I at Stellwagen Ventures found ourselves just over two years ago, looking for the white space  "},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Mike Chiari","title":"NHL Announces World Cup of Hockey Won't Be Played in 2024; Aiming for 2025","description":"The NHL and NHL Players Association announced Friday that the","publishedAt":"2022-11-11T19:50:43Z","content":"Bruce Bennett/Getty Images\r\nThe NHL and NHL Players' Association announced Friday that the next World Cup of Hockey will not be held in February 2024 as originally planned.\r\nIn a statement, the NHL a "},{"source":{"id":"nhl-news","name":"NHL News"},"author":"Heather Engel","title":"Thompson has hat trick, six points in Sabres win against Red Wings - NHL.com","description":"olliThompson has hat trick, six points in Sabres win against Red WingsNHL.com\r\n/liliGOTTA SEE IT: Tage Thompson Caps Off Six-Point Night With Nasty Hat Trick GoalSPORTSNET\r\n/liliRed Wings blasted by Buffalo Sabres, 8-3, on HalloweenDetroit F","publishedAt":"2022-11-01T04:38:43Z","content":"BUFFALO -- Tage Thompson had a hat trick and three assists, and the Buffalo Sabres defeated the Detroit Red Wings 8-3 at KeyBank Center on Monday.\"I think obviously getting the win's always a good fe "},{"source":{"id":"","name":"The Guardian"},"author":"Associated Press","title":"Evander Kane hospitalized with scary injury after being cut by skate blade","description":"ulliOilers forward has wrist cut by opponents skate/liliEdmonton say player is expected to be OK after accident/li/ulEdmonton forward Evander Kane was cut on the left wrist by a skate blade Tuesday night and taken to the hospital with a frighteni","publishedAt":"2022-11-09T13:15:56Z","content":"Edmonton forward Evander Kane was cut on the left wrist by a skate blade Tuesday night and taken to the hospital with a frightening injury during the Oilers 3-2 win over the Tampa Bay Lightning.\r\nThe "},{"source":{"id":"","name":"HYPEBEAST"},"author":"infohypebeast.com (HYPEBEAST), HYPEBEAST","title":"Disney Teams up With Adidas to Release Original 'Mighty Ducks' Jerseys From the 1992 Film","description":"Disney and adidas are tugging at nostalgic heartstrings with the release of a special capsule collection to celebrate the 30th anniversary of childhood favorite hockey classic, The Mighty Ducks. With adidas as the official NHL, Disney has teamed up with the s","publishedAt":"2022-11-02T03:37:02Z","content":"Disney and adidas\r\n are tugging at nostalgic heartstrings with the release of a special capsule collection to celebrate the 30th anniversary of childhood favorite hockey classic, The Mighty Ducks. Wi "},{"source":{"id":"nhl-news","name":"NHL News"},"author":"Kevin Woodley","title":"Martin, Canucks defeat Penguins to win second in row - NHL.com","description":"olliMartin, Canucks defeat Penguins to win second in rowNHL.com\r\n/liliCanucks follow first win of the season by thrashing Penguins at homeSportsnet.ca\r\n/liliCanucks drink free: Vancouver strip club keeps its promise  OffsideDaily Hive\r\n/","publishedAt":"2022-10-29T05:03:04Z","content":"VANCOUVER --Bo Horvat scored twice, and the Vancouver Canucks defeated the Pittsburgh Penguins 5-1 at Rogers Arena on Friday.Andrei Kuzmenko had a goal and an assist, Ilya Mikheyev had two assists, a "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Olivier Neven","title":"Canadiens' Carey Price reveals recent struggles with alcoholism - Yahoo Canada Sports","description":"olliCanadiens' Carey Price reveals recent struggles with alcoholismYahoo Canada Sports\r\n/liliCanadiens Carey Price unsettled by reality playing career is likely overSportsnet.ca\r\n/liliCarey Price not planning NHL retirement but 'unable to tra","publishedAt":"2022-10-25T15:23:14Z","content":"Montreal Canadiens superstar goaltender Carey Price has finally shed some light on the issues that led him to seek help and step away from hockey last season.\r\nIn an interview with The Athletic's Arp "},{"source":{"id":"","name":"ESPN"},"author":"ESPN staff","title":"From Tiger Woods to Tony Hawk: Athletes take on Halloween","description":"Whether it be braving haunted houses, ghost hunting or getting into character, the sports world went all out for Halloween.","publishedAt":"2022-10-31T20:35:09Z","content":"The culmination of spooky season is upon us. On Monday, teams, athletes, mascots and at least one celebrity fan got into the Halloween spirit.\r\nConnor McDavid channeled Tony Montana. A'ja Wilson ran  "},{"source":{"id":"","name":"Digital Trends"},"author":"Blair Marnell","title":"Peacock reveals Friday the 13th prequel series, Crystal Lake","description":"American Gods' Bryan Fuller is revisiting the history of Friday the 13th with Crystal Lake, a new prequel series on Peacock.","publishedAt":"2022-10-31T21:54:37Z","content":"Its been over a decade since the last attempt to reboot Friday the 13th, but the famous horror franchise has now found another life on Peacock. The streaming service has announced that A24 is produc "},{"source":{"id":"","name":"The Guardian"},"author":"Vanessa Thorpe Arts and media correspondent","title":"Pogues hard-living former frontman finds success as an artist","description":"Shane MacGowan has no studio and draws on sick bags with his wifes lipstick, but Kate Moss has bought his artShane MacGowan is bemused and amazed by the positive response to his first London show. I was just blown away by the whole thing, he told the Obs","publishedAt":"2022-10-23T09:00:34Z","content":"Shane MacGowan is bemused and amazed by the positive response to his first London show. I was just blown away by the whole thing, he told the Observer.\r\nHis name is a byword for hard living, but this "},{"source":{"id":"","name":"The Guardian"},"author":"Leyland Cecco in Toronto","title":"An obscure clause in Canadas charter sparks furious debates over rights","description":"The notwithstanding clause can be invoked to pass controversial laws that override the rights of citizensAt the height of a bitter pay dispute with Ontario education workers earlier this month, the provincial premier, Doug Ford, passed a law that barred emplo","publishedAt":"2022-11-20T12:00:26Z","content":"At the height of a bitter pay dispute with Ontario education workers earlier this month, the provincial premier, Doug Ford, passed a law that barred employees from striking and imposed a multi-year c "},{"source":{"id":"cbc-news","name":"CBC News"},"author":"Shane Ross","title":"Police and Hockey P.E.I. investigating brawl at Charlottetown youth tournament","description":"For the second year in a row, an incident at a Charlottetown youth hockey tournament is drawing negative attention  and leaving frustratedHockey P.E.I. officialsquestioning how theycan change the culture of the sport.","publishedAt":"2022-11-21T21:19:51Z","content":"For the second year in a row, an incident at a Charlottetown youth hockey tournament is drawing negative attention and leaving frustratedHockey P.E.I. officialsquestioning how theycan change the c "},{"source":{"id":"","name":"The Guardian"},"author":"Andy Bull","title":"Worlds Rugbys self-reinforcement on concussion is a problem for the sport  Andy Bull","description":"The latest conference, dominated by sceptics of recent research, will do nothing to bring clarity to the CTE debateAnother week, another conference. This one was organised by World Rugby and, like the last, which was organised by the Concussion in Sport Group","publishedAt":"2022-11-02T16:14:26Z","content":"Another week, another conference. This one was organised by World Rugby and, like the last, which was organised by the Concussion in Sport Group, it was held in Amsterdam. World Rugbys chief medical  "},{"source":{"id":"","name":"The Guardian"},"author":"Ignacio Palacios-Huerta","title":"Next Generation 2022: Why scouts select players based on the relative age effect","description":"If you want a child to make this list, you better make sure he is born as soon as possible after 1 SeptemberLast month the Guardian released Next Generation 2022: 20 of the best talents at Premier League clubs. As with previous years it selected the best you","publishedAt":"2022-10-24T07:00:01Z","content":"Last month the Guardian released Next Generation 2022: 20 of the best talents at Premier League clubs. As with previous years it selected the best youngsters at each club, this time among those born  "},{"source":{"id":"","name":"The Guardian"},"author":"Emma Kemp in Doha","title":"The most popular member of Socceroos squad The barista fuelling Australian World Cup hopes  Emma Kemp","description":"Inspired by Olympic success, Football Australia has flown Alexia Ralevski into Qatar from Sydney with a specific caffeine-related briefulliWorld Cup 2022: how to watch the Socceroos games in Qatar/li/ulTheres a lot of talk about one-percenters in foo","publishedAt":"2022-11-21T04:28:06Z","content":"Theres a lot of talk about one-percenters in football, those tiny extra tasks which, if performed consistently over a period of time, lead to improved outcomes. Sipping coffee may not exactly classif "},{"source":{"id":"","name":"The Guardian"},"author":"Associated Press","title":"Bruins rescind contract offer to Miller after backlash to racist bullying claims","description":"ulliPlayer bullied Black classmate with developmental disabilities/liliBruins players and fans did not want Mitchell Miller on team/li/ulThe Boston Bruins decided on Sunday to rescind their contract offer to prospect Mitchell Miller, who had his d","publishedAt":"2022-11-07T17:15:42Z","content":"The Boston Bruins decided on Sunday to rescind their contract offer to prospect Mitchell Miller, who had his draft rights relinquished by Arizona for bullying a Black classmate with developmental dis "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"slininsider.com (Sarah Belle Lin )","title":"From Apple AirPods and Squishmallows to 'Encanto' toys, here are some of the most anticipated gifts this holiday season, according to Adobe","description":"Adobe forecasts shoppers will spend 2.5 more this year than the 2021 holiday shopping season, with sales driven by anticipated record-high discounts.","publishedAt":"2022-10-27T16:45:14Z","content":"Online holiday sales in the US are expected to hit more than 209 billion this year, according to Adobe's 2022 holiday season online shopping forecast.\r\nThe forecast anticipates shoppers will spend 2 "},{"source":{"id":"","name":"Sports Illustrated"},"author":"Madeline Coleman","title":"Classmate Bullied By Mitchell Miller Releases Statement","description":"Boston rescinded its contract offer to the 20-year-old after receiving significant backlash.","publishedAt":"2022-11-09T19:02:53Z","content":"TheBruinsrocked the hockey world on Friday when they announced the signing of Mitchell Miller, who was initially drafted by the Coyotes in 2020 but was renounced days later afterit came to light t "},{"source":{"id":"","name":"Adweek"},"author":"David Cohen","title":"NHL Reveals 4th Class of NHL Power Players","description":"The National Hockey League introduced its fourth class of NHL Power Players Monday, made up of 27 advisors in Canada and the U.S. aged 13 through 17 tasked with advising the league on hockey-related topics important to their generation and growing the game am","publishedAt":"2022-11-07T23:05:00Z","content":"The National Hockey League introduced its fourth class of NHL Power Players Monday, made up of 27 advisors in Canada and the U.S. aged 13 through 17 tasked with advising the league on hockey-related  "},{"source":{"id":"","name":"GameSpot"},"author":"Jenny Zheng","title":"Get NHL 23 PS5 And Xbox Series X Editions For 40 Today At Best Buy","description":"NHL 23 was released in October 2022, but all PlayStation and Xbox editions are discounted at Best Buy right now for Black Friday.NHL 23 PS5 and Xbox Series XS editions are 40, a 30 reduction from the original 70 prices. NHL 23 PS4 and Xbox One editions ar","publishedAt":"2022-11-18T20:02:00Z","content":"NHL 23 was released in October 2022, but all PlayStation and Xbox editions are discounted at Best Buy right now for Black Friday.\r\nNHL 23 PS5 and Xbox Series XS editions are 40, a 30 reduction fro "},{"source":{"id":"","name":"HYPEBEAST"},"author":"infohypebeast.com (HYPEBEAST), HYPEBEAST","title":"Everything Dropping at Palace This Week","description":"Hot off the heels of its fourth Winter release, Palace is preparing to launch the Week 5 drop of its Winter 2022 collection. The fifth seasonal delivery features a variety of winter-ready essentials that will have you decked out for the incoming crisp weather","publishedAt":"2022-10-31T13:22:39Z","content":"Hot off the heels of its fourth Winter release, Palace is preparing to launch the Week 5 drop of its Winter 2022 collection. \r\nThe fifth seasonal delivery features a variety of winter-ready essential "},{"source":{"id":"","name":"HYPEBEAST"},"author":"infohypebeast.com (HYPEBEAST)","title":"Saucony Originals Reissues its 2007 ProGrid Triumph 4","description":"Under the moniker \"Retro Performance, Future Energy,\" the Saucony ProGrid Triumph 4 makes its return from the 2007 running catalog in \"OG Yellow Chrome,\" \"Black,\" and \"White/Silver\" this Fall/Winter 2022 season. Offering a smooth crossover between performance","publishedAt":"2022-11-19T04:08:44Z","content":"Under the moniker Retro Performance, Future Energy, the Saucony ProGrid Triumph 4 makes its return from the 2007 running catalog in OG Yellow Chrome, Black, and White/Silver this Fall/Winter  "},{"source":{"id":"bloomberg","name":"Bloomberg"},"author":"Bloomberg","title":"Olympic Star Angela Ruggiero Is Always Looking Ahead","description":"Olympic gold medalist and hockey star Angela Ruggiero realized that most of the traditional career options for retiring athletes didn't appeal to her so she forged her own path and created a company, Sports Innovation Lab. Even now, she's thinking about what ","publishedAt":"2022-10-28T13:15:07Z","content":"Beginning of dialog window. Escape will cancel and close the window.\r\nText\r\nColor\r\nWhite\r\nBlack\r\nRed\r\nGreen\r\nBlue\r\nYellow\r\nMagenta\r\nCyanTransparency\r\nOpaque\r\nSemi-Transparent\r\nBackground\r\nColor\r\nBlac "},{"source":{"id":"","name":"The Guardian"},"author":"Harriet Gibsone","title":"Tom Felton looks back: I had a nice car, a house in LA. Youre told they make you happy  they dont","description":"The Harry Potter star recreates an old photo and recalls the cocky audition that changed his lifeBorn in Surrey in 1987, actor Tom Felton is best known for his role as peroxide-blond baddie Draco Malfoy in the Harry Potter films. Before scoring his major ro","publishedAt":"2022-11-19T12:00:56Z","content":"Tom Felton in 1995 and in 2022, recreating the older photo of him reading a book called The Art Of Getting Even\r\nTom Felton in 1995 and 2022. Later photograph: Pl Hansen/The Guardian. Styling: Andie "},{"source":{"id":"","name":"Suntimes.com"},"author":"David Struett, Allison Novelo","title":"16 St. Ignatius College Prep students injured after truck crashes into hockey team bus in Indiana: police - Chicago Sun-Times","description":"olli16 St. Ignatius College Prep students injured after truck crashes into hockey team bus in Indiana: policeChicago Sun-Times\r\n/liliAt least 16 high school hockey players were injured after an allegedly intoxicated semi-truck driver crashed into th","publishedAt":"2022-11-13T15:56:00Z","content":"Sixteen students from St. Ignatius College Prep were injured when a tractor-trailer rig crashed into their bus Saturday evening in Indiana.\r\nThe speeding and swerving semi struck the bus around 8 p.m "},{"source":{"id":"","name":"NBC Chicago"},"author":"","title":"At Least 16 Hurt, 3 Critically, After Semi Slams Into Chicago High School Hockey Team's Bus - NBC Chicago","description":"olliAt Least 16 Hurt, 3 Critically, After Semi Slams Into Chicago High School Hockey Team's BusNBC Chicago\r\n/liliAt least 16 high school hockey players were injured after an allegedly intoxicated semi-truck driver crashed into their team busCNN\r\n","publishedAt":"2022-11-13T22:20:22Z","content":"More than one dozen people were injured, three critically, after a semi slammed into a school bus carrying a Chicago high school hockey team on Saturday night in northern Indiana.\r\nAuthorities say th "},{"source":{"id":"","name":"GameSpot"},"author":"David Wolinsky","title":"Arrested Development Stars Reunite In Upcoming Netflix Murderville Holiday Special","description":"Murderville is returning to Netflix for the holidays. On December 15, a new episode of the improvised whodunit will hit the streaming service.Even better, the imaginative procedural crime show this time out will feature a reunion of Arrested Development stars","publishedAt":"2022-11-18T19:42:00Z","content":"Murderville is returning to Netflix for the holidays. On December 15, a new episode of the improvised whodunit will hit the streaming service.\r\nEven better, the imaginative procedural crime show this "},{"source":{"id":"","name":"Forbes"},"author":"Brian Roberts, Contributor, \n Brian Roberts, Contributor\n ","title":"Meet The North Philly Native Breaking Ice Hockey Barriers","description":"Hockey's most expensive problem is getting started. Sean Grevy, a native of North Philly, is trying to change that for youth nationwide.","publishedAt":"2022-11-04T15:05:13Z","content":"Pictured: Sean Grevy, founder of the 43 Oak Foundation (left), with members of his ice hockey ... [] program.\r\n43 Oak Foundation\r\nSean Grevy, a native of North Philadelphia who grew up in a low-inco "},{"source":{"id":"","name":"Visual.ly"},"author":"Repyourcolours","title":"Buy Hockey Garment Bags Online","description":"Looking for hockey garment bags online in Canada Keep all your ice hockey equipment organized in a hockey bag (garment bags online) from top brands i","publishedAt":"2022-11-14T04:38:27Z","content":"Buy Hockey Garment Bags Online Looking for hockey garment bags online in Canada  Keep all your ice hockey equipment organized in a hockey bag ( garment bags online ) from top brands in our shop . 00 "},{"source":{"id":"","name":"The Indian Express"},"author":"PTI","title":"Hockey: We need to switch on from start to finish, says Graham Reid","description":"The New Zealand team, on the other hand, is hoping to record its first win of the season after two consecutive losses.","publishedAt":"2022-11-03T17:00:15Z","content":"Indian mens hockey coach Graham Reid wants his team to cut down defensive lapses and at the same time attack more when it faces New Zealand in the second leg of the FIH Pro League .India began their "},{"source":{"id":"","name":"HYPEBEAST"},"author":"infohypebeast.com (HYPEBEAST), HYPEBEAST","title":"Everything Dropping at HBX Archives This Week","description":"Following last weeks slew of collaborative sneakers from Nike, HBX Archives is back with another wide selection of casual street-style apparel and footwear pieces for week 94. Launched in 2016,HBXArchives has become a go-to place for sourcing unique pieces","publishedAt":"2022-11-04T10:33:54Z","content":"Following last weeks slew of collaborative sneakers from Nike\r\n, HBX Archives is back with another wide selection of casual street-style apparel and footwear pieces for week 94. Launched in 2016,HBX "},{"source":{"id":"","name":"Detroithockeynow.com"},"author":"Bob Duff","title":"Red Wings Chiarot Is All Business On Ice - Detroit Hockey Now","description":"Red Wings Chiarot Is All Business On IceDetroit Hockey Now","publishedAt":"2022-10-25T08:11:43Z","content":"sWatching Detroit Red Wings defenseman Ben Chiarot as he was annahilating Anaheim Ducks players in Sundays 5-1 victory, it might not come as a surprise that his first sporting love was football.\r\nH "},{"source":{"id":"","name":"Browneyedbaker.com"},"author":"Michelle","title":"Friday Things 463","description":"Friday Things 463\n1. It was an exciting week for the kids On Tuesday night, the Pittsburgh Penguins held their Hockey Fights Cancer night and Dominic was invited to ride the zamboni after pre-game warmups. It was such a fun experience for him, and he, Josep","publishedAt":"2022-11-18T05:01:00Z","content":"1. It was an exciting week for the kids On Tuesday night, the Pittsburgh Penguins held their Hockey Fights Cancer night and Dominic was invited to ride the zamboni after pre-game warmups. It was suc "},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Joe Yerdon","title":"10 Best Power Plays in the NHL Right Now","description":"There is no better way to turn the tide of a game in the NHL than by cashing in on the power play. Having more players on the ice than the other team can be a...","publishedAt":"2022-11-12T13:15:20Z","content":"Jari Pestelacci/Eurasia Sport Images/Getty Images\r\nThe Colorado Avalanche, as of this writing, have the highest power-play percentage in the NHL at 40.5. That number again: 40.5.\r\nColorado has only h "},{"source":{"id":"","name":"Forbes"},"author":"A.J. Herrington, Contributor, \n A.J. Herrington, Contributor\n ","title":"Chicago Wolves Ink Sponsorship Deal With Marijuana Firm Verilife","description":"Illinois-based licensed cannabis brand Verilife announced on Wednesday that the company has signed a groundbreaking sponsorship deal with the Chicago Wolves, the American Hockey Leagues championship team for 2022.","publishedAt":"2022-11-17T19:40:20Z","content":"Illinois-based licensed cannabis brand Verilife announced on Wednesday that the company has signed a groundbreaking sponsorship deal with the Chicago Wolves, the American Hockey Leagues championship  "},{"source":{"id":"","name":"ESPN"},"author":"Tim Kurkjian","title":"Kurkjian: Bring on the World Series Why we're so excited for the final round","description":"A new round, new stars and the best day in baseball history -- ahead of the World Series, here's what we've already seen from the MLB postseason.","publishedAt":"2022-10-28T14:52:19Z","content":"After almost a week without baseball, the World Series starts today With all its storylines -- the Houston Astros' attempt to win a clean title, the Philadelphia Phillies' hot streak continuing -- i "},{"source":{"id":"","name":"Howsweeteats.com"},"author":"Jessica","title":"A Week In The Life, Vol 46.","description":"We had such a good week I cant even handle how much Emilia loves her big brother. I was taking their holiday photos and trying to find a good spot. Funny faces to find the spot Prettiest bday flowers. Standing in line to vote I went at 7:30 and had a pr","publishedAt":"2022-11-14T00:23:11Z","content":"We had such a good week\r\nI cant even handle how much Emilia loves her big brother.\r\nI was taking their holiday photos and trying to find a good spot. Funny faces to find the spot\r\nPrettiest bday  "},{"source":{"id":"cbc-news","name":"CBC News"},"author":"Julia Peterson","title":"Humboldt Broncos' families show enduring solidarity with James Smith Cree Nation","description":"During Sunday's hockey game against the Flin Flon Bombers, spectators wore 'James Smith Cree Nation Strong' T-shirts to show their ongoing support following the mass stabbings in September.","publishedAt":"2022-11-22T17:17:48Z","content":"In every corner of Elgar Petersen arena, there are tributes to the victims of the 2018 Humboldt Broncos bus crash.\r\nTwo memorial benches greet visitors on their way into the venue: one made of hockey "},{"source":{"id":"cnn","name":"CNN"},"author":"Wayne Sterling","title":"Actor Ryan Reynolds interested in buying NHL's Ottawa Senators","description":"Canadian actor Ryan Reynolds is interested in buying the Ottawa Senators of the National Hockey League (NHL).","publishedAt":"2022-11-08T17:33:52Z","content":"Canadian actor Ryan Reynolds is interested in buying the Ottawa Senators of the National Hockey League (NHL).\r\nI am trying to (buy the Senators), Reynolds told Jimmy Fallon on The Tonight Show. Its v "},{"source":{"id":"","name":"Howsweeteats.com"},"author":"Jessica","title":"A Week In The Life, Vol 47.","description":"Cant believe were headed into Thanksgiving week How adorable are these two little buddies Quick little park before we got snow. Look at those flakes Mixing up the seasons. Max got the hardest worker award at hockey Still loving all the crafts. And she","publishedAt":"2022-11-21T01:24:41Z","content":"Cant believe were headed into Thanksgiving week\r\nHow adorable are these two little buddies\r\nQuick little park before we got snow.\r\nLook at those flakes\r\nMixing up the seasons.\r\nMax got the hard "},{"source":{"id":"","name":"iMore"},"author":"olivermonkeymanmedia.com (Oliver Haslam)","title":"Roku adds a 'Sports' tab as Apple continues its push into live game streaming","description":"Roku has announced a new 'Sports' tab that could include content from the likes of Apple.","publishedAt":"2022-11-11T17:53:23Z","content":"Roku has announced that it is rolling out a new way for people to more quickly and easily watch sporting content, with a new 'Sports' tab being added to the interface of its devices.\r\nThe new 'Sports "},{"source":{"id":"","name":"/FILM"},"author":"Ryan Scott","title":"When Are They Going To Make Another Friday The 13th Movie","description":"The horror world got some downright shocking news recently when it was revealed that the \"Friday the 13th\" franchise is finally coming back after well over a decade away. Bryan Fuller, of \"Hannibal\" fame, is developing a series for Peacock titled \"Crystal Lak","publishedAt":"2022-11-01T17:00:27Z","content":"The horror world got some downright shocking news recently when it was revealed that the \"Friday the 13th\" franchise is finally coming back after well over a decade away. Bryan Fuller, of \"Hannibal\"  "},{"source":{"id":"","name":"VentureBeat"},"author":"Dean Takahashi","title":"How Bayardo De Murguias role in Modern Warfare II gave him pride about Mexico","description":"Voice actor Bayardo De Murguia was proud to play a Mexican Special Forces soldier in Call of Duty: Modern Warfare II.","publishedAt":"2022-11-11T14:30:00Z","content":"Did you miss a session from GamesBeat Summit Next 2022 All sessions are now available for viewing in our on-demand library. Click here to start watching.\r\nMexico could definitely use some assistance "},{"source":{"id":"","name":"The Athletic"},"author":"The Athletic Staff, Fluto Shinzawa, Peter Baugh","title":"Bruins sign controversial defenseman Mitchell Miller; Gary Bettman casts doubt on NHL eligibility - The Athletic","description":"olliBruins sign controversial defenseman Mitchell Miller; Gary Bettman casts doubt on NHL eligibilityThe Athletic\r\n/liliBruins sign player convicted of assaulting black, disabled high school classmateNew York Post \r\n/liliOpinion: Hockey Hasn't","publishedAt":"2022-11-05T11:43:20Z","content":"The Boston Bruins signed defenseman Mitchell Miller to an entry-level contract, the team announced Friday. Miller was selected by the Arizona Coyotes in the fourth round of the 2020 NHL Draft, but ha "},{"source":{"id":"","name":"YouTube"},"author":"","title":"16 injured in school bus crash; semi truck driver arrested - CBS Chicago","description":"olli16 injured in school bus crash; semi truck driver arrestedCBS Chicago\r\n/liliAt least 16 high school hockey players were injured after an allegedly intoxicated semi-truck driver crashed into their team busCNN\r\n/lili16 injured after semi col","urlToImage":"","publishedAt":"2022-11-14T00:39:26Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":"bleacher-report","name":"Bleacher Report"},"author":"Adam Gretz","title":"Way Too Early 2022-23 NHL All-Star Picks","description":"Even the NHL All-Star game is still a little more than two months away we are closing in on the first quarter mark of the 2022-23 season. So let's take a look...","publishedAt":"2022-11-20T18:41:53Z","content":"Richard A. Whittaker/Icon Sportswire via Getty Images\r\nRasmus Dahlin, Buffalo Sabres\r\nThe Sabres' run of non-playoff seasons might continue on for another year, but there are still a lot of promising "}]}