{"totalResults":104425,"articles":[{"source":{"id":"wired","name":"Wired"},"author":"Gian M. Volpicelli","title":"The Great Crypto-Cop Brain Drain","description":"Hunting down crypto criminals is a dying art as law enforcement officers jump in-house.","publishedAt":"2022-11-09T12:00:00Z","content":"In the course of a decade as a special agent with the US Internal Revenue Service (IRS), Tigran Gambaryan has seen them all.\r\nFrom plundered crypto exchange Mt Gox, to dark-net marketplace Silk Road "},{"source":{"id":"wired","name":"Wired"},"author":"Matt Laslo","title":"The Quiet Insurrection the January 6 Committee Missed","description":"A former congressman who helped the House select committee investigate the Capitol attack says the US is losing sight of the big picture.","publishedAt":"2022-10-23T11:00:00Z","content":"Thousands of documents are great, but millions of lines of data are better. And so when you look at call detail records or open source intelligence research or you look at social media, those types o "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Rob Bricken","title":"A Guide to House of the Dragons Many, Many Dragons","description":"The final shot of House of the Dragons season finale made it abundantly clear: This is war. Queen Rhaenyras Blacks will battle the usurping King Aegon IIs Greens, but as Prince Daemon Targaryen pointed out, the Blacks have the advantage because they have m","publishedAt":"2022-10-28T15:45:00Z","content":"Dragonstone has 13 to their four, Daemon says to Queen Rhaenyra in the season finale, referring to the draconic might of their Blacks to the Greens. He also specifies the Greens only have three adult "},{"source":{"id":"","name":"Gizmodo.com"},"author":"George Dvorsky","title":"White House Warns Russia Against Shooting Down U.S. Satellites","description":"The National Security Council is having to respond to comments made earlier this week by a senior Russian foreign ministry official who warned that commercial satellites operated by the U.S. and its allies, if used to support the Ukrainian war effort, could b","publishedAt":"2022-10-28T17:35:00Z","content":"The National Security Council is having to respond to comments made earlier this week by a senior Russian foreign ministry official who warned that commercial satellites operated by the U.S. and its  "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Mack DeGeurin","title":"House Committees Slam ID.me for 'Baseless' Unemployment Fraud Claims","description":"ID.me, the controversial biometric identification verification company whose facial match technology provoked a major privacy backlash at the IRS earlier this year, may have misled the public and lawmakers when its CEO claimed the U.S. lost 400 billion to fr","publishedAt":"2022-11-17T16:15:00Z","content":"ID.me, the controversial biometric identification verification company whose facial match technology provoked a major privacy backlash at the IRS earlier this year, may have misled the public and law "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Charles Pulliam-Moore","title":"In its finale, House of the Dragon became a worthy Game of Thrones successor","description":"House of the Dragons season 1 finale, The Black Queen, felt like everything that was great about Game of Thrones and set up a new war that will shape season 2.","publishedAt":"2022-10-25T14:30:00Z","content":"Emma DArcy as Queen Rhaenyra Targaryen.  Image: HBO\r\n\n \n\n\n House of the Dragons season 1 finale pulled the series together by becoming what Game of Thrones was at its best In its earliest episodes "},{"source":{"id":"","name":"Lifehacker.com"},"author":"Daniel Oropeza","title":"Don't Eat These Recalled Nestle Cookies, FDA Says","description":"Last month, Nestle had a different cookie dough recall for their Toll House Stuffed Chocolate Chip Cookie Dough with Fudge Filling. This time, its the Edible Chocolate Chip Cookie Dough tubs that are being recalled for concerns of having a soft plastic film ","publishedAt":"2022-11-07T15:00:00Z","content":"Last month, Nestle had a different cookie dough recall for their Toll House Stuffed Chocolate Chip Cookie Dough with Fudge Filling. This time, its the Edible Chocolate Chip Cookie Dough tubs that are "},{"source":{"id":"","name":"Lifehacker.com"},"author":"Jake Peterson","title":"How to Spy on Your Own Phone (and Why You Might Want to)","description":"Do you have a sneaking suspicion your partner is spying on your phone Its a big accusation, and confronting them without evidence is walking a risky path. If you find yourself in a situation where you think your partner (or someone else in the house) is loo","publishedAt":"2022-11-17T18:00:00Z","content":"Do you have a sneaking suspicion your partner is spying on your phone Its a big accusation, and confronting them without evidence is walking a risky path. If you find yourself in a situation where y "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Emma Roth","title":"Heres why Elizabeth Holmes thinks she shouldnt go to prison","description":"Elizabeth Holmes faces up to 20 years in prison, but she and her lawyers argue she deserves just 18 months of house arrest in an 82-page sentencing memorandum.","publishedAt":"2022-11-14T15:13:06Z","content":"Heres why Elizabeth Holmes thinks she shouldnt go to prison\r\nHeres why Elizabeth Holmes thinks she shouldnt go to prison\r\n / Prosecutors want to lock Elizabeth Holmes up for 15 years, but Holmes and  "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Andrew J. Hawkins","title":"Ford thinks driver assist is a safer bet than driverless cars, but its fooling itself","description":"Ford said it would stop funding driverless startup Argo AI in favor of developing Level 2 and Level 3 driver-assist technology in-house. But that might actually be a riskier  and more dangerous  pursuit.","publishedAt":"2022-10-27T15:54:00Z","content":"Ford thinks driver assist is a safer bet than driverless cars, but its fooling itself\r\nFord thinks driver assist is a safer bet than driverless cars, but its fooling itself\r\n / The automaker pulled s "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Jay Peters","title":"Netflix is acquiring cozy game developer Spry Fox","description":"Netflix is acquiring Spry Fox, the indie developer of games like Cozy Grove and Alphabear. The acquisition means that Spry Fox will become Netflixs sixth in-house gaming studio.","publishedAt":"2022-10-31T20:52:24Z","content":"Netflix is acquiring cozy game developer Spry Fox\r\nNetflix is acquiring cozy game developer Spry Fox\r\n / Netflix is making another investment in gaming with the acquisition of Spry Fox, known for gam "},{"source":{"id":"","name":"Lifehacker.com"},"author":"Jeff Somers","title":"10 Lazy, Last-Minute Costumes You Can Throw Together Before Halloween","description":"The keys to an inoffensive last-minute Halloween costume are straightforward: People need to be able to tell what you are, and it has to be something you can pull together quickly using whats already lying around the house. Googling last minute DIY costume","publishedAt":"2022-10-27T19:30:00Z","content":"What you need: A suit, a red necktie, an ax, a rain poncho, fake blood\r\nIf Risky Business is too dated for you or you just dont feel comfortable leaving the house dressed as Tom Cruise\r\n not wearing  "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"US midterms: Republicans narrowly win back the House","description":"Republicans secure 218 seats to control the House, though a dozen races are still to be called.","publishedAt":"2022-11-16T23:42:23Z","content":"Republicans have secured the 218 seats needed to win a majority in the lower chamber of the US Congress, the BBC's US partner CBS News projects.\r\nThe party's majority in the House of Representatives  "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Nancy Pelosi stands down as leader of US House Democrats","description":"The 82-year-old has led the party in the lower chamber of Congress for almost two decades.","publishedAt":"2022-11-17T17:46:22Z","content":"Nancy Pelosi, who has led Democrats in the US House of Representatives for almost two decades, has announced she is standing down from the role.\r\nThe 82-year-old is the most powerful Democrat in Cong "},{"source":{"id":"cnn","name":"CNN"},"author":"Melanie Zanona, Alex Rogers","title":"Kevin McCarthy poised to lead House GOP despite far-right revolt","description":"House Minority Leader Kevin McCarthy is hoping to pass a crucial test on Tuesday in his campaign to become House speaker despite an underwhelming midterm election performance that launched a search among conservatives for a challenger.","publishedAt":"2022-11-15T11:00:09Z","content":"House Minority Leader Kevin McCarthy is hoping to pass a crucial test on Tuesday in his campaign to become House speaker despite an underwhelming midterm election performance that launched a search a "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Trump drops strong hint about 2024 White House run","description":"The former president tells a crowd in Sioux City, Iowa, he will \"very, very, very probably do it again\" in 2024.","publishedAt":"2022-11-04T03:05:39Z","content":"US President Donald Trump has dropped one of his strongest hints yet that he may run for the White House again.\r\nHe told a crowd in Sioux City, Iowa, that he will \"very, very, very probably do it aga "},{"source":{"id":"cnn","name":"CNN"},"author":"Julian Zelizer","title":"Opinion: Three roadblocks Biden will face with the House under GOP control","description":"Julian Zelizer writes Julian Zelizer writes that even though there wasn't a red wave, even a ripple in the House of Representatives is extremely consequential. With Republicans in control of the House, the Biden administration will likely encounter a combinat","publishedAt":"2022-11-16T23:34:44Z","content":"Editors Note: Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, The Presidency of Dona "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"T. rex auction cancelled after skeleton doubts raised","description":"Christie's auction house says the seller has decided to loan it to a museum instead.","publishedAt":"2022-11-21T15:28:49Z","content":"A T. rex skeleton which was expected to fetch up to 25m (21m) at auction has been withdrawn after doubts were raised over where parts of it had come from.\r\nAuction house Christie's confirmed to the "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Kevin Hurler","title":"T. Rex Pulled From Auction After Skeleton Raised Questions","description":"Auction house Christies has pulled a Tyrannosaurus rex specimen from an upcoming roster after a paleontologist expressed concerns that some parts of the dinosaur might belong to another T. rex specimen.Read more...","publishedAt":"2022-11-21T20:05:00Z","content":"Auction house Christies has pulled a Tyrannosaurus rex specimen from an upcoming roster after a paleontologist expressed concerns that some parts of the dinosaur might belong to another T. rex specim "},{"source":{"id":"cnn","name":"CNN"},"author":"Jennifer Hansler, Sam Fossum","title":"US Embassy officials visit detained basketball star Brittney Griner in Russia","description":"Officials from the US Embassy in Moscow met with detained American Brittney Griner on Thursday, White House press secretary Karine Jean-Pierre said.","publishedAt":"2022-11-03T18:48:19Z","content":"Officials from the US Embassy in Moscow met with detained American Brittney Griner on Thursday, White House press secretary Karine Jean-Pierre said. \r\nWe are told shes doing as well as can be expecte "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"King Charles starts his day with sound of bagpipes for first time at London home","description":"As part of a centuries-old tradition, the King's piper plays a morning set for the first time at Clarence House.","publishedAt":"2022-10-26T09:39:09Z","content":"The dulcet tones of bagpipes may not be everyone's idea of a perfect awakening, but for King Charles it is part of a centuries-old morning ritual.\r\nEvery day at 09:00 a lone piper plays a selection o "},{"source":{"id":"cnn","name":"CNN"},"author":"Kylie Atwood, Jeremy Herb, Katie Bo Lillis, Melanie Zanona","title":"Inside the House GOP effort to keep weapons flowing to Ukraine","description":"After House Minority Leader Kevin McCarthy suggested last week that Republicans might pull back funding for Ukraine next year if they take the majority, the GOP leader has worked behind the scenes to reassure national security leaders in his conference that h","publishedAt":"2022-10-26T20:00:23Z","content":"After House Minority Leader Kevin McCarthy suggested last week that Republicans might pull back funding for Ukraine next year if they take the majority, the GOP leader has worked behind the scenes to "},{"source":{"id":"cnn","name":"CNN"},"author":"Jamie Gangel, Annie Grayer, Zachary Cohen, Sara Murray","title":"House January 6 committee provides new deadline for Trump to turn over subpoenaed documents","description":"The House select committee investigating the January 6, 2021, attack on the US Capitol, released a statement Friday outlining a new deadline for former President Donald Trump to turn over documents it subpoenaed.","publishedAt":"2022-11-05T00:17:03Z","content":"The House select committee investigating the January 6, 2021, attack on the US Capitol, released a statement Friday outlining a new deadline for former President Donald Trump to turn over documents i "},{"source":{"id":"cnn","name":"CNN"},"author":"Paul LeBlanc","title":"New York Times: Trump sought tax investigations of political foes","description":"Former President Donald Trump repeatedly told his onetime White House chief of staff, John Kelly, that he wanted the Internal Revenue Service to investigate his political foes, Kelly told The New York Times.","publishedAt":"2022-11-14T04:30:55Z","content":"Former President Donald Trump repeatedly told his onetime White House chief of staff, John Kelly, that he wanted the Internal Revenue Service to investigate his political foes, Kelly told The New Yor "},{"source":{"id":"cnn","name":"CNN"},"author":"Shawna Mizelle, Jeff Zeleny","title":"Cheney endorses Virginia Democratic Rep. Abigail Spanberger","description":"Wyoming Republican Rep. Liz Cheney endorsed Virginia Democratic Rep. Abigail Spanberger on Saturday, weighing in on another highly competitive House race in the final days of the midterm election campaign.","publishedAt":"2022-11-05T15:40:50Z","content":"Wyoming Republican Rep. Liz Cheney endorsed Virginia Democratic Rep. Abigail Spanberger on Saturday, weighing in on another highly competitive House race in the final days of the midterm election cam "},{"source":{"id":"cnn","name":"CNN"},"author":"Oscar Holland, CNN","title":"'Extremely rare' first-edition US Constitution could fetch 30 million","description":"An \"extremely rare\" first-edition copy of the US Constitution will go under the hammer in New York next month, with Sotheby's auction house expecting bids up to 30 million.","publishedAt":"2022-11-01T10:59:24Z","content":"luxuryPublished 1st November 2022\r\nAn \"extremely rare\" first-edition copy of the US Constitution will go under the hammer in New York next month, with Sotheby's auction house expecting bids up to 30 "},{"source":{"id":"cnn","name":"CNN"},"author":"Simone Pathe","title":"The 10 Senate seats most likely to flip in 2022","description":"The race for the House is tilting strongly toward the GOP, but the struggle for Senate control is still very much a slog that could go either way, even as late-breaking national winds favor the party out of power.","publishedAt":"2022-11-03T10:00:07Z","content":"The race for the House is tilting strongly toward the GOP, but the struggle for Senate control is still very much a slog that could go either way, even as late-breaking national winds favor the party "},{"source":{"id":"cnn","name":"CNN"},"author":"Sonnet Swire, Manu Raju","title":"Pelosi says children, grandchildren are 'heartbroken and traumatized' in first comments since attack","description":"House Speaker Nancy Pelosi says that while her husband, Paul, continues to improve following Friday's violent attack in their San Francisco home, their children and grandchildren \"are heartbroken and traumatized.\"","publishedAt":"2022-10-30T01:21:25Z","content":"House Speaker Nancy Pelosi says that while her husband, Paul, continues to improve following Fridays violent attack in their San Francisco home, their children and grandchildren are heartbroken and t "},{"source":{"id":"cnn","name":"CNN"},"author":"Liam Reilly, Samantha Beech, Zenebou Sylla","title":"Mother seeks further investigation into death of sons who died after firefighters failed to properly search burning home","description":"The mother of two boys who died following a house fire in Michigan earlier this year is pushing for an independent investigation after two firefighters were accused of lying about properly searching for survivors.","publishedAt":"2022-11-06T02:12:13Z","content":"The mother of two boys who died following a house fire in Michigan earlier this year is pushing for an independent investigation after two firefighters were accused of lying about properly searching  "},{"source":{"id":"cnn","name":"CNN"},"author":"Stephen Collinson","title":"Analysis: Takeaways from a grim weekend for Republicans in the election that won't end","description":"It was a disappointing weekend for Republicans and ex-President Donald Trump as Democrats kept the Senate for two more years after holding off a red wave in the House, which remains uncalled six days after the election.","publishedAt":"2022-11-14T06:15:51Z","content":"It was a disappointing weekend for Republicans and ex-President Donald Trump as Democrats kept the Senate for two more years after holding off a red wave in the House, which remains uncalled six days "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Linda Codega","title":"The Creators of ONI: Thunder God's Tale on Stop-Motion Inspiration and Overcoming Fear","description":"The new Netflix-produced animated show from Tonko House, ONI: Thunder Gods Tale, is a wonderful, four-episode story about found family, community, identity, and outsiders. On October 18, Sara Sampson, Robert Kondo, and Daisuke Dice Tsutsumi sat down with i","publishedAt":"2022-10-28T18:15:00Z","content":"The new Netflix-produced animated show from Tonko House, ONI: Thunder Gods Tale, is a wonderful, four-episode story about found family, community, identity, and outsiders. On October 18, Sara Sampson "},{"source":{"id":"","name":"NPR"},"author":"Deirdre Walsh","title":"McCarthy nominated speaker in internal GOP vote but he faces conservative resistance","description":"House Republicans have nominated Kevin McCarthy to serve as Speaker of the House in the next Congress. It's the first step on McCarthy's path to presiding over the House chamber.","publishedAt":"2022-11-15T19:52:39Z","content":"House Minority Leader Kevin McCarthy, of Calif., talks to reporters, Tuesday, Nov. 15, 2022, on Capitol Hill in Washington.\r\nJacquelyn Martin/AP\r\nHouse Minority Leader Kevin McCarthy was nominated by "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Democrat lawmaker Castor says Republicans want to nix climate committee - Reuters","description":"If Republicans take control of the U.S. House of Representatives they are likely to \"nix\" the House Select Committee on the Climate Crisis, the committee's chair Democratic Representative Kathy Castor said on Thursday at the COP27 climate summit.","publishedAt":"2022-11-10T11:53:00Z","content":"SHARM EL SHEIKH, Egypt, Nov 10 (Reuters) - If Republicans take control of the U.S. House of Representatives they are likely to \"nix\" the House Select Committee on the Climate Crisis, the committee's  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Republicans identify 42 Biden administration officials they want to testify - Reuters.com","description":"Republicans in the U.S. House of Representatives on Friday identified 42 employees from Democratic President Joe Biden's White House and administration, who they expect to testify next year after their party takes control of the chamber.","publishedAt":"2022-11-18T20:05:00Z","content":"WASHINGTON, Nov 18 (Reuters) - Republicans in the U.S. House of Representatives on Friday identified 42 employees from Democratic President Joe Biden's White House and administration, who they expect "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Top House Republican McCarthy threatens impeachment of Homeland Security chief - Reuters","description":"The top Republican in the U.S. House of Representatives, Kevin McCarthy, on Tuesday called on Homeland Security Secretary Alejandro Mayorkas to step down, warning that the House may try to impeach him when Republicans take the majority next year.","publishedAt":"2022-11-22T23:16:00Z","content":"WASHINGTON, Nov 22 (Reuters) - The top Republican in the U.S. House of Representatives, Kevin McCarthy, on Tuesday called on Homeland Security Secretary Alejandro Mayorkas to step down, warning that  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"White House not surprised by Russian comments on election interference - Reuters","description":"White House spokesperson Karine Jean-Pierre said on Monday the White house was not surprised by comments from a Russian businessman who said he had interfered in U.S. elections and would continue to do so.","publishedAt":"2022-11-07T19:37:00Z","content":"WASHINGTON, Nov 7 (Reuters) - White House spokesperson Karine Jean-Pierre said on Monday the White house was not surprised by comments from a Russian businessman who said he had interfered in U.S. el "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Pelosi to pass leadership torch as top U.S. House Democrat -news website Puck - Reuters","description":"U.S. House of Representatives Speaker Nancy Pelosi plans to pass the leadership torch for House Democrats and throw her support behind congressman Hakeem Jeffries, news website Puck reported on Thursday.","publishedAt":"2022-11-17T15:06:00Z","content":"WASHINGTON, Nov 17 (Reuters) - U.S. House of Representatives Speaker Nancy Pelosi plans to pass the leadership torch for House Democrats and throw her support behind congressman Hakeem Jeffries, news "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Biden congratulates Republicans on winning House majority - Reuters.com","description":"U.S. President Joe Biden, a Democrat, on Wednesday congratulated Republicans on their projected majority in the U.S. House of Representatives following last week's midterm elections, saying he would work with them to deliver for Americans.","publishedAt":"2022-11-17T00:01:00Z","content":"Nov 16 (Reuters) - U.S. President Joe Biden, a Democrat, on Wednesday congratulated Republicans on their projected majority in the U.S. House of Representatives following last week's midterm election "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"White House wedding for Biden granddaughter Naomi - Reuters","description":"Naomi Biden, the granddaughter of U.S. President Joe Biden and first lady Jill Biden, was set to be married on Saturday in what will be the 19th time in history the White House has been used for a wedding.","publishedAt":"2022-11-19T15:13:00Z","content":"WASHINGTON, Nov 19 (Reuters) - Naomi Biden, the granddaughter of U.S. President Joe Biden and first lady Jill Biden, was set to be married on Saturday in what will be the 19th time in history the Whi "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Hakeem Jeffries launches bid to lead U.S. House Democrats - Reuters.com","description":"U.S. lawmaker Hakeem Jeffries launched a bid on Friday to become Democratic leader in the House of Representatives, a day after the chamber's speaker, Nancy Pelosi, announced that she was stepping down from her party leadership role.","publishedAt":"2022-11-18T15:51:00Z","content":"WASHINGTON, Nov 18 (Reuters) - U.S. lawmaker Hakeem Jeffries launched a bid on Friday to become Democratic leader in the House of Representatives, a day after the chamber's speaker, Nancy Pelosi, ann "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Republicans' debt-ceiling plans are 'reckless' White House says - Reuters","description":"U.S. Republicans' plans to use the debt ceiling to pressure Congress to cut government spending are \"reckless,\" the White house said Tuesday, and could threaten the U.S. economy.","publishedAt":"2022-10-25T20:41:00Z","content":"WASHINGTON, Oct 25 (Reuters) - U.S. Republicans' plans to use the debt ceiling to pressure Congress to cut government spending are \"reckless,\" the White house said Tuesday, and could threaten the U.S "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S. House Republicans press TikTok on Chinese data sharing - Reuters","description":"Republican members of Congress, who will set the agenda for the House next year, pressed short video app TikTok on Tuesday over concerns the company may have misled Congress about how much user data it shares with China, where owner ByteDance is headquartered.","publishedAt":"2022-11-22T23:26:00Z","content":"WASHINGTON, Nov 22 (Reuters) - Republican members of Congress, who will set the agenda for the House next year, pressed short video app TikTok on Tuesday over concerns the company may have misled Con "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"White House still committed to tech antitrust bill - Reuters","description":"White House competition adviser Tim Wu said Thursday the Biden administration is still backing tech antitrust legislation that is before Congress as time runs short before lawmakers end work for the year.","publishedAt":"2022-11-17T22:17:00Z","content":"WASHINGTON, Nov 17 (Reuters) - White House competition adviser Tim Wu said Thursday the Biden administration is still backing tech antitrust legislation that is before Congress as time runs short bef "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bidens celebrate their first Halloween at the White House - Reuters","description":"President Joe Biden and first lady Jill Biden welcomed trick-or-treaters to the White House to celebrate Halloween on Monday, their first time hosting such a celebration since taking office.","publishedAt":"2022-10-31T22:30:00Z","content":"WASHINGTON, Oct 31 (Reuters) - President Joe Biden and first lady Jill Biden welcomed trick-or-treaters to the White House to celebrate Halloween on Monday, their first time hosting such a celebratio "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Biden, Sunak discuss Ukraine, China, N.Ireland - White House - Reuters","description":"U.S. President Joe Biden and British Prime Minister Rishi Sunak affirmed their strong support for Ukraine on Wednesday as they met for talks that included the blast that took place in Poland and challenges posed by China, the White House said.","publishedAt":"2022-11-16T06:29:00Z","content":"Nov 16 (Reuters) - U.S. President Joe Biden and British Prime Minister Rishi Sunak affirmed their strong support for Ukraine on Wednesday as they met for talks that included the blast that took place "},{"source":{"id":"ars-technica","name":"Ars Technica"},"author":"Beth Mole","title":"Record number of parents miss work as respiratory illnesses spike in kids","description":"Though there are signs things could get worse, the White House has a rosy outlook.","publishedAt":"2022-11-16T23:34:11Z","content":"Enlarge/ Parents work on their computers while their son entertains himself at their home in Boston in April 2020. \r\n3 with 0 posters participating\r\nRespiratory illnesses are raging this fall, slammi "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"wrojasinsider.com (Warren Rojas)","title":"Longtime Trump aide Hope Hicks, who told the embattled former president he lost the 2020 election, is testifying to the Jan. 6 select committee today: report","description":"Former White House spokeswoman Hope Hicks is meeting with the House committee to share what she knows about efforts to overturn the 2020 election.","publishedAt":"2022-10-25T16:47:03Z","content":"Hope Hicks, one of the few Trump White House aides who refused to go along with the embattled former president's 2020 election denial scheme, is scheduled to talk with January 6 select committee inve "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"ktangalakislippertinsider.com (Katherine Tangalakis-Lippert)","title":"Kevin McCarthy, who Liz Cheney called the 'leader of the pro-Putin wing' of the GOP, has developed a reputation for desperate power grabs: 'he's willing to sacrifice everything for his own political gain'","description":"The House minority leader last week suggested limiting the amount of aid sent to Ukraine if the GOP takes control of the House in November's election.","publishedAt":"2022-10-24T01:57:07Z","content":"Following his statements last week suggesting aid to Ukraine may be limited if Republicans take control of the House of Representatives in November's election, House Minority Leader Kevin McCarthy is "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"tmitchellinsider.com (Taiyler Simone Mitchell)","title":"Adam Schiff slams Kevin McCarthy after he promises to remove 3 prominent Dems from their committees: 'He will do whatever Marjorie Taylor Greene wants him to do'","description":"House Minority Leader Kevin McCarthy is running for House Speaker. He's promised to reinstate MTG to committees and remove some Dems from theirs.","publishedAt":"2022-11-21T02:04:51Z","content":"Rep. Adam Schiff criticized House Minority Leader Kevin McCarthy for vowing to remove three Democrats from their committee assignments if elected speaker.\r\nMcCarthy has his sights set on removing Rep "},{"source":{"id":"","name":"The Guardian"},"author":"Dominic Rushe and agencies","title":"US judge blocks 2.2bn Penguin Random House merger","description":"Justice department argued the melding of the publishing house with Simon  Schuster would harm competition and authors payA US judge has blocked the 2.2bn planned merger of Penguin Random House, the worlds largest book publisher, with rival Simon  Schuste","publishedAt":"2022-11-01T00:30:18Z","content":"A US judge has blocked the 2.2bn planned merger of Penguin Random House, the worlds largest book publisher, with rival Simon amp; Schuster.\r\nJudge Florence Pan of the US district court for the Dist "},{"source":{"id":"","name":"The Guardian"},"author":"Harry Taylor","title":"Exploding e-scooter battery sets Hampshire house alight","description":"Footage released by fire and rescue service shows how blaze took hold at property in BordonAn exploding electric scooter battery caused a house fire in Hampshire on Sunday, which led to a man being treated by paramedics.Crews from Hampshire fire and rescue se","publishedAt":"2022-11-14T19:00:53Z","content":"An exploding electric scooter battery caused a house fire in Hampshire on Sunday, which led to a man being treated by paramedics.\r\nCrews from Hampshire fire and rescue service (HRFS) were called to B "},{"source":{"id":"","name":"The Guardian"},"author":"Lauren Aratani in New York","title":"Biden admits Democrats unlikely to maintain control of House","description":"President at G20 says I dont think were going to make it after Republicans triumph in key races and stand on brink of majorityJoe Biden on Monday expressed doubts that Democrats can maintain their majority in the US House of Representatives after Republic","publishedAt":"2022-11-14T17:49:14Z","content":"Joe Biden on Monday expressed doubts that Democrats can maintain their majority in the US House of Representatives after Republicans won key races over the weekend.\r\nI think were going to get very cl "},{"source":{"id":"","name":"The Guardian"},"author":"Chris Stein in Washington","title":"Republicans gain narrow majority to control House  live","description":"ulliSlim victory defies expectations of red wave midterms win/liliSign up to receive First Thing  our daily briefing by email/li/ulGood morning, US politics blog readers. Last night, Republicans scored the victory they needed to gain a majority","publishedAt":"2022-11-17T13:54:15Z","content":"Good morning, US politics blog readers. Last night, Republicans scored the victory they needed to gain a majority in the House of Representatives, putting them in a position to force Joe Bidens White "},{"source":{"id":"","name":"The Guardian"},"author":"PA Media","title":"Companies House is dysfunctional and facilitating fraud, MPs told","description":"Less verification for someone to set up fraudulent shell firm than to borrow a library book, risk managers sayThe anti-fraud leader at the trade body UK Finance has said the government needs to fix the dysfunctional Companies House because it is helping to ","publishedAt":"2022-11-08T15:12:43Z","content":"The anti-fraud leader at the trade body UK Finance has said the government needs to fix the dysfunctional Companies House because it is helping to facilitate business fraud.\r\nNick Van Benschoten, the "},{"source":{"id":"","name":"The Guardian"},"author":"Joe Middleton","title":"UK house prices stall as mortgage rate rise fuels caution","description":"The drop follows two years of growth, although property professionals recorded some regional variationHouse prices stalled last month after more than two years of growth as a sharp rise in mortgage rates fuelled caution among buyers, according to Britains of","publishedAt":"2022-11-10T00:01:39Z","content":"House prices stalled last month after more than two years of growth as a sharp rise in mortgage rates fuelled caution among buyers, according to Britains official surveyors body.\r\nThe Royal Instituti "},{"source":{"id":"","name":"The Guardian"},"author":"Mark Brown North of England correspondent","title":"Britains loneliest house goes on sale for reported 10m","description":"Skiddaw House on the market for first time, along with 1,214 hectares of Lake District land  including three mountaintopsIn popular fiction a century ago, it was described as one of the loneliest dwelling-places in all the British Isles and was the setting","publishedAt":"2022-11-19T08:00:54Z","content":"In popular fiction a century ago, it was described as one of the loneliest dwelling-places in all the British Isles and was the setting for a wild and melodramatic murder.\r\nThe estate agent selling i "},{"source":{"id":"","name":"The Guardian"},"author":"Guardian community team","title":"Tell us: does your house have a horrible history","description":"We would like to hear the haunting stories behind your homesHas your house turned out to have a horrible history We would like to hear about the past horrors that have befallen your home  and how you addressed them. You can share your story using the form b","publishedAt":"2022-11-19T14:38:56Z","content":"Has your house turned out to have a horrible history We would like to hear about the past horrors that have befallen your home and how you addressed them. \r\nYou can share your story using the form b "},{"source":{"id":"","name":"The Guardian"},"author":"Rob Evans and David Conn","title":"Tory peer apparently misled watchdog investigating his alleged misconduct","description":"House of Lords watchdog has been examining Earl of Shrewsbury over his work for healthcare firmA Conservative hereditary peer appears to have misled the House of Lords standards watchdog during an investigation into his alleged misconduct.The House of Lords c","publishedAt":"2022-10-30T11:39:03Z","content":"A Conservative hereditary peer appears to have misled the House of Lords standards watchdog during an investigation into his alleged misconduct.\r\nThe House of Lords commissioners for standards have b "},{"source":{"id":"cnn","name":"CNN"},"author":"Jen Christensen, Nadia Kounang","title":"Parents welcome twins from embryos frozen 30 years ago","description":"In April 1992, Vanessa Williams' \"Save the Best for Last\" topped the Billboard 100, Arkansas Gov. Bill Clinton was running for the White House, \"Who's the Boss\" aired its final episode, and the babies born to Rachel and Philip Ridgeway a couple of weeks ago ","publishedAt":"2022-11-21T05:01:20Z","content":"In April 1992, Vanessa Williams Save the Best for Last topped the Billboard 100, Arkansas Gov. Bill Clinton was running for the White House, Whos the Boss aired its final episode, and the babies bor "},{"source":{"id":"cnn","name":"CNN"},"author":"Paul LeBlanc","title":"Analysis: Why the Mar-a-Lago investigation has a special counsel and a special master","description":"The Justice Department's investigation into the White House documents seized from former President Donald Trump's Mar-a-Lago resort is among the most politically explosive probes in recent years. Here's what a special master is, what a special counsel is and ","publishedAt":"2022-11-22T22:40:27Z","content":"A version of this story appears in CNNs What Matters newsletter. To get it in your inbox, sign up for free here.\r\nThe Justice Departments investigation into the White House documents seized from form "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Republican U.S. House will sharpen China focus, monitor Ukraine aid - Reuters","description":"Republicans will use their new a href=\"/world/us/republicans-one-seat-away-winning-house-us-midterm-vote-2022-11-16/\"majority in the U.S. House/a of Representatives to intensify Washington's focus on China, and more closely monitor aid going to Ukraine, b","publishedAt":"2022-11-16T23:58:00Z","content":"WASHINGTON, Nov 16 (Reuters) - Republicans will use their new majority in the U.S. House of Representatives to intensify Washington's focus on China, and more closely monitor aid going to Ukraine, bu "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Factbox: German government's plan to reform welfare - Reuters","description":"Germany's upper house of parliament a href=\"/world/europe/german-upper-house-blocks-landmark-welfare-reform-2022-11-14/\"blocked a landmark welfare reform/a on Monday that was meant to raise payments to people on state benefits and help the unemployed gain","publishedAt":"2022-11-14T11:41:00Z","content":"BERLIN, Nov 14 (Reuters) - Germany's upper house of parliament blocked a landmark welfare reform on Monday that was meant to raise payments to people on state benefits and help the unemployed gain ne "},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Fact Check","title":"Fact Check-Fabricated 'Commitment to America' graphic circulates inaccurate Republican agenda ahead of Midterms - Reuters","description":"An altered graphic is circulating online purporting to show policy points published by U.S. House Republicans under the Commitment to America agenda ahead of the midterm elections this November. The graphic is fake, however and no such graphic can be viewed","publishedAt":"2022-10-24T10:28:00Z","content":"An altered graphic is circulating online purporting to show policy points published by U.S. House Republicans under the Commitment to America agenda ahead of the midterm elections this November. The  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Analysis: How Congress might look for Biden post midterms: The good, bad, and the ugly - Reuters","description":"The midterm elections in the United States on Nov. 8 will determine whether Republicans or Democrats control each house of Congress, and the results will have a profound impact on the next two years of President Joe Biden's White House tenure.","publishedAt":"2022-10-27T17:15:00Z","content":"WASHINGTON, Oct 27 (Reuters) - The midterm elections in the United States on Nov. 8 will determine whether Republicans or Democrats control each house of Congress, and the results will have a profoun "},{"source":{"id":"entertainment-weekly","name":"Entertainment Weekly"},"author":"Nick Romano","title":"House of the Dragon season finale: Vermithor explained  EW.com - Entertainment Weekly News","description":"olliHouse of the Dragon season finale: Vermithor explained  EW.comEntertainment Weekly News\r\n/liliHouse of the Dragon  S1 EP10: Inside the Episode (HBO)GameofThrones\r\n/liliExplained: What Happened in the House of the Dragon Season 1 Finale","publishedAt":"2022-10-24T15:39:00Z","content":"Warning: Spoilers from the House of the Dragon season 1 finale are discussed in this article.\r\nHouse of the Dragon's first season finale introduced a new dragon to the playing field, and HBO has now  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Factbox: Who is Hakeem Jeffries, favored candidate for U.S. House Democratic leader - Reuters.com","description":"U.S. congressman a href=\"/world/us/hakeem-jeffries-launches-bid-lead-us-house-democrats-2022-11-18/\"Hakeem Jeffries/a of New York launched a bid on Friday to become the Democratic leader in the House of Representatives. If he succeeds in the Nov. 30 leade","publishedAt":"2022-11-18T21:51:00Z","content":"Nov 18 (Reuters) - U.S. congressman Hakeem Jeffries of New York launched a bid on Friday to become the Democratic leader in the House of Representatives. If he succeeds in the Nov. 30 leadership elec "},{"source":{"id":"","name":"NPR"},"author":"Dustin Jones","title":"Judiciary Republicans hint at investigation into FBI, DOJ if they retake the House","description":"Republicans on the House Judiciary Committee have asked the Justice Department and FBI for documents ahead of what they said will be a series of investigations if Republicans retake the House.","publishedAt":"2022-11-05T00:09:05Z","content":"Ranking member Rep. Jim Jordan, R-Ohio, at a House Judiciary Committee hearing on July 14, in Washington, DC. Jordan and House Judiciary Republicans plan to investigate the FBI and Justice Department "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S. House committee to hold hearing on collapse of FTX - Reuters","description":"The U.S. House Financial Services Committee plans to hold a hearing in December on the collapse of cryptocurrency exchange FTX.","publishedAt":"2022-11-16T15:13:00Z","content":"WASHINGTON, Nov 16 (Reuters) - The U.S. House Financial Services Committee plans to hold a hearing in December on the collapse of cryptocurrency exchange FTX.\r\nThe committee said it expects to hear f "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S. VP Harris met briefly with China's Xi at APEC - Reuters","description":"U.S. Vice President Kamala Harris on Saturday met briefly with Chinese President Xi Jinping, a White House official said.","publishedAt":"2022-11-19T04:18:00Z","content":"BANGKOK/SHANGHAI, Nov 19 (Reuters) - U.S. Vice President Kamala Harris on Saturday met briefly with Chinese President Xi Jinping, a White House official said.\r\n\"The Vice President noted a key message "},{"source":{"id":"","name":"CNET"},"author":"Jennifer Bisset","title":"'Game of Thrones' Deepfake Turns Milly Alcock into Daenerys Targaryen - CNET","description":"House of the Dragon's Milly Alcock makes a fierce Daenerys Targaryen.","publishedAt":"2022-10-25T23:02:53Z","content":"House of the Dragon had its season 1 finale on Sunday, but fan favorite star Milly Alcock had her last appearance weeks ago in episode 5. In a handful of episodes, her strong-willed, occasionally che "},{"source":{"id":"","name":"NPR"},"author":"Ximena Bustillo","title":"Democrat Eric Sorensen's win keeps Illinois House seat with Democrats","description":"Former TV weatherman Eric Sorensen has won the Illinois House seat being vacated by fellow Democrat Cheri Bustos, defeating Republican challenger Esther Joy King.","publishedAt":"2022-11-10T19:06:52Z","content":"Democrat Eric Sorensen, opponents in the race for the open 17th Congressional District seat that represents much of northwestern Illinois, including Rockford, the Quad Cities and Peoria.\r\nJohn J. Kim "},{"source":{"id":"","name":"Slashdot.org"},"author":"BeauHD","title":"White House Invites Dozens of Nations For Ransomware Summit","description":"An anonymous reader quotes a report from the Associated Press: The White House is bringing together three dozen nations, the European Union and a slew of private-sector companies for a two-day summit starting Monday that looks at how best to combat ransomware","publishedAt":"2022-10-31T22:00:00Z","content":"The White House is bringing together three dozen nations, the European Union and a slew of private-sector companies for a two-day summit starting Monday that looks at how best to combat ransomware at "},{"source":{"id":"","name":"NPR"},"author":"Deepa Shivaram","title":"Nevada Democrat Rep. Susie Lee wins reelection to U.S. House","description":"Democratic Rep. Susie Lee has won reelection in Nevada's 3rd Congressional District, beating her challenger, Republican April Becker, in one of the most competitive House seats this cycle.","publishedAt":"2022-11-12T02:37:37Z","content":"Rep. Susie Lee, D-Nev., speaks at a news conference in Washington in May.\r\nBill Clark/CQ-Roll Call, Inc via Getty Images\r\nDemocratic Rep. Susie Lee has won reelection in Nevada's 3rd Congressional Di "},{"source":{"id":"","name":"Slashdot.org"},"author":"msmash","title":"Judge Blocks Penguin Random House-Simon and Schuster Merger","description":"A federal judge has blocked Penguin Random House's proposed purchase of Simon  Schuster, agreeing with the Justice Department that the joining of two of the world's biggest publishers could \"lessen competition\" for \"top-selling books.\" From a report: The rul","publishedAt":"2022-11-02T16:01:00Z","content":"capitalism demands that every company be consolidated into one mega corporation. That's the natural order of things, the big fish eat all the little fish."},{"source":{"id":"","name":"Entrepreneur"},"author":"Entrepreneur Staff","title":"How to Start a Row House Franchise in 2022","description":"Looking for information about how to open a Row House franchise Here's what you need to know.","publishedAt":"2022-11-02T18:22:00Z","content":"Row House is a network of premium boutique indoor rowing studios, delivering a low-impact, high-energy workout focused on generating team energy. Established in New York City in 2014, Row House was b "},{"source":{"id":"","name":"The Guardian"},"author":"","title":"Show of solidarity and a T-rex: day four at Cop27  in pictures","description":"Protesters wear white as US House speaker Nancy Pelosi joins delegates at climate summit in Egypt Continue reading...","publishedAt":"2022-11-10T17:06:00Z","content":"Protesters wear white as US House speaker Nancy Pelosi joins delegates at climate summit in Egypt"},{"source":{"id":"","name":"The Guardian"},"author":"Staff and agencies","title":"Biden to meet Xi Jinping at G20 in first face-to-face talks as president","description":"Pair to discuss efforts to deepen lines of communication, White House says, with Taiwan and human rights set to be discussedJoe Biden will meet his Chinese counterpart Xi Jinping on Monday on the sidelines of the G20 summit, the White House has said, in the","publishedAt":"2022-11-10T17:16:17Z","content":"Joe Biden will meet his Chinese counterpart, Xi Jinping, on Monday on the sidelines of the G20 summit, the White House has said, in their first face-to-face talks since the US leader became president "},{"source":{"id":"","name":"CNET"},"author":"Daniel Van Boom","title":"'House of the Dragon' Season Finale Recap: This Means War - CNET","description":"Episode 10 of House of the Dragon's first season saw Rhaenyra and Daemon prepare for battle with the Hightowers.","publishedAt":"2022-10-24T17:38:00Z","content":"King Viserys finally passed away in last week's episode, but Rhaenyra and Daemon Targaryen didn't find out about it. Unbeknownst to them, a new king, Aegon the Second, had already been crowned. They  "},{"source":{"id":"","name":"CNET"},"author":"Daniel Van Boom","title":"'House of the Dragon' Season Finale: That Killer Ending Explained - CNET","description":"Somebody died in House of the Dragon's season finale, but you probably knew that would happen going in. Spoilers ahead.","publishedAt":"2022-10-25T00:57:00Z","content":"After years of anticipation and over 2 months of airtime, House of the Dragon season 1 is done and dusted. Excitement was high for HBO'sGame of Thrones prequel, and with around 30 million people watc "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S. supports African-led peace process for Ethiopia - White House - Reuters","description":"The U.S. remains committed to supporting an African-led peace process for Ethiopia, White House spokesperson Karine Jean-Pierre said on Wednesday.","publishedAt":"2022-11-02T18:41:00Z","content":"WASHINGTON, Nov 2 (Reuters) - The U.S. remains committed to supporting an African-led peace process for Ethiopia, White House spokesperson Karine Jean-Pierre said on Wednesday.\r\nThe Ethiopian governm "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S. concerned about threats from Iran against Saudi Arabia - Reuters.com","description":"The United States is concerned about threats from Iran against Saudi Arabia and will not hesitate to respond if necessary, a White House spokesperson said on Tuesday.","publishedAt":"2022-11-01T17:10:00Z","content":"WASHINGTON, Nov 1 (Reuters) - The United States is concerned about threats from Iran against Saudi Arabia and will not hesitate to respond if necessary, a White House spokesperson said on Tuesday.\r\n\" "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"White House: Biden looks forward to speaking with next UK prime minister Sunak - Reuters","description":"U.S. President Joe Biden looks forward to speaking with Britain's next prime minister, Rishi Sunak, in coming days, White House press secretary Karine Jean-Pierre said on Monday.","publishedAt":"2022-10-24T19:38:00Z","content":"WASHINGTON, Oct 24 (Reuters) - U.S. President Joe Biden looks forward to speaking with Britain's next prime minister, Rishi Sunak, in coming days, White House press secretary Karine Jean-Pierre said  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Biden to travel to Egypt, Cambodia and Indonesia for November summits -White House - Reuters","description":"U.S. President Joe Biden will travel to Egypt to participate in the COP27 climate summit on Nov. 11, the White House said on Friday.","publishedAt":"2022-10-28T22:58:00Z","content":"Oct 28 (Reuters) - U.S. President Joe Biden will travel to Egypt to participate in the COP27 climate summit on Nov. 11, the White House said on Friday.\r\nBiden will then travel to Cambodia from Nov. 1 "},{"source":{"id":"engadget","name":"Engadget"},"author":"Karissa Bell","title":"Elizabeth Holmes sentenced to 11 years in prison on fraud charges","description":"Elizabeth Holmes, the former CEO and founder of Theranos, has been sentenced to just over 11 years in prison for defrauding the investors of her blood testing startup. The sentence comes almost a year after Holmes was found guilty\r\n on four counts of fraud fo","publishedAt":"2022-11-18T22:18:16Z","content":"Elizabeth Holmes, the former CEO and founder of Theranos, has been sentenced to just over 11 years in prison for defrauding the investors of her blood testing startup. The sentence comes almost a yea "},{"source":{"id":"","name":"Global News"},"author":"Andrew Benson","title":"Major house explosion reported in Regina - Global News","description":"olliMajor house explosion reported in ReginaGlobal News\r\n/lili'Major explosion' rocks Regina's North Central neighbourhoodCJME News Talk Sports\r\n/liliMinor injuries reported in explosion of vacant North Central homeRegina Leader Post\r\n/li","publishedAt":"2022-11-13T21:07:54Z","content":"Regina residents across the city were hit with a bang after a major house explosion occurred in the North Central neighbourhood Sunday morning.\r\nAt 10:50 a.m., Regina Fire was at the scene of a major "},{"source":{"id":"engadget","name":"Engadget"},"author":"Kris Holt","title":"'The Witcher 3' finally hits PS5 and Xbox Series X/S on December 14th","description":"CD Projekt Red has revealed that the PS5 and Xbox Series X/S versions of The Witcher 3: Wild Hunt will finally be available on December 14th. The studio hasn't shown off what gameplay looks like on those consoles or many details about what's in store, but it ","publishedAt":"2022-11-14T16:31:18Z","content":"CD Projekt Red has revealed that the PS5 and Xbox Series X/S versions of The Witcher 3: Wild Hunt will finally be available on December 14th. The studio hasn't shown off what gameplay looks like on t "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"US election results: Republicans win House majority - CTV News","description":"Republicans won control of the U.S. House on Wednesday, returning the party to power in Washington and giving conservatives leverage to blunt President Joe Biden's agenda and spur a flurry of investigations. But a threadbare majority will pose immediate chall","publishedAt":"2022-11-17T01:03:00Z","content":"WASHINGTON - \r\nRepublicans won control of the U.S. House on Wednesday, returning the party to power in Washington and giving conservatives leverage to blunt President Joe Biden's agenda and spur a fl "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"mhallbusinessinsider.com (Madison Hall)","title":"Live Results: Alabama votes in congressional and state elections","description":"Alabama is hosting elections for one seat in the US Senate and seven in the House of Representatives.","publishedAt":"2022-11-08T03:40:14Z","content":"Alabama is holding US congressional elections on November 8. Polls close at 7 p.m. CT.\r\nOnly one of Alabama's two US Senate seats is up for election this year. Republican Katie Britt is running agai "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Judge rules that giant U.S. book merger may not go forward - Reuters","description":"A planned 2.2 billion merger of Penguin Random House, the world's largest book publisher, and rival Simon  Schuster cannot go forward, a judge ruled on Monday.","publishedAt":"2022-10-31T22:51:00Z","content":"WASHINGTON, Oct 31 (Reuters) - A planned 2.2 billion merger of Penguin Random House, the world's largest book publisher, and rival Simon amp; Schuster cannot go forward, a judge ruled on Monday.\r\nU "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Key moments from Italian PM Meloni's maiden speech - Reuters","description":"New Italian Prime Minister Giorgia Meloni unveiled her policy priorities in her maiden speech to the lower house of parliament on Tuesday. Here are some of the highlights.","publishedAt":"2022-10-25T10:05:00Z","content":"ROME, Oct 25 (Reuters) - New Italian Prime Minister Giorgia Meloni unveiled her policy priorities in her maiden speech to the lower house of parliament on Tuesday. Here are some of the highlights.\r\n\" "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Biden administration seeks to cut U.S. home energy bills with 4.5 bln savings package - Reuters.com","description":"The Biden administration will offer Americans nearly 4.5 billion in assistance to help lower home energy costs, the White House said on Wednesday.","publishedAt":"2022-11-02T09:47:00Z","content":"Nov 2 (Reuters) - The Biden administration will offer Americans nearly 4.5 billion in assistance to help lower home energy costs, the White House said on Wednesday.\r\nThe package, announced by the De "},{"source":{"id":"cnn","name":"CNN"},"author":"Chandelis Duster","title":"Virginia McLaurin, who became famous after dancing with Obamas, dies at 113","description":"Virginia McLaurin, who garnered national fame for her dance with then-President Barack Obama and first lady Michelle Obama in 2016, has died. She was 113.","publishedAt":"2022-11-16T17:49:37Z","content":"Virginia McLaurin, who garnered national fame for her dance with then-President Barack Obama and first lady Michelle Obama in 2016, has died. She was 113. \r\nHer death was confirmed by her son Felipe  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"White House says 'not true' that there is national security review of Elon Musk - Reuters","description":"The White House on Monday said reports suggesting that the United States was discussing launching a national security review of some of Elon Musk's ventures were \"not true.\"","publishedAt":"2022-10-24T20:40:00Z","content":"WASHINGTON, Oct 24 (Reuters) - The White House on Monday said reports suggesting that the United States was discussing launching a national security review of some of Elon Musk's ventures were \"not t "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Biden discusses security pact, Taiwan Strait with Australian PM - Reuters","description":"U.S. President Joe Biden on Sunday met Australian Prime Minister Anthony Albanese and discussed their security pact and issues surrounding the Taiwan Strait, the White House said.","publishedAt":"2022-11-13T13:05:00Z","content":"Nov 13 (Reuters) - U.S. President Joe Biden on Sunday met Australian Prime Minister Anthony Albanese and discussed their security pact and issues surrounding the Taiwan Strait, the White House said.\r "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Biden is 'directly' involved in railroad strike negotiations - White House - Reuters","description":"U.S. President Joe Biden is \"directly\" involved in negotiations to end a railroad strike that threatens to shutdown supply chains, the White House said.","publishedAt":"2022-11-22T18:04:00Z","content":"WASHINGTON, Nov 22 (Reuters) - U.S. President Joe Biden is \"directly\" involved in negotiations to end a railroad strike that threatens to shutdown supply chains, the White House said.\r\nThe president  "},{"source":{"id":"cbs-news","name":"CBS News"},"author":"Kathryn Watson","title":"Republicans on House Judiciary panel focus on first White House target","description":"As Rep. Jim Jordan prepares to take the gavel on the House Judiciary Committee, he's asking the White House for testimony and documents about what he has...","publishedAt":"2022-11-18T16:30:00Z","content":"With the House Judiciary Committee's gavel and subpoena power close at hand, Rep. Jim Jordan, Republican of Ohio, is getting ready to launch his first investigations of the Biden administration, star "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Factbox: What is in the criminal complaint against Pelosi attack suspect - Reuters","description":"Federal law-enforcement officials have a href=\"\" target=\"_blank\"filed a criminal complaint/a in the U.S. District Court in San Francisco against David DePape, the 42-year-old man accused of a","publishedAt":"2022-10-31T20:58:00Z","content":"Oct 31 (Reuters) - Federal law-enforcement officials have filed a criminal complaint in the U.S. District Court in San Francisco against David DePape, the 42-year-old man accused of attacking Paul Pe "},{"source":{"id":"","name":"Design-milk.com"},"author":"Caroline Williamson","title":"A Glass-Stacked House in Vietnam Shrouded in Greenery","description":"Surrounded by greenery in Vietnam, the Hillside House by Cote Architects boasts stacked glass boxes, floating stairs, and vine curtains.","publishedAt":"2022-11-14T17:00:54Z","content":"Surrounded by green gardens in Hue City, Vietnam, the Hillside House by Cote Architects resides on a descending slope perched at the highest vantage point for optimal views. Designed as two, stacked  "},{"source":{"id":"cnn","name":"CNN"},"author":"Julian Zelizer","title":"Opinion: Democrats shouldn't underestimate the threat Trump poses","description":"It looks like former President Donald Trump is going to launch another bid for the White House. On Thursday, Trump told his followers to \"get ready\" for his return to the presidential campaign trail -- and top aides have been eyeing November 14 as a potential","publishedAt":"2022-11-04T22:53:30Z","content":"Editors Note: Julian Zelizer, a CNN political analyst, is a professor of history and public affairs at Princeton University. He is the author and editor of 24 books, including, The Presidency of Dona "},{"source":{"id":"cnn","name":"CNN"},"author":"Michael D'Antonio","title":"Opinion: Donald Trump Jr. is his father's son","description":"Donald Trump Jr. must have thought he was being funny. After a man invaded House Speaker Nancy Pelosi's home in San Francisco and beat her 82-year-old husband with a hammer, former President Donald Trump's eldest son posted a photo of a hammer and men's brief","publishedAt":"2022-11-01T10:49:46Z","content":"Editors Note: Michael DAntonio is the author of the book Never Enough: Donald Trump and the Pursuit of Success and co-author, with Peter Eisner, of the book High Crimes: The Corruption, Impunity, and "}]}