{"totalResults":35341,"articles":[{"source":{"id":"the-verge","name":"The Verge"},"author":"Tom Warren","title":"iPhone 14s Emergency SOS via satellite feature is coming later this month","description":"Apple is partnering with Globalstar to enable its new satellite emergency SOS feature. iPhone 14 and 14 Pro owners in the US and Canada will be able to start using the feature later this month.","publishedAt":"2022-11-10T14:00:15Z","content":"iPhone 14s Emergency SOS via satellite feature is coming later this month\r\niPhone 14s Emergency SOS via satellite feature is coming later this month\r\n / Apple confirms its using a 450 million fund t "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Rugby World Cup: Canada could match England up front - Katy Daley-Mclean","description":"Canada could match England's forwards dominance in Saturday's World Cup semi-final, says former Red Roses captain Katy Daley-Mclean.","publishedAt":"2022-10-31T06:19:51Z","content":"Flanker Marlie Packer scored a hat-trick in England's quarter-final win against Australia\r\ntabletrthRugby World Cup semi-final: Canada v England/th/tr\r\ntrtdVenue: Eden Park, Auckland Da "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S., Canada impose sanctions on two Haitian politicians - Reuters Canada","description":"The United States and Canada said on Friday they were imposing sanctions on two Haitian politicians, including the president of the country's Senate, over what Canada described as their operational support for armed gangs.","publishedAt":"2022-11-04T14:36:00Z","content":"Nov 4 (Reuters) - The United States and Canada said on Friday they were imposing sanctions on two Haitian politicians, including the president of the country's Senate, over what Canada described as t "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada World Cup squad - Reuters","description":"Canada named their 26-man squad for the Nov. 20-Dec. 18 World Cup on Sunday. Canada are in Group F alongside Belgium, Morocco and Croatia.","publishedAt":"2022-11-13T15:58:00Z","content":"Nov 13 (Reuters) - Canada named their 26-man squad for the Nov. 20-Dec. 18 World Cup on Sunday. Canada are in Group F alongside Belgium, Morocco and Croatia.\r\nSquad:\r\nGoalkeepers: James Pantemis, Mil "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada to start targeting draws for skilled immigrants next year - Reuters Canada","description":"Canada will do targeted draws for skilled immigrants for the first time starting next year, allowing it to cherry pick applicants with the most in-demand skills for the regions of the country that most need workers, the federal immigration minister told Reute","publishedAt":"2022-11-03T16:42:00Z","content":"OTTAWA, Nov 3 (Reuters) - Canada will do targeted draws for skilled immigrants for the first time starting next year, allowing it to cherry pick applicants with the most in-demand skills for the regi "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Quebec separatist party calls on Canada to split with British monarchy - Reuters Canada","description":"Canada's Quebec separatist party on Tuesday called on the federal government to sever ties with the British monarchy, saying the recent transfer of the crown to King Charles was an opportunity to do so.","publishedAt":"2022-10-25T18:19:00Z","content":"OTTAWA, Oct 25 (Reuters) - Canada's Quebec separatist party on Tuesday called on the federal government to sever ties with the British monarchy, saying the recent transfer of the crown to King Charle "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada posts blowout job gain in October, jobless rate holds steady - Reuters Canada","description":"The Canadian economy gained a net 108,300 jobs in October, far exceeding analyst forecasts and entirely recouping losses seen through the summer, while the jobless rate held steady at 5.2, Statistics Canada data showed on Friday.","publishedAt":"2022-11-04T12:44:00Z","content":"OTTAWA, Nov 4 (Reuters) - The Canadian economy gained a net 108,300 jobs in October, far exceeding analyst forecasts and entirely recouping losses seen through the summer, while the jobless rate held "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"More sanctions against Haitian political elites are coming -Canada foreign minister - Reuters Canada","description":"Canada will impose more sanctions on Haiti's political elite, its foreign minister said on Friday, accusing the politicians of helping criminal gangs increase their influence in exchange for money.","publishedAt":"2022-11-04T20:38:00Z","content":"OTTAWA, Nov 4 (Reuters) - Canada will impose more sanctions on Haiti's political elite, its foreign minister said on Friday, accusing the politicians of helping criminal gangs increase their influenc "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada sanctions Haiti ex-President Martelly for financing gangs - Reuters Canada","description":"Canada has sanctioned former Haitian President Michel Martelly and two former prime ministers for their roles in financing gangs, Canada's ambassador to Haiti said on Twitter on Sunday.","publishedAt":"2022-11-20T16:22:00Z","content":"PORT-AU-PRINCE, Nov 20 (Reuters) - Canada has sanctioned former Haitian President Michel Martelly and two former prime ministers for their roles in financing gangs, Canada's ambassador to Haiti said  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada October producer prices up 2.4 on petroleum products - Reuters.com","description":"Nov 18 (Reuters) - Producer prices in Canada rose by 2.4 in October from September on higher prices for refined petroleum energy products, Statistics Canada said on Friday. The depreciating Canadian dollar continued to affect prices.","publishedAt":"2022-11-18T13:38:00Z","content":"Nov 18 (Reuters) - Producer prices in Canada rose by 2.4 in October from September on higher prices for refined petroleum energy products, Statistics Canada said on Friday. The depreciating Canadian "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Ed Cara","title":"Doctors Treated a Deadly Genetic Disease Before Birth for the First Time","description":"A team of doctors in the U.S. and Canada are reporting a medical first. They were able to start treating a childs rare and often deadly genetic condition while she was still a fetus in the wombthe same condition that claimed the lives of her siblings. Now 1","publishedAt":"2022-11-09T22:00:00Z","content":"A team of doctors in the U.S. and Canada are reporting a medical first. They were able to start treating a childs rare and often deadly genetic condition while she was still a fetus in the wombthe sa "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"STATBOX Soccer-Canada at the World Cup - Reuters","description":"Following is a statbox on Canada at the World Cup.","publishedAt":"2022-11-04T02:20:00Z","content":"Nov 4 (Reuters) - Following is a statbox on Canada at the World Cup.\r\nFIFA Ranking: 41\r\nOdds: 150-1\r\nPrevious tournaments:\r\nCanada have appeared in only one World Cup, in 1986, having failed to quali "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"Drug shortages in Canada worsen beyond kids' meds - CTV News","description":"olliDrug shortages in Canada worsen beyond kids' medsCTV News\r\n/liliHealth Canada secures 'foreign supply' of kids' pain and fever medsCBC News\r\n/liliHealth Canada importing more kids' pain and fever meds to restock store shelvesCP24\r\n/li","publishedAt":"2022-11-15T20:47:00Z","content":"HALIFAX - \r\nDrugstore shortages in Canada are now extending beyond the children's pain and fever medication aisle into other over-the-counter and prescription drugs as supply problems worsen across t "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Brian Platt","title":"Trudeaus Finance Chief Defends Bank of Canada Ahead of Hike - Yahoo Canada Finance","description":"olliTrudeaus Finance Chief Defends Bank of Canada Ahead of HikeYahoo Canada Finance\r\n/liliPolitical tension is growing over the Bank of Canada. Here's why experts are worried - National  Globalnews.caGlobal News\r\n/liliBacklash grows against ","publishedAt":"2022-10-25T16:50:14Z","content":"(Bloomberg) -- Finance Minister Chrystia Freeland defended the Bank of Canadas independence after the main left-leaning opposition party joined the Conservatives in criticizing its record.\r\nMost Read "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Factbox: Belgium v Canada World Cup 2022: kick-off time, venue and odds - Reuters","description":"Factbox: Belgium v Canada World Cup 2022: kick-off time, venue and oddsReuters","publishedAt":"2022-11-21T09:05:00Z","content":"DOHA, Nov 21 (Reuters) - Belgium play Canada in the World Cup in Doha on Wednesday.\r\nWhen: Wednesday Nov. 23, 2200 local (1900 GMT/1400 ET)\r\nWhere: Ahmad Bin Ali Stadium\r\nCapacity: 44,740\r\nOdds:\r\nBel "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"ICC prosecutor seeks to reopen Venezuela investigation - Reuters Canada","description":"International Criminal Court (ICC) chief prosecutor Karim Khan said on Tuesday he formally asked the court to resume his investigation into alleged human rights violations committed by Venezuelan officials.","publishedAt":"2022-11-01T23:03:00Z","content":"Nov 1 (Reuters) - International Criminal Court (ICC) chief prosecutor Karim Khan said on Tuesday he formally asked the court to resume his investigation into alleged human rights violations committed "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Venezuela and Colombian presidents discuss trade, human rights - Reuters Canada","description":"The presidents of Colombia and Venezuela held their first bilateral meeting in the Venezuelan capital, Caracas, on Tuesday, where they discussed topics including trade, human rights and protecting the Amazon rainforest.","publishedAt":"2022-11-01T23:11:00Z","content":"CARACAS, Nov 1 (Reuters) - The presidents of Colombia and Venezuela held their first bilateral meeting in the Venezuelan capital, Caracas, on Tuesday, where they discussed topics including trade, hum "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Factbox: Highlights from Canada government's fall economic statement - Reuters.com","description":"Below are some of the key proposals and takeaways from the annual fall economic statement unveiled by Canada's Finance Minister Chrystia Freeland on Thursday. [nO8N2N5027","publishedAt":"2022-11-03T20:15:00Z","content":"OTTAWA, Nov 3 (Reuters) - Below are some of the key proposals and takeaways from the annual fall economic statement unveiled by Canada's Finance Minister Chrystia Freeland on Thursday. [nO8N2N5027\r\nT "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"USTR, Mexico's economy minister discuss energy, corn exports - Reuters Canada","description":"U.S. Trade Representative Katherine Tai discussed differences with Mexico over its energy sector and U.S. corn exports in a virtual meeting on Thursday with Mexican Economy Minister Raquel Buenrostro, the USTR said in a statement.","publishedAt":"2022-11-04T01:38:00Z","content":"WASHINGTON, Nov 3 (Reuters) - U.S. Trade Representative Katherine Tai discussed differences with Mexico over its energy sector and U.S. corn exports in a virtual meeting on Thursday with Mexican Econ "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada aim to 'surprise' at World Cup, says Osorio - Reuters","description":"Canada aim to surprise their opponents when they make their first appearance at the World Cup finals in 36 years, midfielder Jonathan Osorio said after a training session on Sunday.","publishedAt":"2022-11-20T19:18:00Z","content":"UMM SALAL, QATAR, Nov 20 (Reuters) - Canada aim to surprise their opponents when they make their first appearance at the World Cup finals in 36 years, midfielder Jonathan Osorio said after a training "},{"source":{"id":"","name":"Sportsnet.ca"},"author":"","title":"Canada names 26-man roster for 2022 FIFA World Cup - Sportsnet.ca","description":"olliCanada names 26-man roster for 2022 FIFA World CupSportsnet.ca\r\n/liliCanada is in the World Cup. Here's what you need to know to cheer alongCBC.ca\r\n/liliCanada names 2022 FIFA World Cup squadCTV News\r\n/liliCanada announces 26-man squ","publishedAt":"2022-11-13T15:46:00Z","content":"Canada's men's soccer team poses for a photograph after officially qualifying for the World Cup after defeating Jamaica during second half men's CONCACAF World Cup Qualifier soccer action in Toronto  "},{"source":{"id":"","name":"Global News"},"author":"The Canadian Press","title":"Bank of Canada expected to announce another interest rate hike amid recession fears - Global News","description":"olliBank of Canada expected to announce another interest rate hike amid recession fearsGlobal News\r\n/liliThe state of Canada's economy and whether a recession is a 'necessary evil'CBC.ca\r\n/liliBank of Canada to announce interest rate hikeCP2","publishedAt":"2022-10-24T11:44:22Z","content":"Even as warnings about a potential recession grow louder, the Bank of Canada is expected to announce another hefty interest rate hike on Wednesday, edging the bank closer to the end of one of the fas "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Protesters in Peru target Hochschild's largest mine - Reuters Canada","description":"Peruvian demonstrators on Monday burned infrastructure at Hochschild Mining Plc's a href=\"\" target=\"_blank\"(HOCM.L)/a Inmaculada mine as part of a protest, the company said, threatening the operations of its largest","publishedAt":"2022-10-31T23:18:00Z","content":"LIMA, Oct 31 (Reuters) - Peruvian demonstrators on Monday burned infrastructure at Hochschild Mining Plc's (HOCM.L) Inmaculada mine as part of a protest, the company said, threatening the operations  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S.-Mexico nuclear cooperation agreement enters into force - Reuters Canada","description":"A bilateral agreement on nuclear energy between the United States and Mexico entered into force, the U.S. State Department said Wednesday, adding that it will enhance cooperation on energy security.","publishedAt":"2022-11-03T03:12:00Z","content":"MEXICO CITY, Nov 2 (Reuters) - A bilateral agreement on nuclear energy between the United States and Mexico entered into force, the U.S. State Department said Wednesday, adding that it will enhance c "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada home price index slides again in October -Teranet - Reuters.com","description":"Canadian home prices dropped in October from the previous month, though less sharply than in September, while year-over-year price gains continued to slow, TeranetNational Bank National Composite House Price data showed on Friday.","publishedAt":"2022-11-18T13:34:00Z","content":"OTTAWA, Nov 18 (Reuters) - Canadian home prices dropped in October from the previous month, though less sharply than in September, while year-over-year price gains continued to slow, TeranetNational  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada September wholesale trade up 0.1 on pharmaceuticals - Reuters.com","description":"Nov 15 (Reuters) - Canadian wholesale trade increased by 0.1 in September from August on the higher sales in the personal and household goods subsector, and in particular pharmaceutical products, Statistics Canada said on Tuesday.","publishedAt":"2022-11-15T13:51:00Z","content":"Nov 15 (Reuters) - Canadian wholesale trade increased by 0.1 in September from August on the higher sales in the personal and household goods subsector, and in particular pharmaceutical products, St "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada imposes new sanctions on Haitian politicians - statement - Reuters","description":"Canada on Friday imposed sanctions on three Haitian politicians, including a former president of the country's Chamber of Deputies, with Ottawa accusing them of aiding gang leaders and laundering their illicit earnings, according to a statement.","publishedAt":"2022-11-19T17:49:00Z","content":"OTTAWA, Nov 19 (Reuters) - Canada on Friday imposed sanctions on three Haitian politicians, including a former president of the country's Chamber of Deputies, with Ottawa accusing them of aiding gang "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Colombia, Venezuela presidents to meet in Caracas - Reuters Canada","description":"Colombian President Gustavo Petro and his Venezuelan counterpart Nicolas Maduro will meet in Caracas on Tuesday to discuss their countries' recently-thawed bilateral ties and expanded trade, the Colombian government said on Monday.","publishedAt":"2022-10-31T18:30:00Z","content":"BOGOTA, Oct 31 (Reuters) - Colombian President Gustavo Petro and his Venezuelan counterpart Nicolas Maduro will meet in Caracas on Tuesday to discuss their countries' recently-thawed bilateral ties a "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada September factory sales flat on aerospace, metals - Reuters.com","description":"Nov 15 (Reuters) - Canadian factory sales were unchanged in September from August as higher sales in aerospace products and primary metals balanced out lower sales in petroleum and coal products, Statistics Canada said on Tuesday.","publishedAt":"2022-11-15T13:50:00Z","content":"Nov 15 (Reuters) - Canadian factory sales were unchanged in September from August as higher sales in aerospace products and primary metals balanced out lower sales in petroleum and coal products, Sta "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada gives Ukraine 500mln, sanctions more Russians -statement - Reuters","description":"Canada will provide Ukraine with another 500 million in additional military assistance in addition to sanctions on another nearly two dozen Russians, Prime Minister Justin Trudeau said in a statement on Monday amid the G20 summit.","publishedAt":"2022-11-14T14:51:00Z","content":"Nov 14 (Reuters) - Canada will provide Ukraine with another 500 million in additional military assistance in addition to sanctions on another nearly two dozen Russians, Prime Minister Justin Trudeau "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Mexico says Trump-era border program has ended - Reuters Canada","description":"Mexico's foreign ministry said on Tuesday a Trump-era program that forces asylum seekers to wait in Mexico for U.S. immigration hearings, known as the Migrant Protection Protocols (MPP), has ended.","publishedAt":"2022-10-25T17:46:00Z","content":"MEXICO CITY, Oct 25 (Reuters) - Mexico's foreign ministry said on Tuesday a Trump-era program that forces asylum seekers to wait in Mexico for U.S. immigration hearings, known as the Migrant Protecti "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Swiss beat Canada to reach BJK Cup semi-finals - Reuters","description":"Switzerland booked their place in the last four of the Billie Jean King Cup Finals as Viktorija Golubic and Belinda Bencic claimed singles victories against Canada on Friday.","publishedAt":"2022-11-11T16:40:00Z","content":"GLASGOW, Nov 11 (Reuters) - Switzerland booked their place in the last four of the Billie Jean King Cup Finals as Viktorija Golubic and Belinda Bencic claimed singles victories against Canada on Frid "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada corporate bond market issuance perking up again - Reuters.com","description":"Canadian corporate bond issuance has begun to rebound after a lull of 10 months, with companies plotting expansion plans and central banks apparently close to the peak of their current cycle of interest rate hikes.","publishedAt":"2022-11-15T19:29:00Z","content":"TORONTO, Nov 15 (Reuters) - Canadian corporate bond issuance has begun to rebound after a lull of 10 months, with companies plotting expansion plans and central banks apparently close to the peak of  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Ecuador transfers gang leaders to maximum security prison - Reuters Canada","description":"Two gang leaders who Ecuadorean authorities say are responsible for violence inside prisons were moved to a maximum security facility on Friday, the government said, part of efforts to reduce violence in the country's chaotic jails.","publishedAt":"2022-11-18T16:30:00Z","content":"QUITO, Nov 18 (Reuters) - Two gang leaders who Ecuadorean authorities say are responsible for violence inside prisons were moved to a maximum security facility on Friday, the government said, part of "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Breakingviews - U.S. cannabis movement can learn from Canada - Reuters","description":"The U.S. cannabis industry would do well to heed the lessons of Canadas growing pains. Preliminary election results indicate that Maryland and Missouri will become the latest states to legalize recreational weed usage, bringing the total to 21, plus Washingt","publishedAt":"2022-11-09T18:39:00Z","content":"TORONTO, Nov 9 (Reuters Breakingviews) - The U.S. cannabis industry would do well to heed the lessons of Canadas growing pains. Preliminary election results indicate that Maryland and Missouri will b "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Brazil's rural boomtowns ensure Bolsonarismo's future - Reuters Canada","description":"The small city of Catanduva in the rural farm belt of Sao Paulo state has been ahead of the political curve in Brazil.","publishedAt":"2022-10-28T10:12:00Z","content":"CATANDUVA, Brazil, Oct 28 (Reuters) - The small city of Catanduva in the rural farm belt of Sao Paulo state has been ahead of the political curve in Brazil.\r\nIn 1996, the city elected leftist Felix S "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada targets record 500000 new immigrants in 2025 - Reuters.com","description":"Canada plans to welcome a record 500,000 new permanent residents in 2025, and has boosted its targets for the next two years, as it looks to ramp up arrivals to address an acute labor shortage, Immigration Minister Sean Fraser said on Tuesday.","publishedAt":"2022-11-01T15:26:00Z","content":"OTTAWA, Nov 1 (Reuters) - Canada plans to welcome a record 500,000 new permanent residents in 2025, and has boosted its targets for the next two years, as it looks to ramp up arrivals to address an a "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Venezuela's monthly inflation slows to 6.2 in October - Reuters Canada","description":"Venezuela's monthly inflation in October hit 6.2, a sharp slowdown from September when prices rose 28.7, according to data released on Friday by the country's central bank.","publishedAt":"2022-11-04T22:47:00Z","content":"CARACAS, Nov 4 (Reuters) - Venezuela's monthly inflation in October hit 6.2, a sharp slowdown from September when prices rose 28.7, according to data released on Friday by the country's central ban "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"China calls Canadian minister's remarks contrary to fact - Reuters","description":"China's foreign ministry said on Thursday it had launched \"stern representations\" against Canada following the foreign minister's description of the Asian nation as an \"a href=\"/world/americas/canada-readies-new-indo-pacific-strategy-amid-tense-china-ties-20","publishedAt":"2022-11-10T08:02:00Z","content":"BEIJING, Nov 10 (Reuters) - China's foreign ministry said on Thursday it had launched \"stern representations\" against Canada following the foreign minister's description of the Asian nation as an \"in "},{"source":{"id":"","name":"The Guardian"},"author":"Leyland Cecco in Toronto","title":"Canada charges hydroelectricity researcher with espionage for China","description":"Yuesheng Wang, a worker at Quebecs power utility, is accused of sending trade secrets to ChinaCanadas federal police have charged a hydroelectricity researcher at Quebecs power utility with espionage, alleging the worker was covertly sending trade secrets ","publishedAt":"2022-11-14T19:15:46Z","content":"Canadas federal police have charged a hydroelectricity researcher at Quebecs power utility with espionage, alleging the worker was covertly sending trade secrets to China.\r\nThe arrest of Yuesheng Wan "},{"source":{"id":"","name":"Sportsnet.ca"},"author":"Canadian Press","title":"Canada clinches spot in 2023 FIBA World Cup with win over Venezuela - Sportsnet.ca","description":"olliCanada clinches spot in 2023 FIBA World Cup with win over VenezuelaSportsnet.ca\r\n/liliVeterans Ejim, Scrubbs to lead Canada in key FIBA World Cup qualifying gameToronto Star\r\n/liliKassius Robertson with a HUGE GAME vs. VEN  16 PTS, 2 AST ","publishedAt":"2022-11-11T04:12:00Z","content":"Canada is going to the FIBA World Cup.\r\nKassius Robertsons 16-point performance helped Canadas mens basketball team beat Venezuela 94-56 on Thursday to clinch a berth in next summers major interna "},{"source":{"id":"","name":"Citynews.ca"},"author":"Anil Jhalli","title":"CHEO's emergency department handling more patients than it was designed for due to surge in RSV cases - Ottawa.CityNews.ca","description":"olliCHEO's emergency department handling more patients than it was designed for due to surge in RSV casesOttawa.CityNews.ca\r\n/liliWhat to know about RSV, a virus surging among young children in CanadaCBC News\r\n/liliRSV cases are surging among ","publishedAt":"2022-10-26T21:30:00Z","content":"The emergency department at the Children's Hospital of Eastern Ontario (CHEO) is still far more patients than it was designed for, and hospital officials said the reason is a surge in respiratory syn "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Stunning Dow try takes favourites England into World Cup final - Reuters","description":"England reached the final of the women's Rugby World Cup with a 26-19 win over Canada in their semi-final at Auckland's Eden Park on Saturday.","publishedAt":"2022-11-05T05:45:53Z","content":"AUCKLAND, Nov 5 (Reuters) - England reached the final of the women's Rugby World Cup with a 26-19 win over Canada in their semi-final at Auckland's Eden Park on Saturday.\r\nAbby Dow's breakaway try 10 "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada to sanction Belarus firms, more officials over Russia's war in Ukraine - Reuters","description":"Canada said on Tuesday it will slap more sanctions on Belarusian President Alexander Lukashenko's administration for supporting Russia's war in Ukraine.","publishedAt":"2022-11-22T10:04:00Z","content":"Nov 22 (Reuters) - Canada said on Tuesday it will slap more sanctions on Belarusian President Alexander Lukashenko's administration for supporting Russia's war in Ukraine.\r\nThe foreign ministry in Ot "},{"source":{"id":"","name":"Castanet.net"},"author":"","title":"Remnants of hurricane Nicole bring heavy rain to southern Quebec and Atlantic region - Canada News - Castanet.net","description":"olliRemnants of hurricane Nicole bring heavy rain to southern Quebec and Atlantic region - Canada NewsCastanet.net\r\n/liliN.L. hit with mixed bag of winter-like weather from post-tropical storm NicoleCBC.ca\r\n/liliHurricane Nicole: Heavy rain in","publishedAt":"2022-11-12T14:38:00Z","content":"The remnants of hurricane Nicole are bringing heavy rainfall to much of southern Quebec and Atlantic Canada.\r\nEnvironment Canada said Friday that Nicole would merge overnight with a cold front and tr "},{"source":{"id":"the-globe-and-mail","name":"The Globe And Mail"},"author":"Niall McGee","title":"Ottawa orders Chinese divestment in three Canadian critical minerals companies - The Globe and Mail","description":"olliOttawa orders Chinese divestment in three Canadian critical minerals companiesThe Globe and Mail\r\n/liliCanada orders three Chinese firms to exit critical minerals dealsReuters.com\r\n/liliCanada orders three Chinese firms to divest from coun","publishedAt":"2022-11-02T21:24:30Z","content":"Ottawa is ordering Chinese state-owned companies to immediately divest their interests in three Canadian critical minerals companies, as Canada doubles down on its efforts to get tougher on China, af "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"HSBC's Canada unit loses National Bank, CIBC as bidders, Global and Mail reports - Reuters","description":"National Bank of Canada a href=\"\" target=\"_blank\"(NA.TO)/a and Canadian Imperial Bank of Commerce (CIBC) a href=\"\" target=\"_blank\"(CM.TO)/a have dropped out as bidders for H","publishedAt":"2022-10-30T16:45:00Z","content":"Oct 30 (Reuters) - National Bank of Canada (NA.TO) and Canadian Imperial Bank of Commerce (CIBC) (CM.TO) have dropped out as bidders for HSBC Holdings PLC's (HSBA.L) business in Canada, while Bank of "},{"source":{"id":"","name":"CNET"},"author":"Leslie Katz","title":"Canadian Prime Minister Justin Trudeau to Appear on 'Canada's Drag Race' - CNET","description":"From the world stage to the drag stage: Canada's prime minister will be a guest on Canada's Drag Race: Canada vs The World.","publishedAt":"2022-11-08T23:42:00Z","content":"Start your engines, RuPaul's Drag Race fans. Canadian Prime Minister Justin Trudeau will appear on the upcoming show Canada's Drag Race spinoff Canada's Drag Race: Canada vs The World. \r\n\"We're maki "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"insiderinsider.com (Michael Peck)","title":"The US and Canada are updating a Cold War-era system to keep an eye on Russian and Chinese missiles. Experts say they need to add a lot more territory too.","description":"With China, Russia, and North Korea fielding more advanced missiles, the US and Canada are paying more attention to NORAD.","publishedAt":"2022-10-26T21:53:00Z","content":"During the Cold War, the North American Aerospace Defense Command was guardian against nuclear annihilation and a reminder that such annihilation was only one order away.\r\nAfter the demise of the Sov "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"Can Diwali be a public holiday in Canada - CTV News","description":"The recent move to make Diwali a public holiday in NYC has raised questions as to why a similar move hasn't already been made in Canada, which is home to millions of South Asians.","publishedAt":"2022-10-27T02:08:00Z","content":"As millions of South Asians around the world celebrate Diwali this year, a festival symbolizing triumph over darkness and dating back 2,500 years, its strong foothold on regions far from the Indian s "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"Bird flu: H5N1 spreading across Canada - CTV News","description":"By some measures, the ongoing outbreaks of avian flu in British Columbia pale when compared to the devastating eruption of the disease in 2004 that prompted a cull of 17 million birds.","publishedAt":"2022-11-15T11:47:21Z","content":"VANCOUVER - \r\nBy some measures, the ongoing outbreaks of avian flu in British Columbia pale when compared to the devastating eruption of the disease in 2004 that prompted a cull of 17 million birds.\r "},{"source":{"id":"","name":"BNNBloomberg.ca"},"author":"The Canadian Press","title":"Canadian economy grew 0.1 in August: Statistics Canada - BNN Bloomberg","description":"olliCanadian economy grew 0.1 in August: Statistics CanadaBNN Bloomberg\r\n/liliCanada's economy expanded  barely  in August, new GDP numbers showCBC News\r\n/liliCanada's economic growth slows in the summer as a smaller rate hike eyedThe Glo","publishedAt":"2022-10-28T12:38:38Z","content":"Shipping containers are loaded onto rail cars at the Global Container Terminals Inc. (GCT) Vanterm container terminal on Vancouver Harbour in Vancouver, British Columbia, Canada, on Saturday, March 2 "},{"source":{"id":"","name":"Westernu.ca"},"author":"","title":"Western News - Western hosts national conference to tap space as asset - Western News","description":"olliWestern News - Western hosts national conference to tap space as assetWestern News\r\n/liliSpace as a National Asset for Canada Conference taking place in London, Ont.  CTV NewsCTV News London\r\n/liliWestern University-led conference to disc","publishedAt":"2022-10-31T16:30:53Z","content":"When former Minister of Innovation, Science and Industry Navdeep Bains launched the new Canadian space strategy in 2019, a core recommendation was designating space as a national asset for Canada.\r\nC "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"Space as a National Asset for Canada Conference taking place in London, Ont.  CTV News - CTV News London","description":"olliSpace as a National Asset for Canada Conference taking place in London, Ont.  CTV NewsCTV News London\r\n/liliWestern University-led conference to discuss how Canada can lead space technologyCBC.ca\r\n/liliView Full coverage on Google News/l","publishedAt":"2022-10-31T17:13:56Z","content":"The growing role Canada plays in space exploration and innovation is being discussed in London, Ont. this week.\r\n Academics, industry leaders and students are among those taking part in the Space as  "},{"source":{"id":"engadget","name":"Engadget"},"author":"Karissa Bell","title":"Elon Musk wants to make Twitter's edit button free for everyone, report says","description":"Twitter may soon charge users 8 a month for verification, but Elon Musk reportedly plans to give all users a long-requested feature for free: the edit button. According to Platformers\r\nCasey Newton, the move is in the works alongside the more sweeping\r\n ch","publishedAt":"2022-11-02T01:12:48Z","content":"Twitter may soon charge users 8 a month for verification, but Elon Musk reportedly plans to give all users a long-requested feature for free: the edit button. According to Platformers\r\nCasey Newton "},{"source":{"id":"","name":"Vancouver Sun"},"author":"Brieanna Charlebois, The Canadian Press","title":"Bird flu fighters in B.C. face unprecedented challenge, as H5N1 spread across Canada - Vancouver Sun","description":"Bird flu fighters in B.C. face unprecedented challenge, as H5N1 spread across CanadaVancouver SunView Full Coverage on Google News","publishedAt":"2022-11-15T15:20:35Z","content":"The current H5N1 strain is \"behaving very differently\" to previous versions, says British Columbia chief veterinarian Theresa Burns. \r\nAuthor of the article:\r\nA chicken looks in the barn at Honey Bro "},{"source":{"id":"","name":"Global News"},"author":"Rachel Gilmore","title":"Tougher tone on China What to expect as Trudeau tours the Indo-Pacific region - Global News","description":"olliTougher tone on China What to expect as Trudeau tours the Indo-Pacific regionGlobal News\r\n/liliTrudeau missing Remembrance Day ceremony for summit in Cambodia  NewsDaily Hive\r\n/liliTrudeau en route to Southeast Asia for summits aimed at ","publishedAt":"2022-11-11T21:11:55Z","content":"Prime Minister Justin Trudeau embarked on a 10-day trip in Asia on Friday  part of a major push to foster ties and develop stronger friendships in the region.\r\nHis first stop, alongside Trade Minist "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Researcher accused of spying for China seeks bail in Canada - Reuters.com","description":"A researcher arrested in Canada and charged with espionage for allegedly trying to steal trade secrets to benefit China made his first court appearance on Tuesday via a video link and sought bail.","publishedAt":"2022-11-15T18:19:00Z","content":"MONTREAL, Nov 15 (Reuters) - A researcher arrested in Canada and charged with espionage for allegedly trying to steal trade secrets to benefit China made his first court appearance on Tuesday via a v "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada 'very unlikely' to join OPEC-like group for nickel -gov't source - Reuters","description":"Canada has not committed to establishing an OPEC-like organization for nickel-producing countries with Indonesia and is \"very unlikely\" to participate in any such group, a Canadian government source familiar with the discussions said on Thursday.","publishedAt":"2022-11-17T17:51:00Z","content":"OTTAWA, Nov 17 (Reuters) - Canada has not committed to establishing an OPEC-like organization for nickel-producing countries with Indonesia and is \"very unlikely\" to participate in any such group, a  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada readies new Indo-Pacific strategy amid tense China ties - Reuters","description":"Canada will soon announce a new Indo-Pacific strategy to challenge China on human rights issues while cooperating with the world's second-biggest economy on climate change and other shared goals, Foreign Minister Melanie Joly said on Wednesday.","publishedAt":"2022-11-09T19:25:00Z","content":"OTTAWA, Nov 9 (Reuters) - Canada will soon announce a new Indo-Pacific strategy to challenge China on human rights issues while cooperating with the world's second-biggest economy on climate change a "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canadian dollar forecasts cut as BoC trails Fed on peak-rate bets - Reuters poll - Reuters.com","description":"Canada's dollar will gain less than previously thought over the coming year as the domestic economy has lost some sensitivity to oil prices and the Bank of Canada potentially lagging the Federal Reserve in hiking rates, a Reuters poll showed.","publishedAt":"2022-11-02T17:36:00Z","content":"TORONTO, Nov 2 (Reuters) - Canada's dollar will gain less than previously thought over the coming year as the domestic economy has lost some sensitivity to oil prices and the Bank of Canada potential "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"C rises as October flash economic estimates show gains - Reuters","description":"The Canadian dollar rose against its U.S. counterpart on Tuesday as investor risk appetite picked up and preliminary domestic data showed retail sales climbing in October, while investors awaited comments by a senior Bank of Canada policymaker.","publishedAt":"2022-11-22T14:27:42Z","content":"TORONTO, Nov 22 (Reuters) - The Canadian dollar rose against its U.S. counterpart on Tuesday as investor risk appetite picked up and preliminary domestic data showed retail sales climbing in October, "},{"source":{"id":"the-globe-and-mail","name":"The Globe And Mail"},"author":"Dylan Robertson","title":"Melanie Joly unveils sanctions, 500-million for Ukraine military at G20 - The Globe and Mail","description":"olliMelanie Joly unveils sanctions, 500-million for Ukraine military at G20The Globe and Mail\r\n/liliCanada announces additional 500M in military aid to Ukraine, adds 23 names to sanctions listCBC News\r\n/liliCanada gives Ukraine 500mln, sanc","publishedAt":"2022-11-14T11:27:01Z","content":"Minister of Foreign Affairs Melanie Joly speaks to reporters during the G20 leaders summit in Nusa Dua, Bali, Indonesia, on Nov. 14.Sean Kilpatrick/The Canadian Press\r\nCanada is pledging 500-million "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Analysis: Hydro giant Canada faces provincial divides in electrification drive - Reuters","description":"Abundant hydropower in Canada, the world's third-biggest producer of the low-emissions electricity source, gives it a headstart on cleaning up its grid in a global drive to electrify vehicles and buildings and slow climate change.","publishedAt":"2022-10-27T10:11:00Z","content":"WINNIPEG, Manitoba, Oct 27 (Reuters) - Abundant hydropower in Canada, the world's third-biggest producer of the low-emissions electricity source, gives it a headstart on cleaning up its grid in a glo "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"VIEW Bank of Canada surprises with smaller-than-expected interest rate increase - Reuters","description":"The Bank of Canada announced a smaller-than-expected 50-basis point rate hike on Wednesday and said future increases would be influenced by its assessment of how tighter policy was working to slow demand and ease inflation.","publishedAt":"2022-10-26T14:19:00Z","content":"TORONTO, Oct 26 (Reuters) - The Bank of Canada announced a smaller-than-expected 50-basis point rate hike on Wednesday and said future increases would be influenced by its assessment of how tighter p "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"A nation of immigrants: Newcomers' share of Canadian population hits record - Reuters","description":"Immigrants' share of Canada's population has hit its highest point in the country's 150-year history and the biggest share among G7 countries, new data released by Statistics Canada showed on Wednesday.","publishedAt":"2022-10-26T17:43:00Z","content":"TORONTO, Oct 26 (Reuters) - Immigrants' share of Canada's population has hit its highest point in the country's 150-year history and the biggest share among G7 countries, new data released by Statist "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bank of Canada focus on more timely inflation data lowers overshoot risk - Reuters","description":"As the Bank of Canada considers raising interest rates at a slower pace, it is focusing on inflation measures that are more timely than typically observed, which could help it avoid tightening beyond the level needed to subdue price pressures.","publishedAt":"2022-11-07T16:47:00Z","content":"TORONTO, Nov 7 (Reuters) - As the Bank of Canada considers raising interest rates at a slower pace, it is focusing on inflation measures that are more timely than typically observed, which could help "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Ireland must change law to ratify EU-Canada trade deal, court rules - Reuters","description":"Ireland's Supreme Court ruled on Friday that parliament cannot ratify the European Union's free trade deal with Canada unless legislation is changed, stating that the agreement is unconstitutional as Irish law now stands.","publishedAt":"2022-11-11T12:36:00Z","content":"DUBLIN, Nov 11 (Reuters) - Ireland's Supreme Court ruled on Friday that parliament cannot ratify the European Union's free trade deal with Canada unless legislation is changed, stating that the agree "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Explainer: Under pressure: What's weighing on Canadian heavy crude - Reuters","description":"Canada's benchmark heavy crude, Western Canada Select (WCS), is trading at a steep discount to West Texas Intermediate (WTI) after weakening sharply last month, and is expected to remain subdued well into next year.","publishedAt":"2022-11-10T12:09:00Z","content":"Nov 10 (Reuters) - Canada's benchmark heavy crude, Western Canada Select (WCS), is trading at a steep discount to West Texas Intermediate (WTI) after weakening sharply last month, and is expected to  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bank of Canada: Rates need to rise to fight inflation - Reuters","description":"The Bank of Canada needs to hike interest rates further to fight stubbornly high inflation, Governor Tiff Macklem said on Tuesday, reiterating that \"we are getting closer, but we are not there yet.\"","publishedAt":"2022-11-01T22:46:00Z","content":"OTTAWA, Nov 1 (Reuters) - The Bank of Canada needs to hike interest rates further to fight stubbornly high inflation, Governor Tiff Macklem said on Tuesday, reiterating that \"we are getting closer, b "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bank of Canada sets out path for regulating digital payment providers - Reuters","description":"The Bank of Canada on Wednesday said it would take a flexible, risk-based approach in its nascent role as a digital payment regulator, aiming to ensure confidence in the safety and reliability of the fast-growing electronic payment segment.","publishedAt":"2022-11-02T15:48:00Z","content":"OTTAWA, Nov 2 (Reuters) - The Bank of Canada on Wednesday said it would take a flexible, risk-based approach in its nascent role as a digital payment regulator, aiming to ensure confidence in the saf "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"VIEW Canada annual inflation rate holds steady at 6.9 in October - Reuters.com","description":"Canada's annual inflation rate held steady at 6.9 in October, matching analyst forecasts, as higher gasoline prices and mortgage interest costs offset a slight easing of food prices, Statistics Canada data showed on Wednesday.","publishedAt":"2022-11-16T14:01:00Z","content":"TORONTO, Nov 16 (Reuters) - Canada's annual inflation rate held steady at 6.9 in October, matching analyst forecasts, as higher gasoline prices and mortgage interest costs offset a slight easing of  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada, Nigeria target oil and gas methane emissions with new laws - Reuters","description":"Oil and gas producers Canada and Nigeria have become the latest countries to tackle the potent greenhouse gas methane with laws to rein in emissions in the fossil fuel energy sector.","publishedAt":"2022-11-11T19:26:00Z","content":"SHARM EL SHEIKH, Nov 11 (Reuters) - Oil and gas producers Canada and Nigeria have become the latest countries to tackle the potent greenhouse gas methane with laws to rein in emissions in the fossil  "},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Fact Check","title":"Fact Check-Photo from Pride parade edited to suggest it is Twitter staff protesting against layoffs - Reuters","description":"A 2013 photo from a Pride parade in Winnipeg, Canada has been altered and shared in an online conversation about mass layoffs at Twitter on Nov. 4 following Elon Musks takeover of the company.","publishedAt":"2022-11-07T13:11:00Z","content":"A 2013 photo from a Pride parade in Winnipeg, Canada has been altered and shared in an online conversation about mass layoffs at Twitter on Nov. 4 following Elon Musks takeover of the company.\r\nThe e "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada's goalkeeper Crepeau to miss World Cup with broken leg - Reuters","description":"Canada Soccer said on Monday that goalkeeper Maxime Crepeau will miss the Qatar World Cup after suffering a broken right leg over the weekend while playing in the MLS Cup Final.","publishedAt":"2022-11-07T22:21:00Z","content":"Nov 7 (Reuters) - Canada Soccer said on Monday that goalkeeper Maxime Crepeau will miss the Qatar World Cup after suffering a broken right leg over the weekend while playing in the MLS Cup Final.\r\nTh "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"France out to knock New Zealand off England collision course - Reuters","description":"Favourites England and defending champions New Zealand have long been slated as most likely to face off in the women's Rugby World Cup final but France and Canada have other ideas heading into Saturday's semi-finals at Auckland's Eden Park.","publishedAt":"2022-11-04T00:33:00Z","content":"Nov 4 (Reuters) - Favourites England and defending champions New Zealand have long been slated as most likely to face off in the women's Rugby World Cup final but France and Canada have other ideas h "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"After long journey Canada's Herdman has arrived - Reuters","description":"Back in the World Cup for just the second time and first in 36 years, Canada arrive in Qatar as the designated underdog - a role coach John Herdman knows all too well having played the part his entire career.","publishedAt":"2022-11-21T12:19:00Z","content":"DOHA, Nov 21 (Reuters) - Back in the World Cup for just the second time and first in 36 years, Canada arrive in Qatar as the designated underdog - a role coach John Herdman knows all too well having  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bank of Canada says high rates starting to work, frets over housing and debt - Reuters","description":"OTTAWA, Nov 22 (Reuters) - Higher interest rates are starting to slow the Canadian economy, the Bank of Canada said on Tuesday, putting pressure on households with elevated debt and people who recently bought a home with a variable-rate mortgage.","publishedAt":"2022-11-22T16:52:00Z","content":"OTTAWA, Nov 22 (Reuters) - Higher interest rates are starting to slow the Canadian economy, the Bank of Canada said on Tuesday, putting pressure on households with elevated debt and people who recent "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Royal Bank of Canada eyes 2030 emission cuts in lending portfolio - Reuters","description":"Royal Bank of Canada a href=\"\" target=\"_blank\"(RY.TO)/a on Wednesday released interim 2030 targets to cut carbon emissions linked to some of its loans, yet drew criticism from environmental campaigners for not going ","publishedAt":"2022-10-26T15:44:00Z","content":"LONDON, Oct 26 (Reuters) - Royal Bank of Canada (RY.TO) on Wednesday released interim 2030 targets to cut carbon emissions linked to some of its loans, yet drew criticism from environmental campaigne "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Mexico City govt joins Airbnb to lure 'digital nomads', despite rising rent fears - Reuters Canada","description":"Mexico City's mayor said on Wednesday she wants to boost the number of 'digital nomads' in the capital after signing an agreement with short-term rental platform Airbnb, despite fears the influx is pricing residents out of the rental market.","publishedAt":"2022-10-27T01:36:00Z","content":"MEXICO CITY, Oct 26 (Reuters) - Mexico City's mayor said on Wednesday she wants to boost the number of 'digital nomads' in the capital after signing an agreement with short-term rental platform Airbn "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Trinidad gets to work on design of small LNG hub to feed the Caribbean - Reuters Canada","description":"Trinidad and Tobago's state-owned gas company has started work on designing a small-scale liquefied natural gas (LNG) hub that could help the Caribbean move away from oil-based power generation, the firm told Reuters.","publishedAt":"2022-10-27T15:54:00Z","content":"PORT OF SPAIN, Oct 27 (Reuters) - Trinidad and Tobago's state-owned gas company has started work on designing a small-scale liquefied natural gas (LNG) hub that could help the Caribbean move away fro "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Blockades affecting Colombia coal miner Cerrejon enter second week - Reuters Canada","description":"Blockades affecting a rail line used by Colombia's largest coal-miner Cerrejon to take coal to a key export facility on the Caribbean coast, and preventing mining supplies from reaching its operations, have stretched into a second week, the company said on We","publishedAt":"2022-11-16T17:55:00Z","content":"BOGOTA, Nov 16 (Reuters) - Blockades affecting a rail line used by Colombia's largest coal-miner Cerrejon to take coal to a key export facility on the Caribbean coast, and preventing mining supplies  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"No Davies as Canada face Japan in final World Cup tuneup - Reuters","description":"Canada will be without Alphonso Davies when they take on Japan in a final World Cup tuneup, coach John Herdman said on Wednesday, as they wait for a clean bill of health for the dynamic forward from his club Bayern Munich.","publishedAt":"2022-11-16T17:51:00Z","content":"DOHA, Nov 16 (Reuters) - Canada will be without Alphonso Davies when they take on Japan in a final World Cup tuneup, coach John Herdman said on Wednesday, as they wait for a clean bill of health for  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Panama judge calls two ex-presidents to trial in Odebrecht probe - Reuters Canada","description":"A Panama judge on Tuesday called two former presidents, as well as a slate of other high-profile figures, to trial over money-laundering related to the Odebrecht bribery probe, a sweeping corruption investigation that has rippled across Latin America.","publishedAt":"2022-11-09T00:11:00Z","content":"PANAMA CITY, Nov 8 (Reuters) - A Panama judge on Tuesday called two former presidents, as well as a slate of other high-profile figures, to trial over money-laundering related to the Odebrecht briber "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Mexico president eyes giving presidential jet to planned military-run airline - Reuters Canada","description":"Mexican President Andres Manuel Lopez Obrador on Friday proposed handing over the opulent presidential plane, which he inherited from his predecessors and failed to sell as promised, to a planned military-run airline, where it could be rented to workers.","publishedAt":"2022-11-11T18:07:00Z","content":"MEXICO CITY, Nov 11 (Reuters) - Mexican President Andres Manuel Lopez Obrador on Friday proposed handing over the opulent presidential plane, which he inherited from his predecessors and failed to se "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Trudeau spoke with China's Xi about 'interference', Ukraine - Canada govt source - Reuters.com","description":"Canada's Prime Minister Justin Trudeau spoke to Chinese President Xi Jinping on Tuesday for about 10 minutes on the sidelines of a G20 summit in Bali, Indonesia, a Canadian government source said.","publishedAt":"2022-11-15T15:01:00Z","content":"OTTAWA, Nov 15 (Reuters) - Canada's Prime Minister Justin Trudeau spoke to Chinese President Xi Jinping on Tuesday for about 10 minutes on the sidelines of a G20 summit in Bali, Indonesia, a Canadian "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canadian police charge man with terrorism over alleged plot to overthrow Haitian government - Reuters Canada","description":"Canadian police on Thursday announced terrorism charges against a Canadian resident who allegedly planned to overthrow the government of Haitian President Jovenel Moise, who was killed by a group of gunmen in 2021.","publishedAt":"2022-11-17T15:17:00Z","content":"OTTAWA, Nov 17 (Reuters) - Canadian police on Thursday announced terrorism charges against a Canadian resident who allegedly planned to overthrow the government of Haitian President Jovenel Moise, wh "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Brazil Federal Police raid FGV think-tank amid fraud, graft probe - Reuters Canada","description":"Brazil's Federal Police on Thursday carried out search warrants in the Rio de Janeiro headquarters of the Getulio Vargas Foundation (FGV) as part of a probe into alleged fraud, graft and money laundering in the globally respected think tank.","publishedAt":"2022-11-17T15:13:00Z","content":"RIO DE JANEIRO, Nov 17 (Reuters) - Brazil's Federal Police on Thursday carried out search warrants in the Rio de Janeiro headquarters of the Getulio Vargas Foundation (FGV) as part of a probe into al "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada's Lundin Mining to fill in giant mystery Chile sinkhole - Reuters Canada","description":"Canada's Lundin Mining is planning to fill in a giant mystery sinkhole near its copper mine in Chile, an ambitious plan that will also see it attempt to pump out water that has seeped into the mine, a senior company executive told Reuters on Thursday.","publishedAt":"2022-11-17T15:57:00Z","content":"SANTIAGO, Nov 17 (Reuters) - Canada's Lundin Mining is planning to fill in a giant mystery sinkhole near its copper mine in Chile, an ambitious plan that will also see it attempt to pump out water th "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Mexico authorizes U.S. seizure of drug lord Caro Quintero's property - Reuters Canada","description":"A Mexican court has authorized the United States to seize drug lord Rafael Caro Quintero's assets in Mexico, the U.S. Justice Department said in a statement on Thursday.","publishedAt":"2022-11-17T21:12:00Z","content":"MEXICO CITY, Nov 17 (Reuters) - A Mexican court has authorized the United States to seize drug lord Rafael Caro Quintero's assets in Mexico, the U.S. Justice Department said in a statement on Thursda "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"VIEW Canada cuts 2023 GDP forecast but says economy to avoid recession - Reuters.com","description":"Canadian Finance Minister Chrystia Freeland on Thursday unveiled an economic update, slashing 2023 real GDP forecast to 0.7, but said the economy would avoid a recession, while announcing C11.3 billion (8.2 billion) in new spending this fiscal year and nex","publishedAt":"2022-11-03T20:42:00Z","content":"TORONTO, Nov 3 (Reuters) - Canadian Finance Minister Chrystia Freeland on Thursday unveiled an economic update, slashing 2023 real GDP forecast to 0.7, but said the economy would avoid a recession,  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bolivian civic group threatens national strike as census protests escalate - Reuters Canada","description":"A leading civic group in Bolivia threatened to hold a national strike to pressure the government to carry out a census next year, a potential escalation of protests that have already brought the farm hub of Santa Cruz to a near standstill.","publishedAt":"2022-11-03T20:44:00Z","content":"LA PAZ, Nov 3 (Reuters) - A leading civic group in Bolivia threatened to hold a national strike to pressure the government to carry out a census next year, a potential escalation of protests that hav "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Enbridge greenlights C3.6 billion gas pipeline expansion in Canada - Reuters","description":"Canadian energy infrastructure firm Enbridge Inc a href=\"\" target=\"_blank\"(ENB.TO)/a on Friday announced a C3.6 billion (2.65 billion) expansion of the southern segment of its British Columbia (B.C.) gas pipeline ","publishedAt":"2022-11-04T15:23:00Z","content":"Nov 4 (Reuters) - Canadian energy infrastructure firm Enbridge Inc (ENB.TO) on Friday announced a C3.6 billion (2.65 billion) expansion of the southern segment of its British Columbia (B.C.) gas pi "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"EXCLUSIVE U.N. could administer over 3 bln in funds to aid Venezuela - Reuters Canada","description":"Top officials from the U.S. State and Treasury departments are discussing proposals for a fund that could release over 3 billion to provide humanitarian aid to Venezuelans through the United Nations, according to nine people close to the talks.","publishedAt":"2022-10-25T18:16:00Z","content":"WASHINGTON/CARACAS, Oct 25 (Reuters) - Top officials from the U.S. State and Treasury departments are discussing proposals for a fund that could release over 3 billion to provide humanitarian aid to "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"First plane repatriating Venezuelan migrants in Mexico departs for Caracas, sources say - Reuters Canada","description":"A first flight carrying Venezuelan migrants voluntarily returning to their homeland from Mexico departed on Tuesday, according to two Mexican officials.","publishedAt":"2022-10-26T13:52:00Z","content":"MEXICO CITY, Oct 25 (Reuters) - A first flight carrying Venezuelan migrants voluntarily returning to their homeland from Mexico departed on Tuesday, according to two Mexican officials.\r\nMexico is dea "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada cuts 2022/23 deficit forecasts, pledges targeted new spending - Reuters","description":"OTTAWA, Nov 3 (Reuters) - Canada set out on Thursday C11.3 billion (8.2 billion) in new spending this year and next, and slashed its budget deficit forecast by nearly a third for the current fiscal year, in an economic update it promised would not push up i","publishedAt":"2022-11-03T20:17:00Z","content":"OTTAWA, Nov 3 (Reuters) - Canada set out on Thursday C11.3 billion (8.2 billion) in new spending this year and next, and slashed its budget deficit forecast by nearly a third for the current fiscal "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bukele's anti-gang push in El Salvador hammers gangster graves - Reuters Canada","description":"Salvadoran prisoners collaborating with officials smashed gangster graves with hammers and metal poles in President Nayib Bukele's latest crackdown on violent gangs, this time aiming to prevent any would-be admirers from paying their respects.","publishedAt":"2022-11-02T20:13:00Z","content":"SAN SALVADOR, Nov 2 (Reuters) - Salvadoran prisoners collaborating with officials smashed gangster graves with hammers and metal poles in President Nayib Bukele's latest crackdown on violent gangs, t "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Mexico City investigating woman killed after taxi ride - attorney general - Reuters Canada","description":"The Mexico City attorney general's office said Thursday it opened an investigation into the apparent murder of a young woman found dead this week on a highway, a case that has fueled rage over rampant violence against women in Mexico.","publishedAt":"2022-11-04T03:15:00Z","content":"MEXICO CITY, Nov 3 (Reuters) - The Mexico City attorney general's office said Thursday it opened an investigation into the apparent murder of a young woman found dead this week on a highway, a case t "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Schools in Canadian province of Ontario to remain shut as strike grinds on - Reuters Canada","description":"Tens of thousands of striking teachers and education sector employees in the Canadian province of Ontario will be off the job again on Monday, the Canadian Union of Public Employees (CUPE) said on Sunday.","publishedAt":"2022-11-07T02:01:00Z","content":"Nov 6 (Reuters) - Tens of thousands of striking teachers and education sector employees in the Canadian province of Ontario will be off the job again on Monday, the Canadian Union of Public Employees "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"We are fit with nothing to lose, says Canada coach Herdman - Reuters","description":"Back in the World Cup for just the second time and the first time in 36 years, underdog Canada will head into their opener against second-ranked Belgium 100 fit and with nothing to lose, coach John Herdman said on Tuesday.","publishedAt":"2022-11-22T15:45:00Z","content":"AL RAYYAN, Qatar, Nov 22 (Reuters) - Back in the World Cup for just the second time and the first time in 36 years, underdog Canada will head into their opener against second-ranked Belgium 100 fit  "}]}