{"totalResults":964,"articles":[{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"UK house prices fall at fastest rate since early 2021 -Halifax - Reuters UK","description":"British house prices fell in October at the fastest monthly rate since February 2021, in a fresh sign of a weaker housing market, mortgage lender Halifax said on Monday.","publishedAt":"2022-11-07T07:01:15Z","content":"LONDON, Nov 7 (Reuters) - British house prices fell in October at the fastest monthly rate since February 2021, in a fresh sign of a weaker housing market, mortgage lender Halifax said on Monday.\r\nHo "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Canada home price index slides again in October -Teranet - Reuters.com","description":"Canadian home prices dropped in October from the previous month, though less sharply than in September, while year-over-year price gains continued to slow, TeranetNational Bank National Composite House Price data showed on Friday.","publishedAt":"2022-11-18T13:34:00Z","content":"OTTAWA, Nov 18 (Reuters) - Canadian home prices dropped in October from the previous month, though less sharply than in September, while year-over-year price gains continued to slow, TeranetNational  "},{"source":{"id":"","name":"The Guardian"},"author":"Hollie Richardson","title":"Wow, Samuel L Jackson is here  how Yorkshire became Marvels go-to location","description":"Why did the superhero franchise descend on the Dales What made Tom Cruise film Mission: Impossible nearby, and Shane Meadows follow suit We report from new screen star hotspot Halifax  now being renamed HaliwoodAt the start of this year, it wouldnt have b","publishedAt":"2022-11-16T17:14:12Z","content":"At the start of this year, it wouldnt have been unusual for the people of Halifax to bump into a Hollywood star on their way to work or while picking up a takeaway. You just kind of go, Wow, Samuel L "},{"source":{"id":"","name":"The Guardian"},"author":"Graeme Wearden","title":"UK house prices fall after mini-budget shock, but CEO pay soars  business live","description":"House prices drop at fastest monthly rate since February 2021, reports Halifax, as surging mortgage costs hit sectorPay restraint for thee, but not for me.Thats the mantra in UK boardrooms, it seems, after top bosses enjoyed another year of strong earnings g","publishedAt":"2022-11-07T07:31:56Z","content":"First-time buyers drive house price slowdown\r\nProperty price inflation weakened across all buyer types during October, led by first-time buyers.\r\nPeople taking their first step on the housing ladder  "},{"source":{"id":"","name":"VOCM"},"author":"Allison King","title":"Hundreds Gather for Remembrance Day Ceremony in St. John's - VOCM","description":"olliHundreds Gather for Remembrance Day Ceremony in St. John'sVOCM\r\n/liliRemembrance Day ceremony draws hundreds to Grand Parade in HalifaxCBC.ca\r\n/liliPhotos: Nov. 11 ceremony attracts hundreds to Memorial ParkSudbury.com\r\n/liliOrillia ","publishedAt":"2022-11-11T16:05:00Z","content":"The annual Remembrance Day ceremony in downtown St. Johns returned to its full program this year after two years of COVID-19 restrictions.\r\nA cold and damp morning in the capital city did not stop hu "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"Victoria Remembrance Day ceremony interrupted for arrest  CTV News - CTV News VI","description":"olliVictoria Remembrance Day ceremony interrupted for arrest  CTV NewsCTV News VI\r\n/liliRemembrance Day returns to the Gardens (24 photos, video)SooToday\r\n/liliHundreds Gather for Remembrance Day Ceremony in St. John'sVOCM\r\n/liliPhotos:","publishedAt":"2022-11-12T00:21:00Z","content":"Police in B.C.'s capital arrested a man who briefly interrupted the Remembrance Day service at the provincial legislature Friday morning.\r\nVideo of the incident shows the man yelling and walking thro "},{"source":{"id":"cbc-news","name":"CBC News"},"author":"","title":"Respiratory illness 'wave potentially coming our way,' says Health P.E.I. - CBC.ca","description":"olliRespiratory illness 'wave potentially coming our way,' says Health P.E.I.CBC.ca\r\n/liliLocal emergency room visits for flu-like illnesses doubleBayToday.ca\r\n/liliRespiratory illnesses among N.S. children at 'historic' levels: Halifax doctor","publishedAt":"2022-11-18T10:00:00Z","content":"As a rise inrespiratory illnesses among youngpeople overwhelms hospitalsin someother parts of the country, Health P.E.I. says it's starting to see signs of that trend here. \r\nWhile overall visit "},{"source":{"id":"","name":"The Guardian"},"author":"Kalyeena Makortoff Banking correspondent","title":"Lloyds bank profits plunge by 25 as lender prepares for bad loans","description":"Larger-than-forecast drop to 1.5bn in third quarter came despite rising interest ratesProfits at Lloyds Banking Group dropped by more than 25 in the three months to September, as the UKs deteriorating economic outlook forced it to put aside nearly 670m ","publishedAt":"2022-10-27T07:01:31Z","content":"Profits at Lloyds Banking Group dropped by 26 in the three months to September, as the UKs deteriorating economic outlook forced it to put aside nearly 670m to protect against potential defaults on "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Wrexham ban player from wearing boots with political message - Reuters","description":"Wrexham have barred a player from wearing boots displaying an abusive message about Britain's governing Conservative Party, the fifth-tier National League club said in a a href=\"\" tar","publishedAt":"2022-10-26T07:33:00Z","content":"Oct 25 (Reuters) - Wrexham have barred a player from wearing boots displaying an abusive message about Britain's governing Conservative Party, the fifth-tier National League club said in a statement  "},{"source":{"id":"","name":"The New Yorker"},"author":"","title":"Serenity Amid Disaster in The Flying Sailor","description":"Khiara Ortiz writes about The Flying Sailor, an animated short by Amanda Forbis and Wendy Tilbythat  imagine what happened to a middle-aged man who survived a devastating explosion in Halifax. Nova Scotia, in 1917.","publishedAt":"2022-11-18T19:22:06Z","content":"On the morning of December 6, 1917, the citizens of Halifax, Nova Scotia, witnessed the largest and most destructive man-made explosion the world had seen to that day. The S.S. Imo, a Norwegian vesse "},{"source":{"id":"","name":"CP24 Toronto's Breaking News"},"author":"Kerrisa Wilson","title":"Lettuce shortage impacting Toronto restaurants - CP24","description":"olliLettuce shortage impacting Toronto restaurantsCP24\r\n/liliLettuce prices in Canada: Why are they so high  CTV NewsCTV News Vancouver\r\n/liliLETTER: Lettuce shortage 'a harbinger of things to come'OrilliaMatters\r\n/liliSome Nova Scotia","publishedAt":"2022-11-17T23:04:23Z","content":"Attention: Due to a shortage of lettuce. There is no lettuce in our sandwiches today.\r\nThats the sign customers encountered when they went to grab a bite at long-standing bakery SanRemo in Etobicoke  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Casey Kirwan captures eNASCAR season championship - Reuters","description":"Hometown favorite Casey Kirwan, competing in the playoffs for the first time, raced to the eNASCAR Coca-Cola iRacing Series championship on Tuesday.","publishedAt":"2022-10-26T04:44:16Z","content":"October 26 - Hometown favorite Casey Kirwan, competing in the playoffs for the first time, raced to the eNASCAR Coca-Cola iRacing Series championship on Tuesday.\r\nFor the series' 2022 finale, the fin "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Markets defy COVID blues - Reuters","description":"A look at the day ahead in European and global markets from Anshuman Daga","publishedAt":"2022-11-07T06:02:00Z","content":"A look at the day ahead in European and global markets from Anshuman Daga\r\nChina is retaining its strict coronavirus curbs, COVID-19 cases are at a 6-month high and Apple warned of a hit to iPhone sh "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"A nation of immigrants: Newcomers' share of Canadian population hits record - Reuters","description":"Immigrants' share of Canada's population has hit its highest point in the country's 150-year history and the biggest share among G7 countries, new data released by Statistics Canada showed on Wednesday.","publishedAt":"2022-10-26T17:43:00Z","content":"TORONTO, Oct 26 (Reuters) - Immigrants' share of Canada's population has hit its highest point in the country's 150-year history and the biggest share among G7 countries, new data released by Statist "},{"source":{"id":"","name":"The Guardian"},"author":"Aaron Bower","title":"It left me in awe: my hands-on initiation to wheelchair rugby league  Aaron Bower","description":"The Guardians rugby league writer enjoys/suffers a training session as England prepare for their World Cup campaignYoure going to enjoy this, Wayne Boardman, a long-serving member of Englands wheelchair side, tells me as I arrive at Calderdale College in","publishedAt":"2022-11-02T17:15:20Z","content":"Youre going to enjoy this, Wayne Boardman, a long-serving member of Englands wheelchair side, tells me as I arrive at Calderdale College in Halifax. Boardmans smile somewhat subtly implies it will be "},{"source":{"id":"","name":"CP24 Toronto's Breaking News"},"author":"Adina Bresge and Laura Osman","title":"Trudeau joins families of Flight 752 in Canada-wide protests against Iranian regime - CP24","description":"olliTrudeau joins families of Flight 752 in Canada-wide protests against Iranian regimeCP24\r\n/liliWe will stand with you: Trudeau joins Ottawa demonstration against Iranian regime  FULLGlobal News\r\n/liliCanadian demonstrators form 'human ch","publishedAt":"2022-10-29T22:01:27Z","content":"Prime Minister Justin Trudeau stood with the families of the victims of Ukraine International Airlines Flight 752 on Saturday as they lent their voices to the worldwide calls for revolution in Iran t "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Sterling rises but gloomy economic outlook remains in focus - Reuters","description":"Sterling rose on Monday, largely boosted by a softer dollar, which pushed the pound back up to levels seen before the Bank of England (BoE) delivered its biggest interest rate hike in three decades last week.","publishedAt":"2022-11-07T10:32:00Z","content":"LONDON, Nov 7 (Reuters) - Sterling rose on Monday, largely boosted by a softer dollar, which pushed the pound back up to levels seen before the Bank of England (BoE) delivered its biggest interest ra "},{"source":{"id":"","name":"The Guardian"},"author":"Anna Tims","title":"Financial firms accused of adding to pain of vulnerable customers","description":"People dealing with critical illness or bereavement say poor customer service at insurers and banks often puts them through a new ordealThe diagnosis came out of the blue. James Lloyd is 41 and had not had to visit a GP in five years. In May he was told that","publishedAt":"2022-11-14T09:00:35Z","content":"The diagnosis came out of the blue. James Lloyd is 41 and had not had to visit a GP in five years. In May he was told that he had stage 4 bowel cancer. The treatment and surgery have prevented him w "},{"source":{"id":"","name":"The Guardian"},"author":"Julia Kollewe","title":"Shell profits more than double to 9.5bn; European Central Bank to hike interest rates  business live","description":"Oil and gas giant beats expectations, as ECB expected to raise rates by 75 basis points to 2Good morning, and welcome to our rolling coverage of business, the world economy and the financial markets.Shell has beaten expectations with a profit of 9.5bn (8.1","publishedAt":"2022-10-27T06:42:41Z","content":"Shell, Europes largest energy company, has raked in more than 30bn in profits in the first nine months, which could revive calls for a further windfall tax.\r\nRishi Sunak introduced a 25 energy prof "},{"source":{"id":"","name":"Boing Boing"},"author":"Mark Frauenfelder","title":"Illustrator discovers her art was used to train an AI art generator","description":"Los Angeles artist and character designer Hollie Mengert found out that someone used her online portfolio to train an AI text-to-art model. The AI art looks a lot like Mengert's work, at least at a first glance. Andy Baio has a great article about it.  Read ","publishedAt":"2022-11-03T17:52:43Z","content":"Los Angeles artist and character designer Hollie Mengert found out that someone used her online portfolio to train an AI text-to-art model. The AI art looks a lot like Mengert's work, at least at a f "},{"source":{"id":"politico","name":"Politico"},"author":"Alexander Ward","title":"Zelenskyy rejects Russias desire for short truce in Halifax address","description":"The Ukrainian leaders message was unmistakable: Peace only on Ukraines terms, not Russias.","publishedAt":"2022-11-18T21:21:47Z","content":"Immoral compromises will only lead to new blood, he continued, adding that an honest peace can only be achieved by the complete demolition of Russian aggression.\r\nIts unclear how formally Russia made "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"SMU student dies from suspected meningococcal meningitis - CTV News Atlantic","description":"olliSMU student dies from suspected meningococcal meningitisCTV News Atlantic\r\n/liliPublic Health investigating fatal suspected meningitis caseCBC.ca\r\n/liliNova Scotia Health suspects meningococcal disease in death of Saint Mary's University s","publishedAt":"2022-11-09T16:12:00Z","content":"Health officials in Nova Scotia are investigating a suspected case of meningococcal meningitis after the death of a Halifax university student.\r\nIn a news release, Nova Scotia Health says the case is "},{"source":{"id":"politico","name":"Politico"},"author":"Nahal Toosi","title":"Iranian diasporas divisions burst into open during Halifax forum","description":"Many agree the Islamist regime in Tehran has to go. But they often disagree on tactics and question others motives.","publishedAt":"2022-11-19T18:25:34Z","content":"During a morning panel discussion, Nazanin Afshin-Jam MacKay, a prominent Iranian-Canadian activist, called on the international community to stop their trade ties, stop their diplomatic ties and exp "},{"source":{"id":"","name":"Global News"},"author":"Alex Cooke","title":"N.S. public health reports student death from suspected meningococcal disease - Global News","description":"olliN.S. public health reports student death from suspected meningococcal diseaseGlobal News\r\n/liliPublic Health investigating fatal suspected meningitis caseCBC.ca\r\n/liliNova Scotia Health suspects meningococcal disease in death of Saint Mary","publishedAt":"2022-11-09T16:28:55Z","content":"Nova Scotia public health is investigating after a university student recently died of a suspected case of meningococcal meningitis in the provinces western health zone.\r\nIn a release, Nova Scotia H "},{"source":{"id":"","name":"Ctvnews.ca"},"author":"","title":"Drug shortages in Canada worsen beyond kids' meds - CTV News","description":"olliDrug shortages in Canada worsen beyond kids' medsCTV News\r\n/liliHealth Canada secures 'foreign supply' of kids' pain and fever medsCBC News\r\n/liliHealth Canada importing more kids' pain and fever meds to restock store shelvesCP24\r\n/li","publishedAt":"2022-11-15T20:47:00Z","content":"HALIFAX - \r\nDrugstore shortages in Canada are now extending beyond the children's pain and fever medication aisle into other over-the-counter and prescription drugs as supply problems worsen across t "},{"source":{"id":"","name":"The Guardian"},"author":"Barry Glendenning","title":"Wrexham striker who put boot in to Tories may have scored a costly own goal","description":"A share of 18m in government funding may have influenced clubs reaction to Paul Mullins anti-Conservative messageConsidering Paul Mullin has scored 11 of the goals that have helped propel Wrexham to second in the National League, a division from which they","publishedAt":"2022-10-29T07:00:52Z","content":"Considering Paul Mullin has scored 11 of the goals that have helped propel Wrexham to second in the National League, a division from which they are desperate to win promotion, one might be forgiven f "},{"source":{"id":"politico","name":"Politico"},"author":"Andrew Desiderio and Connor OBrien","title":"U.S. lawmakers to foreign allies: Midterm results show our democracy is safe","description":"Members of a bipartisan delegation at the Halifax International Security Forum highlighted the resounding defeat of candidates who backed Donald Trumps efforts to overturn the 2020 election.","publishedAt":"2022-11-20T16:03:58Z","content":"It wasnt just Democratic candidates who were victorious after taking a stand against those who falsely assert that Trump won in 2020. Georgia Secretary of State Brad Raffensperger, a Republican who p "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"UK banks start cutting 'Truss premium' from mortgage rates, but slowly - Reuters UK","description":"Having hiked mortgage rates after political turmoil drove up the cost of borrowing, British banks are now cutting home loan prices, albeit slowly, as markets calm since Liz Truss's government collapsed and Rishi Sunak took power.","publishedAt":"2022-10-27T13:51:00Z","content":"LONDON, Oct 27 (Reuters) - Having hiked mortgage rates after political turmoil drove up the cost of borrowing, British banks are now cutting home loan prices, albeit slowly, as markets calm since Liz "},{"source":{"id":"","name":"The Guardian"},"author":"Aina J Khan Community affairs correspondent","title":"Uncovering Britains secret history of bussing ethnic minority children","description":"Shabina Aslam was sent away to a remote school under a policy of dispersing non-white children in the 1960s and 1970s, which she now explores in a Bradford-based exhibitionShabina Aslam was a seven-year-old in Bradford when she was placed on a bus and moved o","publishedAt":"2022-10-28T05:00:21Z","content":"Shabina Aslam was a seven-year-old in Bradford when she was placed on a bus and moved out to a white-majority suburban school, where she and her brother were placed in the special needs department.\r\n "},{"source":{"id":"","name":"The Guardian"},"author":"Simon Jenkins","title":"MS is a shining example of how not to treat the high street  or the planet  Simon Jenkins","description":"The retailer wants to knock down and rebuild its flagship store, or leave. It should do the latter, and let small shops thriveAn inquiry opened this week in Westminster that should be revolutionary. It is to decide, in a nutshell, whether the 50 of global ca","publishedAt":"2022-10-28T06:00:20Z","content":"An inquiry opened this week in Westminster that should be revolutionary. It is to decide, in a nutshell, whether the 50 of global carbon emissions embodied in the worlds built environment should be  "},{"source":{"id":"","name":"The Guardian"},"author":"Tom Ambrose, Guardian staff and agencies","title":"Russia-Ukraine war at a glance: what we know on day 269 of the invasion","description":"Kyiv could face complete shutdown of power amid crippled Ukrainian grid; hundreds of Ukrainians disappeared in Kherson, say war crime researchers ulliSee all our Ukraine coverage/li/ulRussian missile strikes have crippled almost half of Ukraines en","publishedAt":"2022-11-19T01:55:45Z","content":"liRussian missile strikes have crippled almost half of Ukraines energy system, the government in Kyiv has said, as authorities warned that the city could face a complete shutdown of the power grid  "},{"source":{"id":"politico","name":"Politico"},"author":"Alexander Ward","title":"Top Ukrainian aide says Russia didnt ask for a short truce,' clarifying Zelenskyy remark","description":"Andriy Yermak also said a military campaign for Crimea will happen, but wouldnt say when.","publishedAt":"2022-11-19T16:23:04Z","content":"We have not [had] any official application from the Russian side about some conversations, some negotiations, Andriy Yermak said.  Efrem Lukatsky/AP Photo\r\nHalifax, Nova Scotia Russia has not direct "},{"source":{"id":"","name":"Global News"},"author":"The Canadian Press","title":"Bank of Canada expected to announce another interest rate hike amid recession fears - Global News","description":"olliBank of Canada expected to announce another interest rate hike amid recession fearsGlobal News\r\n/liliThe state of Canada's economy and whether a recession is a 'necessary evil'CBC.ca\r\n/liliBank of Canada to announce interest rate hikeCP2","publishedAt":"2022-10-24T11:44:22Z","content":"Even as warnings about a potential recession grow louder, the Bank of Canada is expected to announce another hefty interest rate hike on Wednesday, edging the bank closer to the end of one of the fas "},{"source":{"id":"","name":"The Guardian"},"author":"Rob Davies","title":"Sheikh who secured World Cup for Qatar has UK links going back decades","description":"Hamad bin Jassim bin Jaber al-Thanis success is built on a remarkable network of political and business connectionsHe has the clout to summon Tony Blair to Claridges for late-night business negotiations, helped engineer the downfall of the Libyan despot Mua","publishedAt":"2022-11-15T16:12:02Z","content":"He has the clout to summon Tony Blair to Claridges for late-night business negotiations, helped engineer the downfall of the Libyan despot Muammar Gaddafi and orchestrated his tiny desert countrys su "},{"source":{"id":"","name":"The Guardian"},"author":"Julia Kollewe and Mabel Banfield-Nwachi","title":"What is happening to the UK homebuying and rental markets","description":"House prices for buyers have started to fall, while housing rents have reached record highsFor Joe, a youth worker in his 20s, soaring rents have made living and working in London precarious.Our rent costs 50 of our combined wage before bills, says Joe, wh","publishedAt":"2022-11-14T16:51:25Z","content":"For Joe, a youth worker in his 20s, soaring rents have made living and working in London precarious.\r\nOur rent costs 50 of our combined wage before bills, says Joe, who shares with his partner, a re "},{"source":{"id":"cbc-news","name":"CBC News"},"author":"","title":"Sheila Heti wins 25K Governor General's Literary Award for fiction - CBC.ca","description":"olliSheila Heti wins 25K Governor General's Literary Award for fictionCBC.ca\r\n/liliSheila Heti wins 25000 Governor-General's fiction prize for Pure ColourThe Globe and Mail\r\n/liliView Full Coverage on Google News/li/ol","publishedAt":"2022-11-16T17:29:38Z","content":"Sheila Heti has won the Governor General's Literary Award for fiction for her novel Pure Colour.\r\nThe Governor General's Literary Awards are among Canada's oldest and most prestigious prizes for lite "},{"source":{"id":"","name":"Scalzi.com"},"author":"John Scalzi","title":"Welcome to Halifax","description":"When the folks at Hal-Con asked if I would come visit their convention, I said I would if they supplied me with Coke Zero, Tiger Tail ice cream, and a framed picture of either Halifaxs own Sarah McLachlan, or, if one were not available, at least one member o","publishedAt":"2022-10-27T19:47:32Z","content":"Posted onOctober 27, 2022\r\n\r\nPosted byJohn Scalzi\r\n \r\nLeave a Comment\r\nWhen the folks at Hal-Con asked if I would come visit their convention, I said I would if they supplied me with Coke Zero,  "},{"source":{"id":"","name":"The Guardian"},"author":"Gavin Willacy","title":"Hotels, robbers and graphic art: life in camp at the Rugby League World Cup","description":"Living away for a month is not as glamorous as it sounds  especially if you gave up your day job but arent playingBy Gavin Willacy for No Helmets RequiredGuests exiting the lifts on the first floor of a rather smart hotel in Liverpool city centre last week ","publishedAt":"2022-11-09T14:00:29Z","content":"Guests exiting the lifts on the first floor of a rather smart hotel in Liverpool city centre last week would have got a shock if they turned left in search of the breakfast room rather than right. Th "},{"source":{"id":"","name":"Scalzi.com"},"author":"John Scalzi","title":"Hello From Halifax, Day 2","description":"They have a clock tower Theyre proud of it, I understand. Lovely day here in the Maritimes, and met lots of fab people at Hal-Con. Now off to dinner with friends. How was your Friday 821","publishedAt":"2022-10-28T21:39:40Z","content":"What's the Big Idea Authors explaining the the big ideas behind their latest works, in their own words. See the latest Big Ideas\r\nAuthors/Editors/Publicists: for information on how to participate,  "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Listen: Non-league commentaries","description":"Listen to BBC radio commentary from the National League, National League North  National League South.","publishedAt":"2022-10-30T14:10:53Z","content":"National League\r\nBarnet v Southend United - BBC Radio Essex \r\nEastleigh v Scunthorpe United - BBC Radio Humberside\r\nFC Halifax Town v Dorking Wanderers - BBC Radio Surrey\r\nMaidstone United v Solihull "},{"source":{"id":"","name":"Visual.ly"},"author":"halifaxauctiondirect","title":"Halifax used cars","description":"Halifax Auction Direct Lower Sackville Used Cars in Lower Sackville has New and Used Used Cars and SUVs for sale. Call (888) 479-9185 for Lower Sackvi","publishedAt":"2022-11-10T05:27:12Z","content":"AUCTION DIRECT AUCTION DIRECT DONT DREAM IT , DRIVE IT  115 SACKVILLE DRIVE LOWER SACKVILLE , NS B4C 2R3 CANADA FIND YOUR DREAM CAR f 902-252-1115 "},{"source":{"id":"","name":"Telegraph.co.uk"},"author":"Melissa Lawford, Rachel Mortimer","title":"High street banks cut mortgage rates amid Andrew Baileys demand for action","description":"Halifax and Virgin Money among first lenders to make reductions","publishedAt":"2022-11-04T13:46:23Z","content":"Halifax, one of the biggest lenders in the country, confirmed it would reduce several remortgage rates by up to 0.24 percentage points from next week. The reduction has pushed some rates with the len "},{"source":{"id":"","name":"The Guardian"},"author":"Jasper Jolly","title":"UK house prices fall after significant shock of mini-budget","description":"Halifax reports steepest monthly drop since February 2021 amid interest rate risesUK house prices fell by 0.4 in October after Liz Trusss mini-budget drove a sudden rise in mortgage rates, the lender Halifax said.The decline in the average price to 292,598","publishedAt":"2022-11-07T09:53:57Z","content":"UK house prices fell by 0.4 in October after Liz Trusss mini-budget drove a sudden rise in mortgage rates, the lender Halifax said.\r\nThe decline in the average price to 292,598 was the third in the "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Listen: Non-league commentaries","description":"Listen to BBC radio commentary from the National League, National League North  National League North","publishedAt":"2022-11-11T15:05:30Z","content":"National League\r\nAldershot Town v Maidenhead United - BBC Radio Surrey\r\nBromley v Halifax Town - BBC Radio Kent\r\nBoreham Wood v Woking - BBC Radio Surrey\r\nEastleigh v Notts County - BBC Radio Solent\r "},{"source":{"id":"politico","name":"Politico"},"author":"Paul McLeary and Alexander Ward","title":"Russias invasion of Ukraine could start a race for nukes, SecDef says","description":"Defense Secretary Lloyd Austin painted a bleak picture for the world, alluding to a scenario in which autocrats will race to acquire the bomb if Russia isn't repelled.","publishedAt":"2022-11-19T19:44:10Z","content":"They could well conclude that getting nuclear weapons would give them a hunting license of their own. And that could drive a dangerous spiral of nuclear proliferation, the secretary said at the Halif "},{"source":{"id":"","name":"Sky Sports"},"author":"","title":"FA Cup round-up: Alvechurch and Chippenham beat L1 sides","description":"Danny Waldron was the two-goal hero as seventh-tier Alvechurch pulled off an FA Cup first-round giant-killing by triumphing 2-1 at League One Cheltenham.","publishedAt":"2022-11-05T18:25:00Z","content":"Danny Waldron was the two-goal hero as seventh-tier Alvechurch pulled off an FA Cup first-round giant-killing by triumphing 2-1 at League One Cheltenham.\r\nThe Southern League Premier Central outfit,  "},{"source":{"id":"cbc-news","name":"CBC News"},"author":"Murray Brewster","title":"Refugees and a student abroad serve up tears, humanity and grace at Halifax security forum","description":"At a security conference where top diplomats, soldiers, academics and journalists discussed the world's many geopolitical crises, some of the most profound encounters occurred between the participants and wait staff  many of whom are originally from Iran or ","publishedAt":"2022-11-21T20:56:40Z","content":"It's not every day you get to meet someone who inspires you.\r\nFor Sahar Gholizadah a 19-year-old visiting Iranian student in Halifax that day was Saturday, when she gavea tearful hug to Iranian jour "},{"source":{"id":"cbc-news","name":"CBC News"},"author":"Murray Brewster","title":"U.S. midterms won't weaken Washington's support for Ukraine, conference told","description":"A major international security conference started Friday in Halifax with repeated reassurances that the results of the U.S. midterm elections won't mean a major shift in U.S. support for Ukraine.","publishedAt":"2022-11-19T00:39:16Z","content":"A major international security conference started Friday in Halifax with repeated reassurances that the results of the U.S. midterm elections won't mean a major shift in U.S. support for Ukraine.\r\nU. "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Halifax: Bonfire Night death streets like 'horror movie'","description":"A 17-year-old boy dies in an area of Halifax hit by anti-social behaviour on Bonfire Night.","publishedAt":"2022-11-07T15:50:43Z","content":"People living near a house where a teenager was fatally injured on Bonfire Night said the area was like a \"horror movie\" at this time of year. \r\nThe 17-year-old boy, named locally as Qais Muhammad Ra "},{"source":{"id":"","name":"Pitchfork"},"author":"Eric Torres","title":"Shania Twain Announces New Album Queen of Me and 2023 Tour","description":"The follow-up to 2017s Now includes the new single Last Day of Summer","publishedAt":"2022-10-28T16:02:40Z","content":"Shania Twain has announced a new album: Queen of Me arrives February 3, 2023, via Republic Nashville. The country singer has also shared a new single, Last Day of Summer. To coincide with the release "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Meet the England players chasing World Cup glory","description":"From the godfather of the sport to the class clown, meet the players hoping to lead England to Wheelchair Rugby League World Cup glory.","publishedAt":"2022-11-17T12:25:37Z","content":"The England players and backroom staff celebrate reaching the World Cup final\r\ntabletrthWheelchair Rugby League World Cup 2021 Final - England v France/th/tr\r\ntrtdVenue: Manchester Cent "},{"source":{"id":"","name":"The Points Guy"},"author":"Gene Sloan","title":"A major new cruise ship coming to New York will offer sailings from just 66 a day","description":"Cruise giant Carnival this week unveiled pricing for the new ship it plans to base in New York, and  compared to the cost of a hotel in the city, at least  its quite the bargain. Fares for the 4,208-passenger Carnival Venezia will start at just 394 per pe","publishedAt":"2022-11-16T14:30:36Z","content":"Cruise giant Carnival this week unveiled pricing for the new ship it plans to base in New York, and compared to the cost of a hotel in the city, at least it's quite the bargain.\r\nFares for the 4,208- "},{"source":{"id":"","name":"Daily Mail"},"author":"Helena Kelly","title":"Urban house prices soar as buyers return to cities after fleeing for the countryside during pandemic","description":"Figures from mortgage lender Halifax show property prices in major cities have grown 9.2 per cent on average since the beginning of the year.","publishedAt":"2022-10-23T23:05:16Z","content":"Urban house prices are outstripping those in rural areas again as buyers return to cities after the pandemic, latest data suggests.\r\nFigures from mortgage lender Halifax show property prices in majo "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Newsfile Corp.","title":"E-Tech Resources: Reverse Circulation Drilling Results Further Extends Rare Earths Footprint at Eureka - Yahoo Finance","description":"Halifax, Nova Scotia--(Newsfile Corp. - October 26, 2022) - E-Tech Resources Inc. (TSXV: REE) (\"E-Tech\" or the \"Corporation\") is pleased to announce new...","publishedAt":"2022-10-26T12:32:00Z","content":"Halifax, Nova Scotia--(Newsfile Corp. - October 26, 2022) - E-Tech Resources Inc. (TSXV: REE)(\"E-Tech\" or the \"Corporation\") is pleased to announce new assay results from its most recent Reverse Cir "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"England beat Spain to move closer to last four","description":"Rob Hawkins scores five tries as England beat Spain 104-12 to move closer to a Wheelchair Rugby League World Cup semi-final.","publishedAt":"2022-11-06T14:10:14Z","content":"Jack Brown gets a tackle in on Spain's Yannick Martin\r\ntabletrthWheelchair Rugby League World Cup 2021/th/tr\r\ntrtdEngland (50) 104/td/trtrtdTries: Brown 2, Simpson, Boardman 2,  "},{"source":{"id":"independent","name":"Independent"},"author":"Vicky Shaw","title":"Average UK house price fell by 0.4 in October  Halifax","description":"The drop is the sharpest Halifax has seen since February 2021.","publishedAt":"2022-11-07T07:54:46Z","content":"For free real time breaking news alerts sent straight to your inbox sign up to our breaking news emails\r\nSign up to our free breaking news emails\r\nHouse prices recorded the biggest monthly fall in Oc "},{"source":{"id":"associated-press","name":"Associated Press"},"author":"Josh Boak","title":"Rural areas to get 759M in grants for high-speed internet - The Associated Press","description":"olliRural areas to get 759M in grants for high-speed internetThe Associated Press\r\n/liliBiden-Harris Administration Provides 759 Million to Bring High-Speed Internet Access to Communities Across Rural AmericaUSDA.gov\r\n/liliHalifax-Warren int","publishedAt":"2022-10-27T09:18:13Z","content":"RALEIGH, N.C. (AP) The Agriculture Department announced Thursday it is making available 759 million in grants and loans to enable rural communities to access high-speed internet, part of the broader "},{"source":{"id":"rt","name":"RT"},"author":"RT","title":"UK property market plunging  mortgage lender","description":"Britains housing market received a significant shock as a result of the mini-budget plan by former premier Liz Truss, lender Halifax says Read Full Article at RT.com","publishedAt":"2022-11-07T15:45:21Z","content":"British house prices fell in October at the fastest monthly rate since February 2021, a fresh sign of weakness in the real estate market that reflects the fallout from the former governments economi "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"PR Newswire","title":"Halifax Health Selects BPAS for Retirement Plan Services","description":"BPAS, a leading national provider of retirement plans, benefit plans, fund administration, and collective investment trusts announced today that it has been ...","publishedAt":"2022-11-01T21:50:00Z","content":"UTICA, N.Y., Nov. 1, 2022 /PRNewswire/ --BPAS, a leading national provider of retirement plans, benefit plans, fund administration, and collective investment trusts announced today that it has been  "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"CNW Group","title":"Conducting life-changing arthritis research from coast to coast.","description":"Arthritis Research Canada continues to expand with a new centre at Dalhousie University in Halifax, Nova Scotia.","publishedAt":"2022-10-27T14:13:00Z","content":"VANCOUVER, BC, Oct. 27, 2022 /CNW/ - Arthritis Research Canada continues to expand with a new centre at Dalhousie University in Halifax, Nova Scotia.\r\nWith this announcement, Arthritis Research Canad "},{"source":{"id":"cbc-news","name":"CBC News"},"author":"Karen Pauls","title":"The risks and rewards of hosting the world junior tournament amid Hockey Canada scandal","description":"Despite numerous sponsors pulling out, community leaders in Halifax and Moncton, N.B., expect to generate economic benefit from hosting the world junior men's hockey championship next month  and maybe even help Hockey Canada turn the page on a scandal that h","publishedAt":"2022-11-13T09:00:42Z","content":"Despite numerous sponsors pulling out, community leaders in Halifax and Moncton, N.B., expect to generate economic benefit from theworld junior men's hockey championship next month and maybe help Ho "},{"source":{"id":"","name":"Nature.com"},"author":"Elizabeth Gibney","title":"How many yottabytes in a quettabyte Extreme numbers get new names","description":"Prolific generation of data drove the need for prefixes that denote 1027 and 1030.","publishedAt":"2022-11-18T00:00:00Z","content":"The vast amount of data created annually has led to the need for new words to describe huge numbers.Credit: Getty\r\nBy the 2030s, the world will generate around a yottabyte of data per year thats 1024 "},{"source":{"id":"","name":"Nature.com"},"author":"Elizabeth Gibney","title":"The leap seconds time is up: world votes to stop pausing clocks","description":"How, and whether, to keep atomic time in sync with Earth's rotation is still up for debate.","publishedAt":"2022-11-18T00:00:00Z","content":"From 2035, no extra seconds will be added to bring clocks in sync with astronomical time.Credit: Adam Smigielski/Getty\r\nThe practice of adding leap seconds to official clocks to keep them in sync wit "},{"source":{"id":"","name":"The Guardian"},"author":"Rob Davies and Joseph Smith","title":"Revealed: UK local councils deposit taxpayers cash in Qatar state bank","description":"Town halls and finance firms say they support LGBT rights but send money to World Cup host where homosexuality is illegalThe rainbow flag flew above the Bourne Corn Exchange as South Kesteven council embraced LGBT history month.A year after voting against suc","publishedAt":"2022-11-12T11:00:39Z","content":"The rainbow flag flew above the Bourne Corn Exchange as South Kesteven council embraced LGBT history month.\r\nA year after voting against such a gesture the Lincolnshire local authority declared itsel "},{"source":{"id":"","name":"Wallpaper"},"author":"Ellie Stathaki","title":"This boxy house on the shores of Canada celebrates its site and makers","description":"The Sandbox by Halifax-based Peter Braithwaite Studio, a boxy house in Canadas New Brunswick, celebrates its site and makers","publishedAt":"2022-11-03T06:00:16Z","content":"Receive our daily digest of inspiration, escapism and design stories from around the world direct to your inbox\r\nThank you for signing up to . You will receive a verification email shortly.\r\nThere wa "},{"source":{"id":"","name":"The Atlantic"},"author":"Eliot A. Cohen","title":"Stop Talking About Talking","description":"Calls for a negotiated end of Russias war with Ukraine are a dangerous form of baloney realism.","urlToImage":"","publishedAt":"2022-11-21T16:08:52Z","content":"In recent weeks, General Mark Milley, the chairman of the Joint Chiefs of Staff, created alarm among Ukraines friends by suggesting in several forums that Ukraine has fought Russian forces to a sta "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"PR Newswire","title":"InventHelp Inventor Develops Accessory to Conceal a Cat Litter Box (BEC 182)","description":"\"I wanted to create a decorative accessory to conceal a litter box and help contain litter messes,\" said an inventor, from Halifax, Mass., \"so I invented the...","publishedAt":"2022-11-09T16:00:00Z","content":"PITTSBURGH, Nov. 9, 2022 /PRNewswire/ -- \"I wanted to create a decorative accessory to conceal a litter box and help contain litter messes,\" said an inventor, from Halifax, Mass., \"so I invented the  "},{"source":{"id":"","name":"Pitchfork"},"author":"Jesse Locke","title":"Sloan: Steady","description":"Read Jesse Lockes review of the album.","publishedAt":"2022-10-25T04:01:00Z","content":"Since signing to Geffen at the apex of the grunge explosion, Sloan have succeeded at writing timeless songs that dont sound hysterically 1993 twenty years later. Theyve occasionally tweaked the formu "},{"source":{"id":"","name":"The Guardian"},"author":"Julia Kollewe","title":"Persimmon reports sales and price fall as UK property market dips","description":"Housebuilder says cancellation rate has risen sharply because of interest rates and economic uncertaintySales and prices of new-build houses have fallen and cancellation rates have risen in recent weeks at Persimmon, in further evidence the property market is","publishedAt":"2022-11-08T09:48:00Z","content":"Sales and prices of new-build houses have fallen and cancellation rates have risen in recent weeks at Persimmon, in further evidence the property market is entering a downturn.\r\nThe company, one of B "},{"source":{"id":"","name":"Sun Sentinel"},"author":"David Fleshler, Angie DiMichele","title":"Tropical Storm Nicole prompts evacuations, causes 4 deaths - South Florida Sun Sentinel","description":"olliTropical Storm Nicole prompts evacuations, causes 4 deathsSouth Florida Sun Sentinel\r\n/liliTracking Tropical Storm Nicole: Latest forecast, spaghetti models, more information13WMAZ\r\n/liliHomes are collapsing into the ocean in Florida. Here","publishedAt":"2022-11-11T01:52:12Z","content":"Tropical Storm Nicole weakened into a depression and was headed out of Florida late Thursday, but the former Category 1 storms ramifications were still being revealed evacuations ordered, human remai "},{"source":{"id":"","name":"The Guardian"},"author":"Helen Pidd","title":"Police across UK face violence and anti-social behaviour on bonfire night","description":"Police Scotland call disorder in Edinburgh disgraceful after Molotov cocktail thrown at police vehiclePolice across the UK had a busy bonfire night dealing with violence and antisocial behaviour, with disorder in Edinburgh branded disgraceful.Police Scotl","publishedAt":"2022-11-06T17:45:23Z","content":"Police across the UK had a busy bonfire night dealing with violence and antisocial behaviour, with disorder in Edinburgh branded disgraceful.\r\nPolice Scotland said specialist officers had been deploy "},{"source":{"id":"associated-press","name":"Associated Press"},"author":"Mike Schneider","title":"Tropical Storm Nicole sends beachfront homes into ocean - The Associated Press - en Espaol","description":"olliTropical Storm Nicole sends beachfront homes into oceanThe Associated Press - en Espaol\r\n/liliBeach Erosion From Tropical Storm Nicole Causes Florida Home To Collapse Into OceanFOX Weather\r\n/liliShocking drone video shows storm destructio","publishedAt":"2022-11-10T23:15:00Z","content":"WILBUR-BY-THE-SEA, Fla. (AP) Tropical Storm Nicole sent Florida homes toppling into the Atlantic Ocean on Thursday and threatened a row of high-rise condominiums in places where Hurricane Ian washed  "},{"source":{"id":"","name":"nejm.org"},"author":"Jason G. Andrade, Marc W. Deyell, Laurent Macle, George A. Wells, Matthew Bennett, Vidal Essebag, Jean Champagne, Jean-Francois Roux, Derek Yung, Allan Skanes, Yaariv Khaykin, Carlos Morillo, Umjeet Jolly, Paul Novak, Evan Lockwood, Guy Amit, Paul Angaran, John Sapp, Stephan Wardell, Sandra Lauck, Julia Cadrin-Tourigny, Simon Kochhuser, Atul Verma","title":"Progression of Atrial Fibrillation after Cryoablation or Drug Therapy","description":"Original Article from The New England Journal of Medicine  Progression of Atrial Fibrillation after Cryoablation or Drug Therapy","publishedAt":"2022-11-07T05:00:00Z","content":"From the University of British Columbia (J.G.A., M.W.D., M.B., S.L.) and the Centre for Cardiovascular Innovation (J.G.A., M.W.D.), Vancouver, Montreal Heart Institute, Universit de Montral, Montre "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Brown proud of brother's World Cup impact","description":"GB Paralympian Harry Brown says he is proud of his brother Jack's impact on the Wheelchair Rugby League World Cup.","publishedAt":"2022-11-16T08:42:02Z","content":"Harry Brown is one of the key figures for the GB men's wheelchair basketball team\r\ntabletrthWheelchair Rugby League World Cup 2021 Final - England v France/th/tr\r\ntrtdVenue: Manchester  "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"CNW Group","title":"Media advisory - Government of Canada to Announce Support for Crisis Hotlines in Nova Scotia","description":"Members of the media are invited to join the Honourable Marci Ien, Minister for Women and Gender Equality and Youth, for an announcement regarding support...","publishedAt":"2022-11-09T14:04:00Z","content":"HALIFAX, NS, Nov. 9, 2022 /CNW/ - Members of the media are invited to join the Honourable Marci Ien, Minister for Women and Gender Equality and Youth, for an announcement regarding support for crisis "},{"source":{"id":"","name":"Daily Mail"},"author":"Matt Powell","title":"Police arrest 18 suspects aged 12-25 over Bonfire Night carnage which led to death of 17-year-old","description":"Police were pelted with fireworkson Saturday, November 5, between 5pm and midnight in Halifax and described the events as 'totally unacceptable'.","publishedAt":"2022-11-11T17:59:23Z","content":"Detectives have arrested 18 suspects, including a 12-year-old, on suspicion of violent disorder over Bonfire Night carnage which led to the tragic death of a 17-year-old boy.\r\nPolice were pelted with "},{"source":{"id":"","name":"Daily Mail"},"author":"James Robinson, Dan Sales","title":"Firework night death: Teenager who died in Halifax is named as 17-year-ld Qais Muhammad","description":"Qais MuhammadRatyal, 17, has been named locally as the teenager who died on Saturday night after falling through a greenhouse in Halifax, West Yorkshire.","publishedAt":"2022-11-07T10:35:19Z","content":"Pictured here is a schoolboy who died in a Bonfire Night tragedy in which teenagers reportedly 'hurled' fireworks at each other.\r\nQais MuhammadRatyal has been named locally as the teenager who died  "},{"source":{"id":"","name":"Toronto Star"},"author":"Stephanie Levitz - Ottawa Bureau","title":"Canada to lay out defence priorities as pressure builds for spending at home and abroad","description":"A tense exchange between the prime minister and Chinas president and an explosion on the Polish-Ukraine border that put the world on edge this week form part of the backdrop for a marquee speech Defence Minister Anita Anand is poised to deliver Friday at the","publishedAt":"2022-11-17T22:55:38Z","content":"OTTAWA  A tense exchange between the prime minister and Chinas president and an explosion on the Polish-Ukraine border that put the world on edge this week form part of the backdrop for a marquee s "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Flair Airlines","title":"Flair Airlines Announces New Service Out Of London International Airport","description":"Today, Flair Airlines, Canada's everyday low fare airline, and the Greater London International Airport Authority, the management authority for the London...","publishedAt":"2022-11-03T14:10:00Z","content":"ulliCanada's leading ultra-low fare airline announces new flights to Vancouver and Halifax, beginning in summer 2023\r\n/liliService to YXU launches December 5, 2022, between London and Tucson, "},{"source":{"id":"","name":"Usni.org"},"author":"John Grady","title":"Canada, France Should Join AUKUS Style Tech Agreement with U.S., Senator Says - USNI News - USNI News","description":"A senior Republican senator suggested Washington craft a military technology agreement with Canada and France to strengthen alliances with the U.S. and to deter Russia and China. Sen. James Risch, (R-Idaho)  ranking member of the Senate Foreign Affairs Commi","publishedAt":"2022-11-22T22:58:00Z","content":"Royal Canadian Navy Halifax-class frigate St. Johns leaving Portsmouth, U.K. Ralph Edwards photo used with permission\r\nA senior Republican senator suggested Washington craft a military technology agr "},{"source":{"id":"","name":"Eonline.com"},"author":"Kisha Forde","title":"WWEs Kevin Nash Shares 26-Year-Old Son Tristen's Cause of Death","description":"Kevin Nash is sharing more insight on his son Tristen's sudden passing.Days after the family released an Oct. 20 statement confirming Tristen died at the age of 26, the WWE legend shared that his...","publishedAt":"2022-10-25T13:27:24Z","content":"Kevin Nash is sharing more insight on his son Tristen's sudden passing.Days after the family released an Oct. 20 statement confirming Tristen died at the age of 26, the WWE legend shared that his son "},{"source":{"id":"","name":"nejm.org"},"author":"","title":"Progression of Atrial Fibrillation after Cryoablation or Drug Therapy  NEJM - nejm.org","description":"olliProgression of Atrial Fibrillation after Cryoablation or Drug Therapy  NEJMnejm.org\r\n/liliCanadian study suggests it's time to rethink how we treat atrial fibrillationMedical Xpress\r\n/liliNational study suggests it's time to rethink how w","publishedAt":"2022-11-07T17:20:34Z","content":"From the University of British Columbia (J.G.A., M.W.D., M.B., S.L.) and the Centre for Cardiovascular Innovation (J.G.A., M.W.D.), Vancouver, Montreal Heart Institute, Universit de Montral, Montre "},{"source":{"id":"","name":"Space.com"},"author":"Joe Rao","title":"See the eclipsed setting moon and rising sun simultaneously tomorrow during rare 'selenelion'","description":"See the sun rise while a total lunar eclipse sets on Tuesday (Nov. 8), in a rare phenomenon known as a 'selenelion'.","publishedAt":"2022-11-07T18:00:34Z","content":"Observers across the central and eastern United States and Canada should pay particular attention to the setting full moon\r\n on the morning of Nov. 8, for that morning's lunar eclipse\r\n will still be "},{"source":{"id":"","name":"The Boston Globe"},"author":"Bailey Allen","title":"O Christmas Tree: 45-foot-tall white spruce picked out for Boston Common","description":"The Christmas tree delivery is a time-honored tradition, Nova Scotias annual gift to show appreciation for Bostons help after the Halifax Explosion in 1917.","publishedAt":"2022-11-02T18:59:33Z","content":"Now that Halloween has come and gone, Boston Common will soon be decorated with an early Christmas present a 45-foot, 37-year-old white spruce tree sent from Nova Scotia.\r\nThe Christmas tree delivery "},{"source":{"id":"","name":"Telegraph.co.uk"},"author":"George Styllis","title":"Teenager dies and police in hospital after Bonfire Night violence","description":"Victim is believed to have injured himself crashing through a greenhouse","publishedAt":"2022-11-06T21:10:12Z","content":"A teenager died after Bonfire Night celebrations saw violence and anti-social behaviour in the North.\r\nThe 17-year-old is believed to have been with a group of youths fleeing police in Halifax, West  "},{"source":{"id":"cbs-news","name":"CBS News"},"author":"CBS News","title":"Senator James Risch: NATO is \"as strong as it's ever been\" amid war in Ukraine","description":"Speaking at the Halifax International Security Forum on Friday, Ukrainian President Volodymyr Zelenskyy rejected Russian calls for a \"short truce.\" Idaho Senator James Risch also spoke at the conference, and he joined CBS News' Catherine Herridge to talk abou","publishedAt":"2022-11-19T01:38:51Z","content":"Watch CBS News\r\nCopyright 2022 CBS Interactive Inc. All rights reserved.\r\nGet browser notifications for breaking news, live events, and exclusive reporting.\r\nNot NowTurn On"},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"CNW Group","title":"Killam Apartment REIT Announces November 2022 Distribution","description":"Killam Apartment REIT (TSX: KMP.UN) is pleased to announce its November 2022 monthly distribution. The distribution of 0.05833 per unit will be paid on...","publishedAt":"2022-11-15T18:56:00Z","content":"HALIFAX, NS, Nov. 15, 2022 /CNW/ - Killam Apartment REIT (TSX: KMP.UN) is pleased to announce its November 2022 monthly distribution. The distribution of 0.05833 per unit will be paid on December 15 "},{"source":{"id":"associated-press","name":"Associated Press"},"author":"John Leicester","title":"Ukraine says will look into alleged prisoner shooting video - The Associated Press - en Espaol","description":"olliUkraine says will look into alleged prisoner shooting videoThe Associated Press - en Espaol\r\n/liliKremlin says it will bring to justice those responsible for alleged execution of surrendered Russian soldiersYahoo News\r\n/liliU.S. monitorin","publishedAt":"2022-11-20T12:25:44Z","content":"KYIV, Ukraine (AP) Ukraine says it will investigate video footage circulated on Russian social media which Moscow alleged shows that Ukrainian forces killed Russian troops who may have been trying to "},{"source":{"id":"","name":"Bringatrailer.com"},"author":"bringatrailer","title":"BaT Auction: Porsche 997 GT2 Sport Bucket Seats at No Reserve","description":"This pair of Porsche GT2 Sport Bucket seats are upholstered in black leather with Alcantara center sections and feature gray deviated stitching,side airbags, pass-throughs for racing harnesses, and receivers for standard three-point seatbelts. The seats are ","publishedAt":"2022-11-06T13:30:12Z","content":"This pair of Porsche GT2 Sport Bucket seats are upholstered in black leather with Alcantara center sections and feature gray deviated stitching,side airbags, pass-throughs for racing harnesses, and  "},{"source":{"id":"","name":"Mindful.org"},"author":"Kylee Ross","title":"Managing Editor","description":"A natural leader with a knack for compassionate organization and systems, the Managing Editor contributes both to high level strategy development and to the nitty gritty of getting things done. \nThe post Managing Editor appeared first on Mindful.","publishedAt":"2022-11-02T14:13:46Z","content":"Mindful is a leading provider of corporate training, consumer media, licensed content, directories and other communications pertaining to the topic of mindfulness, around the world. We are a Public B "},{"source":{"id":"independent","name":"Independent"},"author":"Oliver Browning","title":"Gangs of youths throw fireworks at homes and police in shocking footage","description":"Police have released footage of large groups of youths throwing fireworks at homes and cars in West Yorkshire on Bonfire Night.","publishedAt":"2022-11-11T21:08:34Z","content":"Police have released footage of large groups of youths throwing fireworks at homes and cars in West Yorkshire on Bonfire Night.\r\nThe incidents happened on the streets of Halifax on Saturday 5 Novembe "},{"source":{"id":"","name":"The Boston Globe"},"author":"Bailey Allen","title":"Canadian Christmas tree delivered to Boston Common","description":"The 45-foot white spruce was donated to the city by a family from Nova Scotia in keeping with the provinces tradition of sending a Christmas tree as thanks for the aid Boston provided after the Halifax Explosion in 1917.","publishedAt":"2022-11-22T21:50:44Z","content":"The 37-year-old tree was cut on Nov. 16 and was driven across the Canadian-American border on Sunday, according to the Tree for Boston Twitter account. After a night in Bangor, Maine, the tree travel "},{"source":{"id":"","name":"Visual.ly"},"author":"mlmpropertymanagement","title":"Here is what Every Buy-to-Let Landlord Should Expect","description":"The increasingly expensive mortgages and more stringent regulations are quite a challenge when it comes to purchasing a home, so whats in store for","publishedAt":"2022-11-11T03:02:28Z","content":"Here is what Every Buy - to - Let Landlord should Expect  The increasingly expensive mortgages and more stringent regulations are quite a challenge when it comes to purchasing a  "},{"source":{"id":"","name":"The Boston Globe"},"author":"Daniel Kool","title":"Abrupt resignations leave one man running the Halifax Select Board on his own","description":"Since August, when a day of resignations rendered him the only administrative official in Halifax, Jonathan Selig has been running the Select Boards weekly meetings solo. He moves a motion, seconds that motion, and approves it all by himself with a unanimous","publishedAt":"2022-11-04T20:52:29Z","content":"Its a little strange, Im not going to lie, the surviving selectman said in an interview. Believe it or not, Im starting to get the hang of being a one-man band here.\r\nWhile the situation in Halifax i "},{"source":{"id":"","name":"Sky Sports"},"author":"Simeon Gholam","title":"Madden on 'sleeping giant' Stockport's rise","description":"Paddy Madden discusses the return to the Football League of Stockport County and beating Wrexham to the National League title.","publishedAt":"2022-11-16T13:59:00Z","content":"Paddy Madden knows there were sceptics when he made the move to Stockport County.\r\nThe striker was at the peak of his powers at Fleetwood Town, but last March he completed a surprise switch from Leag "},{"source":{"id":"the-globe-and-mail","name":"The Globe And Mail"},"author":"Michael Tutton","title":"Aircraft carrier visit to Halifax shows 'how tight' U.S. is with allies, commander says - The Globe and Mail","description":"olliAircraft carrier visit to Halifax shows 'how tight' U.S. is with allies, commander saysThe Globe and Mail\r\n/liliAircraft carrier visit to Halifax shows how tight U.S. is with allies: commanderLethbridge News Now\r\n/liliMassive American ai","publishedAt":"2022-10-29T21:19:37Z","content":"The United States Navy's most advanced aircraft carrier is on its first deployment, five years after it was commissioned into service.Andrew Vaughan/The Canadian Press\r\nA senior officer on the newest "},{"source":{"id":"","name":"The Truth About Cars"},"author":"Murilee Martin","title":"Junkyard Find: 1975 Volvo 245 DL","description":"Volvo began selling its now-legendary brick-shaped sedans and wagons here in the 1968 model year, with the 140 , and continued with the rear-driven sensible square Swedes all the way through the 1998 S90 / V90 . Of all those cars, though, the most iconic is t","publishedAt":"2022-10-31T14:00:00Z","content":"Volvo began selling its now-legendary brick-shaped sedans and wagons here in the 1968 model year, with the 140, and continued with the rear-driven sensible square Swedes all the way through the 1998  "},{"source":{"id":"","name":"Business Wire"},"author":"","title":"Labour Strife at Airports Across Eastern Canada Demands Federal Intervention, Steelworkers Union Says","description":"MONTREAL  QUEBEC CITY, Quebec  HALIFAX, Nova Scotia  ST. JOHNS, Newfoundland and Labrador--(BUSINESS WIRE)--We expect to meet in coming days with the federal Minister of Transport and we sincerely hope he will recognize that urgent action is required.","publishedAt":"2022-10-26T10:10:12Z","content":"MONTREAL amp; QUEBEC CITY, Quebec amp; HALIFAX, Nova Scotia amp; ST. JOHNS, Newfoundland and Labrador--(BUSINESS WIRE)--Security screening officers at every airport across eastern Canada have over "},{"source":{"id":"","name":"Nature.com"},"author":"Katharine Sanderson","title":"The path towards more-sustainable building construction","description":"The built environment provides a huge opportunity to move to a circular economy. Standardization and smart design will be key to enabling the shift.","publishedAt":"2022-11-16T00:00:00Z","content":"Our built environment from houses to offices, schools and shops is not environmentally benign. Buildings and the construction industry are, in fact, the worlds biggest consumer of raw materials and c "},{"source":{"id":"","name":"Telegraph.co.uk"},"author":"Fiona Tomas","title":"Meet hall-of-famers who broke new ground to give rugby league a platform","description":"Lisa McIntosh and Sally Milburn recall early tours of Australia where lack of support created a sisterhood","publishedAt":"2022-10-31T10:00:00Z","content":"McIntosh, who hails from Halifax, was fortunate in that Calderdale Council sponsored her for the trip, but she still slogged away to help others with their fundraising efforts in between her club and "}]}