{"totalResults":6665,"articles":[{"source":{"id":"wired","name":"Wired"},"author":"Meghan Herbst","title":"After Hurricane Ian's Floods, the Flesh-Eating Bacteria","description":"Floridas storms unleashed deadly vibrio bacteria in their wake. Theyll be a growing threat as the world gets warmer and wetter.","publishedAt":"2022-10-26T12:00:00Z","content":"In September, Hurricane Ian smashed into the southwest coast of Florida, bringing with it a storm surge that reached 13 feet in the coastal town of Fort Myers. Warm, brackish Gulf water inundated hom "},{"source":{"id":"cnn","name":"CNN"},"author":"Aya Elamroussi","title":"Subtropical Storm Nicole is on track to strengthen into a Category 1 hurricane","description":"A powerful storm packing torrential rain and damaging winds could slam into Florida's east coast as a Category 1 hurricane this week as many residents are still enduring the aftermath of Hurricane Ian.","publishedAt":"2022-11-08T09:14:47Z","content":"A powerful storm packing torrential rain and damaging winds could slam into Floridas east coast as a Category 1 hurricane this week as many residents are still enduring the aftermath of Hurricane Ian "},{"source":{"id":"cnn","name":"CNN"},"author":"Aya Elamroussi","title":"Nicole brings dangerous storm surge as it nears the Bahamas, with expected landfall in Florida less than 24 hours away","description":"Tropical Storm Nicole is drenching the Bahamas with dangerous storm surge early Wednesday before it slams into Florida's east coast as a possible Category 1 hurricane, prompting evacuations in areas still recovering from Hurricane Ian.","publishedAt":"2022-11-09T09:40:52Z","content":"Tropical Storm Nicole is drenching the Bahamas with dangerous storm surge early Wednesday before it slams into Floridas east coast as a possibleCategory 1 hurricane, prompting evacuations in areas st "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Hurricane Roslyn: Mexico braces for powerful storm","description":"Meteorologists warn of dangerous storm surge and flooding in towns on Mexico's Pacific coast.","publishedAt":"2022-10-23T04:32:04Z","content":"Towns along Mexico's Pacific coast are bracing for powerful Hurricane Roslyn, amid warnings that it could bring dangerous storm surges and flooding.\r\nThe Category 4 storm with winds up to 130mph (209 "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Angely Mercado","title":"Shocking Images From the Aftermath of Hurricane Sandy","description":"Ten years ago, Hurricane Sandy barreled through the Caribbean and then up the Eastern seaboard, bringing floods and storm surges that destroyed homes and critical infrastructure. It was one of the most destructive storms in U.S. history, costing the country m","publishedAt":"2022-10-27T18:50:00Z","content":"Ten years ago, Hurricane Sandy barreled through the Caribbean and then up the Eastern seaboard, bringing floods and storm surges that destroyed homes and critical infrastructure. It was one of the mo "},{"source":{"id":"cnn","name":"CNN"},"author":"Jennifer Gray","title":"Budding hurricane, snow and record heat could impact voters tomorrow","description":"This Election Day, all types of weather including rain, snow, heat, cold and even tropical storm impacts are possible -- depending on what region of the country you live in.","publishedAt":"2022-11-07T16:27:56Z","content":"Editors Note: A version of this article originally appeared in the weekly weather newsletter, the CNN Weather Brief, which is released every Monday. You can sign up here to receive them every week an "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Passant Rabie","title":"NASA's Moon Rocket Endures Excessive Winds on Its Launchpad in Florida","description":"Tropical Storm Nicole made landfall as a hurricane early Thursday morning, unleashing strong winds on NASAs Kennedy Space Center (KSC) where the Space Launch System (SLS) rocket was left stranded on the launchpad.Read more...","publishedAt":"2022-11-10T22:26:00Z","content":"Tropical Storm Nicole made landfall as a hurricane early Thursday morning, unleashing strong winds on NASAs Kennedy Space Center (KSC) where the Space Launch System (SLS) rocket was left stranded on  "},{"source":{"id":"cnn","name":"CNN"},"author":"Nouran Salahieh","title":"Western Mexico braces for Sunday landfall of Category 4 Hurricane Roslyn","description":"Hurricane Roslyn, barreling towards Mexico as a major Category 4 storm, is expected to make landfall Sunday morning, bringing dangerous storm surge and flooding to parts of the country, forecasters said.","publishedAt":"2022-10-23T04:19:00Z","content":"Hurricane Roslyn, barreling towards Mexico as a major Category 4 storm, is expected to make landfall Sunday morning, bringing dangerous storm surge and flooding to parts of the country, forecasters s "},{"source":{"id":"cnn","name":"CNN"},"author":"By Leah Asmelash, CNN","title":"Hurricane Maria changed Puerto Rico. In a new exhibit, artists reflect back","description":"In a new exhibition at The Whitney Museum of American Art, 20 Puerto Rican creatives present work inspired by the continuing impact of the 2017 hurricane, which devastated their homeland.","publishedAt":"2022-11-20T11:02:17Z","content":"artsPublished 20th November 2022\r\nAfter Hurricane Maria struck Puerto Rico in 2017, artist Gabriella Bez's life changed.\r\nIt wasn't just the material stress of living through the hurricane -- the wi "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Martin forecast to become large post-tropical cyclone over north Atlantic - U.S. NHC - Reuters.com","description":"Hurricane Martin is forecast to transition to a large and powerful post-tropical cyclone on Thursday over the north Atlantic, the National Hurricane Center (NHC) said in its latest advisory.","publishedAt":"2022-11-03T03:03:35Z","content":"Nov 3 (Reuters) - Hurricane Martin is forecast to transition to a large and powerful post-tropical cyclone on Thursday over the north Atlantic, the National Hurricane Center (NHC) said in its latest  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Storm Lisa set to become hurricane in beeline toward Belize, Guatemala - Reuters.com","description":"Tropical Storm Lisa is expected to strengthen into a hurricane overnight as it swirls directly toward Belize and Guatemala, the National Hurricane Center (NHC) said on Tuesday in its latest report.","publishedAt":"2022-11-01T17:21:00Z","content":"MEXICO CITY, Nov 1 (Reuters) - Tropical Storm Lisa is expected to strengthen into a hurricane overnight as it swirls directly toward Belize and Guatemala, the National Hurricane Center (NHC) said on  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Martin becomes a hurricane west of Azores - U.S. NHC - Reuters","description":"Tropical storm Martin has strengthened into a hurricane west of the Azores, with a turn to the northeast expected during the next couple of days, the National Hurricane Center (NHC) said in its latest advisory on Wednesday.","publishedAt":"2022-11-02T15:07:00Z","content":"Nov 2 (Reuters) - Tropical storm Martin has strengthened into a hurricane west of the Azores, with a turn to the northeast expected during the next couple of days, the National Hurricane Center (NHC) "},{"source":{"id":"","name":"The Guardian"},"author":"Lauren Herdman (Metdesk)","title":"Weather tracker: hurricane activity in Atlantic dips below predicted level","description":"Hurricane Fiona and Hurricane Ian were the only storms to strengthen enough to become major eventsThe Atlantic hurricane season runs from 1 June to 20 November, with activity peaking between August and October. The past seven years have seen above average act","publishedAt":"2022-11-04T12:28:48Z","content":"The Atlantic hurricane season runs from 1 June to 20 November, with activity peaking between August and October. The past seven years have seen above average activity the 2021 season was the third mo "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Mary Beth Griggs","title":"NASAs Artemis I launch is delayed again as Tropical Storm Nicole approaches","description":"NASAs Space Launch System is still waiting to get off the ground. The first launch of the rocket, which will kick off the long-awaited Artemis 1 mission, will happen early on November 16th.","publishedAt":"2022-11-09T20:42:09Z","content":"NASAs Artemis I launch is delayed again as Tropical Storm Nicole approaches\r\nNASAs Artemis I launch is delayed again as Tropical Storm Nicole approaches\r\n / The next launch attempt will happen early  "},{"source":{"id":"engadget","name":"Engadget"},"author":"Mat Smith","title":"The Morning After: Elon Musk issues ultimatum to remaining Twitter employees","description":"Twitter might lose even more employees following the mass layoffs that halved its workforce earlier this month  and after the company fired engineers who publicly called out its new owner. Elon Musk gave the remaining staff an ultimatum and asked them to com","publishedAt":"2022-11-17T12:15:56Z","content":"Twitter might lose even more employees following the mass layoffs that halved its workforce earlier this month and after the company fired engineers who publicly called out its new owner. Elon Musk g "},{"source":{"id":"cnn","name":"CNN"},"author":"Hanna Ziady","title":"Former NBA champion is changing 'how the world builds' to fight the climate crisis","description":"Three years ago, a hurricane devastated the Bahamas, claiming dozens of lives. Today, the country is building what it claims to be the world's first carbon-negative housing community to reduce the likelihood of future climate disasters and to ease the shortag","publishedAt":"2022-11-07T16:06:45Z","content":"Three years ago, a hurricanedevastated the Bahamas, claiming dozens of lives. Today, the country is building what it claims to be the worlds first carbon-negative housing community to reduce the like "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Tropical Storm Roslyn to strengthen to hurricane near Mexican resorts - Reuters Canada","description":"Tropical Storm Roslyn is expected to strengthen into a hurricane on Friday as it crawls toward tourist resorts on Mexico's Pacific coast, the U.S. National Hurricane Center (NHC) said.","publishedAt":"2022-10-22T01:46:00Z","content":"MEXICO CITY, Oct 21 (Reuters) - Tropical Storm Roslyn is expected to strengthen into a hurricane on Friday as it crawls toward tourist resorts on Mexico's Pacific coast, the U.S. National Hurricane C "},{"source":{"id":"","name":"CNET"},"author":"Amanda Kooser","title":"4.1 Billion NASA Moon Rocket Stuck Outside as a Dangerous Storm Moves In - CNET","description":"Tropical storm Nicole could turn into a hurricane as it reaches the Florida coast.","publishedAt":"2022-11-08T16:36:52Z","content":"Artemis I can't catch a break. NASA's much-delayed uncrewed around-the-moon mission has a new obstacle to deal with ahead of its scheduled Nov. 14 launch date. A powerful storm is heading for Florida "},{"source":{"id":"engadget","name":"Engadget"},"author":"Igor Bonifacic","title":"NASA's Orion spacecraft on track to begin Moon flyby on November 21st","description":"The Orion crew vehicle\r\n is exceeding expectations on its way to the Moon. NASA provided an update on Artemis 1 following the missions successful launch early Wednesday morning\r\n. \"Orion has been performing great so far,\" Vehicle Integration Manager Jim Geff","publishedAt":"2022-11-19T19:19:10Z","content":"The Orion crew vehicle is exceeding expectations on its way to the Moon. NASA provided an update on Artemis 1 following the missions successful launch early Wednesday morning. \"Orion has been perform "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Zurich Insurance sees 550 mln hit from Hurricane Ian - Reuters","description":"Zurich Insurance Group a href=\"\" target=\"_blank\"(ZURN.S)/a expects a net 550 million pre-tax hit from Hurricane Ian, it said on Thursday, though it remains on track to beat its 2020-2022 financial targets, helped b","publishedAt":"2022-11-10T06:03:00Z","content":"ZURICH/LONDON, Nov 10 (Reuters) - Zurich Insurance Group (ZURN.S) expects a net 550 million pre-tax hit from Hurricane Ian, it said on Thursday, though it remains on track to beat its 2020-2022 fina "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Hurricane Energy launches its own sale after unsolicited bid - Reuters","description":"North Sea oil and gas producer Hurricane Energy a href=\"\" target=\"_blank\"(HUR.L)/a launched a formal sale process after receiving an unsolicited offer from an unnamed bidder which its board considers too low, it said","publishedAt":"2022-11-02T08:45:00Z","content":"LONDON, Nov 2 (Reuters) - North Sea oil and gas producer Hurricane Energy (HUR.L) launched a formal sale process after receiving an unsolicited offer from an unnamed bidder which its board considers  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Factbox: Over 210000 without power in Florida from Hurricane Nicole - Reuters","description":"Over 210,000 homes and businesses were without power in Florida early on Thursday after Hurricane Nicole crashed into the state's east coast overnight.","publishedAt":"2022-11-10T12:49:00Z","content":"Nov 10 (Reuters) - Over 210,000 homes and businesses were without power in Florida early on Thursday after Hurricane Nicole crashed into the state's east coast overnight.\r\nUtilities have already rest "},{"source":{"id":"","name":"Entrepreneur"},"author":"Jonathan Small","title":"Electric Cars Keep Bursting Into Flames In Florida","description":"After Hurricane Ian, an unexpected inferno of EVs. What's going on","publishedAt":"2022-10-29T05:53:00Z","content":"Hurricane Ian caused billions in damage and upended lives, but few people expected that it would cause electric vehicles to burst into flames.\r\nBut that's just what happened.\r\nIn the days following H "},{"source":{"id":"","name":"The Guardian"},"author":"Richard Luscombe in Miami","title":"Florida buckles down for direct hit from rare November hurricane","description":"Storm Nicole picks up strength after striking the Bahamas and is forecast to hit the state already devastated by Hurricane Ian ulliFlorida-bound tropical storm forces new delay to uncrewed Artemis moonshot/li/ulResidents of Floridas east coast were b","publishedAt":"2022-11-09T22:57:56Z","content":"Residents of Floridas east coast were bracing for a direct hit from a rare November hurricane that was forecast to hit in the early hours of Thursday, with evacuations ordered in several vulnerable c "},{"source":{"id":"cnn","name":"CNN"},"author":"Rachel Ramirez","title":"Homes are collapsing on the Florida coast amid Tropical Storm Nicole. Here's what's behind the dangerous situation","description":"Homes and buildings are collapsing into the ocean and authorities have issued warnings to evacuate some areas as Tropical Storm Nicole pushes a huge volume of ocean water onshore in southeast Florida.","publishedAt":"2022-11-10T16:36:32Z","content":"Homes and buildings are collapsing into the ocean and authorities have issued warnings to evacuate some areas as Tropical Storm Nicole pushes a huge volume of ocean water onshore in southeast Florida "},{"source":{"id":"","name":"NPR"},"author":"The Associated Press","title":"Florida braces for Hurricane Nicole, a rare November storm","description":"The storm strengthened into a hurricane on Wednesday after pounding the Bahamas, as U.S. officials ordered evacuations that included former President Donald Trump's Mar-a-Lago club.","publishedAt":"2022-11-10T00:07:09Z","content":"Winds blow an umbrella inside-out as guests leave the Magic Kingdom at Walt Disney World in Lake Buena Vista, Fla., Wednesday, Nov. 9, as conditions deteriorate with the approach of Hurricane Nicole. "},{"source":{"id":"","name":"Winnipeg Free Press"},"author":"Marcia Dunn, The Associated Press","title":"NASA: Moon rocket endured hurricane, set for 1st test flight - Winnipeg Free Press","description":"olliNASA: Moon rocket endured hurricane, set for 1st test flightWinnipeg Free Press\r\n/liliNASA's new moon rocket tested by hurricane-force winds at Florida launchpadThe Globe and Mail\r\n/liliThe Move to the Launch Pad for Artemis I on This Week","publishedAt":"2022-11-11T22:24:47Z","content":"CAPE CANAVERAL, Fla. (AP) NASAs moon rocket needs only minor repairs after enduring a hurricane at the pad and is on track for its first test flight next week, a top official said Friday. \r\nRight no "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Tropical Storm Nicole takes aim at Florida's Atlantic coast - Reuters","description":"Tropical Storm Nicole was expected to gain strength and become a hurricane on Wednesday as it approached Florida's Atlantic Coast, threatening to batter the region with a dangerous storm surge, downpours and strong winds.","publishedAt":"2022-11-09T15:07:00Z","content":"MIAMI, Nov 9 (Reuters) - Tropical Storm Nicole was expected to gain strength and become a hurricane on Wednesday as it approached Florida's Atlantic Coast, threatening to batter the region with a dan "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Three dead as Roslyn's intense rains, winds hit Mexico's Pacific coast - Reuters Canada","description":"At least three people died from destruction caused by intense rainfall unleashed by Storm Roslyn, which provoked flooding along Mexico's Pacific coast when it made landfall as a powerful hurricane on Sunday.","publishedAt":"2022-10-24T19:30:00Z","content":"MEXICO CITY, Oct 24 (Reuters) - At least three people died from destruction caused by intense rainfall unleashed by Storm Roslyn, which provoked flooding along Mexico's Pacific coast when it made lan "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"CBS News Videos","title":"Florida braces for possible hurricane","description":"Millions along Florida's Atlantic coast are bracing for what could be a rare November hurricane -- the first since 1985. The Weather Channel's Mike Bettes is...","publishedAt":"2022-11-08T23:45:35Z","content":"Some parts of this page are not supported on your current browser version. Please upgrade to a recent browser version."},{"source":{"id":"","name":"NPR"},"author":"Danielle Kaye","title":"Still reeling from Ian, Florida shrimpers are desperate to get back on the water","description":"Fishers in southwest Florida are desperate to save their shrimping fleet, and their lifestyle, decimated by Hurricane Ian more than a month ago.","publishedAt":"2022-11-08T10:01:08Z","content":"Jimmy Driggers and his wife Shirley pose for a portrait on Oct. 28, 2022 in Pine Island, Fla., where their home was severely flooded by a storm surge from Hurricane Ian in September.\r\nOctavio Jones f "},{"source":{"id":"","name":"NPR"},"author":"Ayana Archie","title":"Hurricane Nicole is expected to make landfall on the Florida coast Wednesday","description":"The storm is leaving the Bahamas and was about 75 miles from West Palm Beach, Florida as of Wednesday evening, the National Hurricane Center said.","publishedAt":"2022-11-10T05:14:52Z","content":"People brave rain and heavy winds to visit the waterfront along the Jensen Beach Causeway, as conditions deteriorate with the approach of Hurricane Nicole, Wednesday, Nov. 9, 2022, in Jensen Beach, F "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Insurers stare at up to 60 bln hit from Hurricane Ian, AIG chief Zaffino says - Reuters","description":"Insurers face potential losses of up to 60 billion from Hurricane Ian, American International Group Inc a href=\"\" target=\"_blank\"(AIG.N)/a chief Peter Zaffino said on Wednesday, in what could be the second largest n","publishedAt":"2022-11-02T15:02:00Z","content":"Nov 2 (Reuters) - Insurers face potential losses of up to 60 billion from Hurricane Ian, American International Group Inc (AIG.N) chief Peter Zaffino said on Wednesday, in what could be the second l "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"tporterbusinessinsider.com (Tom Porter)","title":"Trump ignored an evacuation order for Mar-a-Lago, instead raging about the midterms and posting attacks on Ron DeSantis","description":"The former president did not leave his Palm Beach resort as the hurricane approached, despite an evacuation order from state authorities.","publishedAt":"2022-11-10T13:58:46Z","content":"Former President Donald Trump refused to evacuate Mar-a-Lago as Hurricane Nicole approached the Florida coast, and spent the day venting about the disappointment of candidates he'd backed in the midt "},{"source":{"id":"cnn","name":"CNN"},"author":"","title":"In pictures: Remembering Superstorm Sandy, 10 years on","description":"Superstorm Sandy made landfall over New Jersey on October 29, 2012.","publishedAt":"2022-10-28T20:41:53Z","content":"Superstorm Sandy made landfall over New Jersey on October 29, 2012.\r\nThe storm surge destroyed homes, ripped apart piers on the Jersey Shore and inundated subway and highway tunnels in New York. Near "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Storm Nicole drenches Georgia and Carolinas after wreaking destruction in Florida - Reuters","description":"Storm Nicole crawled north on Friday, soaking parts of Georgia and the Carolinas with heavy rains and leaving in its wake four dead and a path of destroyed and teetering beachside homes and damaged hotels and condos along Florida's Atlantic coast.","publishedAt":"2022-11-11T15:32:00Z","content":"ATLANTA, Nov 11 (Reuters) - Storm Nicole crawled north on Friday, soaking parts of Georgia and the Carolinas with heavy rains and leaving in its wake four dead and a path of destroyed and teetering b "},{"source":{"id":"","name":"Castanet.net"},"author":"","title":"Remnants of hurricane Nicole bring heavy rain to southern Quebec and Atlantic region - Canada News - Castanet.net","description":"olliRemnants of hurricane Nicole bring heavy rain to southern Quebec and Atlantic region - Canada NewsCastanet.net\r\n/liliN.L. hit with mixed bag of winter-like weather from post-tropical storm NicoleCBC.ca\r\n/liliHurricane Nicole: Heavy rain in","publishedAt":"2022-11-12T14:38:00Z","content":"The remnants of hurricane Nicole are bringing heavy rainfall to much of southern Quebec and Atlantic Canada.\r\nEnvironment Canada said Friday that Nicole would merge overnight with a cold front and tr "},{"source":{"id":"the-washington-post","name":"The Washington Post"},"author":"Christian Davenport","title":"NASA sets net Artemia launch attempt for Wednesday. - The Washington Post","description":"olliNASA sets net Artemia launch attempt for Wednesday.The Washington Post\r\n/liliNASA's new moon rocket tested by hurricane-force winds at Florida launchpadThe Globe and Mail\r\n/liliMinor damage after Artemis SLS rocket spent Hurricane Nicole o","publishedAt":"2022-11-11T21:43:48Z","content":"Comment on this story\r\nNASA is pushing ahead with its next attempt to launch its giant Space Launch System moon rocket, officials said Friday, days after it was battered by Hurricane Nicole as it sat "},{"source":{"id":"","name":"Space.com"},"author":"Brett Tingley","title":"NASA's Artemis 1 moon rocket boosters could expire in December, launch or not - Space.com","description":"olliNASA's Artemis 1 moon rocket boosters could expire in December, launch or notSpace.com\r\n/liliNASA's Moon rocket to 'ride out' potential hurricane NicoleThe Weather Network\r\n/liliNASA Re-Targets Artemis I Moon Rocket Launch  Prepares for T","publishedAt":"2022-11-09T20:02:53Z","content":"As the launch date for NASA's Artemis 1 moon mission continues to get pushed back due to glitches and storms, a deadline for its solid rocket boosters is quickly approaching.\r\nThe launch of Artemis 1 "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Insurer AIG profit slumps on hurricane costs, lower investment returns - Reuters","description":"Insurer American International Group Inc a href=\"\" target=\"_blank\"(AIG.N)/a on Tuesday reported a more than 39 decline in quarterly profit as investment income fell by more than 1 billion and losses from Hurricane ","publishedAt":"2022-11-01T20:18:00Z","content":"Nov 1 (Reuters) - Insurer American International Group Inc (AIG.N) on Tuesday reported a more than 39 decline in quarterly profit as investment income fell by more than 1 billion and losses from Hu "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Hurricane threat prompts NASA to delay next launch attempt of moon rocket - Reuters","description":"NASA will batten down its big new moon rocket on the launch pad to ride out a hurricane expected to hit near Cape Canaveral, Florida, and its targeted liftoff time next week has been postponed by two days, the U.S. space agency said on Monday.","publishedAt":"2022-11-09T02:56:00Z","content":"Nov 8 (Reuters) - NASA will batten down its big new moon rocket on the launch pad to ride out a hurricane expected to hit near Cape Canaveral, Florida, and its targeted liftoff time next week has bee "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Munich Re firmly sticks to 2022 target after quarterly profit rise - Reuters","description":"Munich Re a href=\"\" target=\"_blank\"(MUVGn.DE)/a on Tuesday said it posted a 44 rise in net profit in the third quarter, despite big claims from Hurricane Ian, and it \"firmly\" stuck to its full-year earnings targe","publishedAt":"2022-11-08T06:48:00Z","content":"FRANKFURT, Nov 8 (Reuters) - Munich Re (MUVGn.DE) on Tuesday said it posted a 44 rise in net profit in the third quarter, despite big claims from Hurricane Ian, and it \"firmly\" stuck to its full-yea "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Reinsurance hedge fund Tangency Capital raises 200 mln - Reuters","description":"Reinsurance hedge fund Tangency Capital has raised 200 million from investors, bringing its total assets under management to \"north of 600 million,\" one of its co-founders told Reuters, as the market anticipates sharp rises in premium rates.","publishedAt":"2022-11-11T16:12:00Z","content":"LONDON, Nov 11 (Reuters) - Reinsurance hedge fund Tangency Capital has raised 200 million from investors, bringing its total assets under management to \"north of 600 million,\" one of its co-founder "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"French insurer Axa posts a 2 rise in nine-month revenue - Reuters.com","description":"Axa a href=\"\" target=\"_blank\"(AXAF.PA)/a on Wednesday said its revenue in the first nine months of the year increased by 2 and estimated it would have to pay out about 400 million euros (394 million) for damages ","publishedAt":"2022-11-02T16:49:00Z","content":"PARIS, Nov 2 (Reuters) - Axa (AXAF.PA) on Wednesday said its revenue in the first nine months of the year increased by 2 and estimated it would have to pay out about 400 million euros (394 million) "},{"source":{"id":"time","name":"Time"},"author":"TERRY SPENCER and FREIDA FRISARO/AP","title":"Tropical Storm Nicole Hits Florida as a Rare November Hurricane","description":"Tropical Storm Nicole made landfall as Category 1 hurricane, drenching Florida, Georgia, and the Carolinas.","publishedAt":"2022-11-10T15:46:19Z","content":"VERO BEACH, Fla. (AP)  Tropical Storm Nicole hit Florida as a hurricane Thursday, washing away the remaining protections for a stretch of beachfront properties that lost their seawall during Hurrica "},{"source":{"id":"","name":"The Weather Network"},"author":"Pelmorex Weather Networks Inc","title":"Warmth, rain and even ice as the remnants of a hurricane sweep Atlantic Canada - The Weather Network","description":"olliWarmth, rain and even ice as the remnants of a hurricane sweep Atlantic CanadaThe Weather Network\r\n/liliWeather warnings issued for the MaritimesCTV News Atlantic\r\n/liliAtlantic Canada, Quebec under weather alerts as storm Nicole tracks no","publishedAt":"2022-11-11T17:05:00Z","content":"Nicole, downgraded to a tropical depression as of Friday morning, will continue to bring heavy rains into portions of the southeastern United States as the remnants of the tropical system track towar "},{"source":{"id":"","name":"YouTube"},"author":"","title":"Minor damage after Artemis SLS rocket spent Hurricane Nicole on launch pad - WKMG News 6 ClickOrlando","description":"olliMinor damage after Artemis SLS rocket spent Hurricane Nicole on launch padWKMG News 6 ClickOrlando\r\n/liliNASA's new moon rocket tested by hurricane-force winds at Florida launchpadThe Globe and Mail\r\n/liliNASA leaves its Artemis I rocket e","urlToImage":"","publishedAt":"2022-11-11T15:45:58Z","content":"Your browser isnt supported anymore. Update it to get the best YouTube experience and our latest features. Learn more\r\nRemind me later"},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Factbox: COP27: Counting the rising cost of climate disasters - Reuters","description":"Climate change has raised the cost of natural disasters, as rising sea levels and drought increase the frequency and severity of flooding and wildfires, insurers and risk modelling experts say.","publishedAt":"2022-11-16T10:44:00Z","content":"Nov 16 (Reuters) - Climate change has raised the cost of natural disasters, as rising sea levels and drought increase the frequency and severity of flooding and wildfires, insurers and risk modelling "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Sarah Wilson,Jason Kelly","title":"Tropical Storm Lisa could strengthen into a hurricane by Wednesday","description":"Tropical Storm Lisa formed in the Caribbean on Monday.","publishedAt":"2022-10-31T15:28:53Z","content":"Tropical Storm Lisa formed in the Caribbean on Monday morning.\r\nThe storm is south of Jamaica and has winds of 40 mph.\r\nChief meteorologist Tom Terry said the storm is forecast to strengthen over the "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"MIKE SCHNEIDER","title":"Hurricane Ian's lucrative cleanup deals generate new storm","description":"It has been a month since Hurricane Ian wiped out parts of southwest Florida.  Now multimillion-dollar cleanup contracts are generating new tempests in the...","publishedAt":"2022-10-27T15:03:07Z","content":"It has been a month since Hurricane Ian wiped out parts of southwest Florida. Now multimillion-dollar cleanup contracts are generating new tempests in the Category 4 storm's wake.\r\nContractors who re "},{"source":{"id":"","name":"Toronto Star"},"author":"Marcia Dunn","title":"Moon rocket launch looms as NASA evaluates hurricane damage - Toronto Star","description":"olliMoon rocket launch looms as NASA evaluates hurricane damageToronto Star\r\n/liliNothing preventing planned Artemis I mission to the moon, NASA says12NewsNow\r\n/liliNASA's Artemis 1 moon mission still 'go' for Nov. 16 launchSpace.com\r\n/li","publishedAt":"2022-11-14T17:01:25Z","content":"CAPE CANAVERAL, Fla. (AP) NASA started the countdown Monday for this weeks planned liftoff of its new moon rocket, although hurricane damage could cause yet another delay for the test flight.\r\nHurric "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"AccuWeather","title":"Growing storm surge threat from Nicole","description":"While the focus of Nicole tends to be on the storm's wind and rain, AccuWeather hurricane expert Dan Kottlowski urges people to be aware of the growing...","publishedAt":"2022-11-09T20:16:05Z","content":"While the focus of Nicole tends to be on the storm's wind and rain, AccuWeather hurricane expert Dan Kottlowski urges people to be aware of the growing threat of storm surge."},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"AccuWeather","title":"Dangerous erosion leaves homeowners displaced","description":"Severe beach erosion caused by Hurricane Nicole has left many residents along the Florida coast displaced as their homes dangle at the brink of collapse on...","publishedAt":"2022-11-10T20:06:34Z","content":"Severe beach erosion caused by Hurricane Nicole has left many residents along the Florida coast displaced as their homes dangle at the brink of collapse on Nov. 10."},{"source":{"id":"","name":"The Guardian"},"author":"Richard Luscombe in Miami","title":"Florida-bound tropical storm forces new delay to uncrewed Artemis moonshot","description":"Giant rocket, designed to withstand winds of 85mph, will remain on launchpad, with new launch date set for 16 NovemberThe imminent arrival of Tropical Storm Nicole in Florida has prompted Nasa to further delay its first crew-capable moon mission in half a cen","publishedAt":"2022-11-09T19:37:52Z","content":"The imminent arrival of Tropical Storm Nicole in Florida has prompted Nasa to further delay its first crew-capable moon mission in half a century, although mission managers say they are comfortable l "},{"source":{"id":"business-insider","name":"Business Insider"},"author":"prosaaquinoinsider.com (Paola Rosa-Aquino)","title":"Hurricane Nicole unearthed 6 human skulls from a Florida beach, and it's the latest case of long-buried remains found after worsening weather","description":"The storm eroded parts of the east Florida coastline, exposing centuries-old skeletal remains from a Native American burial ground.","publishedAt":"2022-11-15T17:03:18Z","content":"Hurricane Nicole's storm surge last week eroded parts of the east Florida coastline and unearthed a Native American burial ground dating back hundreds of years, according to local news reports.\r\nThe  "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Georgina Torbet","title":"NASAs Orion spacecraft makes close flyby of the Moon and heads on to orbit","description":"NASA just gave an update on their Artemis 1 mission. Their Orion spacecraft is well on its way to its orbit around the Moon after its successful launch by the massive Space Launch System rocket.","publishedAt":"2022-11-22T17:46:16Z","content":"NASAs Orion spacecraft makes close flyby of the Moon and heads on to orbit\r\nNASAs Orion spacecraft makes close flyby of the Moon and heads on to orbit\r\n / Back on Earth, NASA is examining some damage "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Green groups sue Louisiana over Venture Global LNG permit exemption - Reuters.com","description":"Three environmental groups have sued the Louisiana Department of Natural Resources for exempting Venture Global LNG from needing an environmental permit to build a liquefied natural gas (LNG) terminal, the organizations said on Wednesday.","publishedAt":"2022-11-16T21:53:00Z","content":"WASHINGTON, Nov 16 (Reuters) - Three environmental groups have sued the Louisiana Department of Natural Resources for exempting Venture Global LNG from needing an environmental permit to build a liqu "},{"source":{"id":"","name":"Miami Herald"},"author":"Jeff Kleinman","title":"Where will Subtropical Storm Nicole hit Some possible paths in the Florida forecast","description":"Where is Subtropical Storm Nicole heading","publishedAt":"2022-11-07T17:49:15Z","content":"Where is Subtropical Storm Nicole heading\r\nBased on the forecast from the National Hurricane Center, and the hurricane watches just issued, Florida will likely feel the storm in some form. But we do "},{"source":{"id":"","name":"The Guardian"},"author":"Cecilia Nowell","title":"Waterlogged wheat, rotting oranges: five crops devastated by a year of extreme weather","description":"Crops are struggling to grow  and produce the same yields  as they would under normal weather conditionsFrom Hurricanes Fiona and Ian, to flooding in eastern Kentucky and a record dry summer as the western US entered its 22nd year of a once-in-a-millennium ","publishedAt":"2022-11-01T09:00:03Z","content":"From Hurricanes Fiona and Ian, to flooding in eastern Kentucky and a record dry summer as the western US entered its 22nd year of a once-in-a-millennium megadrought, the US has already seen more than "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Associated Press","title":"Hurricane Roslyn heads for weekend hit on Mexico's coast","description":"Hurricane Roslyn is expected to strengthen some as its curves toward Mexicos Pacific coast Saturday and head for landfall in the region around the resort of...","publishedAt":"2022-10-22T04:02:12Z","content":"MEXICO CITY (AP) Hurricane Roslyn is expected to strengthen some as its curves toward Mexicos Pacific coast Saturday and head for landfall in the region around the resort of Puerto Vallarta.\r\nThe U.S "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Kherson: Locals' trepidation as Russians prepare withdrawal","description":"The city's residents feel mounting dread, wondering what the occupiers will do as they leave.","publishedAt":"2022-11-09T19:30:45Z","content":"When the Russians drove into Kherson in March, virtually unopposed, they cannot have imagined they would be getting ready to leave a mere eight months later. \r\nBut by the time Moscow orchestrated its "},{"source":{"id":"abc-news","name":"ABC News"},"author":"CHRIS MEGERIAN Associated Press","title":"US: Federal aid to Florida for Hurricane Ian tops 2B","description":"Federal officials say U.S. aid to Florida for recovery from Hurricane Ian has topped the 2 billion mark","publishedAt":"2022-11-07T18:00:38Z","content":"WASHINGTON -- Federal aid to Florida for recovery from Hurricane Ian has topped the 2 billion mark, Biden administration officials announced Monday, one day before the midterm elections.\r\nMost of th "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"COP27: Multi-lateral lenders have failed poorest over climate - Commonwealth head - Reuters","description":"The world's multi-lateral banks have \"demonstrably failed\" low and middle income countries when climate disasters hit and need to better assess their vulnerability and resilience when offering support, the head of the Commonwealth told Reuters.","publishedAt":"2022-11-17T09:02:00Z","content":"SHARM EL-SHEIKH, Nov 17 (Reuters) - The world's multi-lateral banks have \"demonstrably failed\" low and middle income countries when climate disasters hit and need to better assess their vulnerability "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Florida's Atlantic coast prepares for Storm Nicole - Reuters","description":"Millions of Floridians were on an emergency footing on Tuesday as a subtropical storm steamed toward the state's Atlantic coast, threatening to drive a dangerous storm surge in the area within the next two days.","publishedAt":"2022-11-08T15:35:00Z","content":"Nov 8 (Reuters) - Millions of Floridians were on an emergency footing on Tuesday as a subtropical storm steamed toward the state's Atlantic coast, threatening to drive a dangerous storm surge in the  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Factbox: Highlights from Canada government's fall economic statement - Reuters.com","description":"Below are some of the key proposals and takeaways from the annual fall economic statement unveiled by Canada's Finance Minister Chrystia Freeland on Thursday. [nO8N2N5027","publishedAt":"2022-11-03T20:15:00Z","content":"OTTAWA, Nov 3 (Reuters) - Below are some of the key proposals and takeaways from the annual fall economic statement unveiled by Canada's Finance Minister Chrystia Freeland on Thursday. [nO8N2N5027\r\nT "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"White House to ask for 10 bln in public health funds by year end -report - Reuters","description":"Officials from U.S. President Joe Biden's administration are finalizing a request this week for about 10 billion in public health funds by the end of the year, The Washington Post a href=\"\" target=\"_blank\"reported/a on Monday.","publishedAt":"2022-11-14T18:03:00Z","content":"Nov 14 (Reuters) - Officials from U.S. President Joe Biden's administration are finalizing a request this week for about 10 billion in public health funds by the end of the year, The Washington Post "},{"source":{"id":"","name":"Scientific American"},"author":"Thomas Frank, EE News","title":"FEMA Avoids Past Pitfalls by Rushing Storm Aid to Puerto Rico","description":"Since Hurricane Fiona hit Puerto Rico, FEMA has approved disaster aid for thousands more individuals and households than received aid after Hurricane Maria in 2017","publishedAt":"2022-10-24T17:00:00Z","content":"It was a moderate hurricane whose damage seemed tame compared to the destruction five years earlier from Hurricane Maria.\r\nBut in the weeks since Hurricane Fiona hit Puerto Rico, the Federal Emergenc "},{"source":{"id":"abc-news","name":"ABC News"},"author":"Morgan Winsor, Emily Shapiro","title":"Hurricane Nicole live updates: Latest timing and path","description":"Live updates on Tropical Storm Nicole.","publishedAt":"2022-11-10T00:49:07Z","content":"Nicole may strengthen into a Category 1 hurricane before making landfall overnight near Fort Pierce. Over the next 24 hours, the biggest threats for Florida will be damaging beach erosion, storm surg "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Hurricane Nicole makes landfall in Florida","description":"Nicole has been downgraded to a tropical storm after hitting Florida on Thursday.","publishedAt":"2022-11-10T13:37:49Z","content":"Hurricane Nicole reached Florida on Thursday night but has since been downgraded to a tropical storm.\r\nNicole hit the Bahamas as a Category 1 hurricane but slowed down after, it's also set to pass th "},{"source":{"id":"abc-news","name":"ABC News"},"author":"Kenton Gewecke, Morgan Winsor","title":"Subtropical Storm Nicole could become a hurricane when it nears Florida","description":"Subtropical Storm Nicole formed in the southwestern Atlantic Ocean on Monday, becoming the 14th named storm of the 2022 Atlantic hurricane season.","publishedAt":"2022-11-07T14:59:07Z","content":"The National Weather Service warned Monday that Subtropical Storm Nicole could be as strong as a hurricane when it approaches Florida's east coast later this week.\r\nThe storm could impact election we "},{"source":{"id":"","name":"MarketWatch"},"author":"Rachel Koning Beals","title":"Living With Climate Change: Nicole is U.S.s first November hurricane in 40 years  why climate change extends hurricane season","description":"After Hurricane Nicole, and with just a few weeks remaining, there is a 65 chance of an above-normal hurricane season this year, according to NOAA.","publishedAt":"2022-11-10T19:05:00Z","content":"Nicole has weakened to a tropical storm after making landfall along the East Coast of Florida early Thursday as a Category 1 hurricane, flooding coastal buildings and knocking out power to thousands, "},{"source":{"id":"abc-news","name":"ABC News"},"author":"Julia Jacobo","title":"This is what parts of Southwest Florida look like 1 month after Hurricane Ian","description":"Parts of Florida that were left unrecognizable in the wake of Hurricane Ian are still cleaning up the remnants of the widespread destruction one month after the storm.","publishedAt":"2022-10-28T13:54:19Z","content":"Parts of Southwest Florida that were left unrecognizable in the wake of Hurricane Ian are still cleaning up the remnants of the widespread destruction one month after the monster storm made landfall. "},{"source":{"id":"abc-news","name":"ABC News"},"author":"The Associated Press","title":"Florida county puts damage from Nicole at 481 million","description":"Damages are estimated at more than 481 million in a central Florida coastal county where homes collapsed into the Atlantic Ocean following Hurricane Nicole last week","publishedAt":"2022-11-14T16:39:08Z","content":"DAYTONA BEACH SHORES, Fla. -- Damages are estimated at more than 481 million in a central Florida coastal county where homes collapsed into the Atlantic Ocean following Hurricane Nicole last week.\r\n "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"CBS News Videos","title":"Florida's east coast under hurricane watch","description":"A rare November hurricane watch has been posted along Florida's Atlantic coast. Subtropical storm Nicole is expected to become a hurricane before making...","publishedAt":"2022-11-07T23:49:00Z","content":"A rare November hurricane watch has been posted along Florida's Atlantic coast. Subtropical storm Nicole is expected to become a hurricane before making landfall in Florida later this week."},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"AccuWeather","title":"Nicole targets Florida's east coast","description":"AccuWeather's hurricane expert Dan Kottlowski says Nicole is expected to hit Florida's east coast as a Category 1 hurricane later this week and urges...","publishedAt":"2022-11-08T16:51:28Z","content":"AccuWeather's hurricane expert Dan Kottlowski says Nicole is expected to hit Florida's east coast as a Category 1 hurricane later this week and urges immediate preparations."},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Hurricane Nicole: Rare November tropical storm hits land in Florida","description":"Evacuation orders in place as Hurricane Nicole makes landfall before weakening to a tropical storm.","publishedAt":"2022-11-10T11:50:00Z","content":"Media caption, Watch: Florida residents prepares as Hurricane Nicole approaches\r\nHurricane Nicole hit Florida on Thursday with 70mph (110kph) winds but has been downgraded to a tropical storm after i "},{"source":{"id":"","name":"The New Yorker"},"author":"Charles Bethea","title":"The Precarious Future of Sanibel Island","description":"Charles Bethea visits Floridas Sanibel Island, where residents are recovering after Hurricane Ian, and asks if the government should help them rebuild or relocate.","publishedAt":"2022-11-17T11:00:00Z","content":"Insurance wasnt likely to be of much help, Crater said, but he and his wife planned to rebuild. We tore down drywall together, then set out on a bicycle ride around the eastern half of the island. Ev "},{"source":{"id":"","name":"The Guardian"},"author":"Samira Asma-Sadeque","title":"Florida braced for arrival of Storm Nicole, which could become hurricane","description":"Hurricane and storm surge watch in effect as experts warn of heavy rainfall and significant winds for south-eastern FloridaFlorida was bracing itself on Monday for the arrival of subtropical Storm Nicole, which experts said could impact the coast, potentially","publishedAt":"2022-11-07T18:00:19Z","content":"Florida was bracing itself on Monday for the arrival ofsubtropical Storm Nicole, which experts said could impact the coast, potentially affecting election day on Tuesday.\r\nThe National Hurricane Cent "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Mosaic third-quarter profit more than doubles - Reuters","description":"Fertilizer maker Mosaic Co's a href=\"\" target=\"_blank\"(MOS.N)/a third-quarter profit more than doubled as farmers seek out plant nutrients to maximize crop yields at a time of low global grain stocks.","publishedAt":"2022-11-07T21:28:00Z","content":"Nov 7 (Reuters) - Fertilizer maker Mosaic Co's (MOS.N) third-quarter profit more than doubled as farmers seek out plant nutrients to maximize crop yields at a time of low global grain stocks.\r\nFertil "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Hurricane Nicole: Florida residents prepares as storm approaches","description":"A rare November hurricane is expected to hit south-eastern or east central Florida early on Thursday.","publishedAt":"2022-11-10T04:15:15Z","content":"Residents in Florida are preparing for Hurricane Nicole, which is expected to hit south-eastern or east central Florida early on Thursday.\r\nThe National Hurricane Center (NHC) upgraded Nicole - packi "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Hurricane Nicole: Florida braces for unusual November storm","description":"Nicole would be the first hurricane to make landfall in the US this late in the season in 40 years.","publishedAt":"2022-11-10T00:42:27Z","content":"Florida is bracing for a rare November hurricane as Nicole churns off the state's Atlantic Coast.\r\nThe huge category one hurricane has lashed Grand Bahama Island and is forecast to hit Florida overni "},{"source":{"id":"the-verge","name":"The Verge"},"author":"Justine Calma","title":"Temperatures are rising at super speed in the US","description":"Temperatures are rising faster in the US than the planet as a whole, and Americans are suffering more climate and weather disasters as a result. The latest draft of the National Climate Assessment lays out how the US is already experiencing climate change.","publishedAt":"2022-11-08T18:44:50Z","content":"Temperatures are rising at super speed in the US\r\nTemperatures are rising at super speed in the US\r\n / The US is heating up faster than the planet, and thats already brought changes to every corner o "},{"source":{"id":"","name":"Digital Trends"},"author":"Trevor Mogg","title":"NASA inspects SLS moon rocket following Hurricane Nicole","description":"NASA left its SLS rocket on the launchpad at the Kennedy Space Center as Hurricane Nicole passed through on Thursday. A team is now checking its condition.","publishedAt":"2022-11-11T00:45:01Z","content":"As the authorities in Florida begin to assess the wider damage wrought by Hurricane Nicole on Thursday, a team at the Kennedy Space Center is currently performing detailed inspections of NASAs next-g "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"AccuWeather","title":"National Hurricane Center urges preparation for Nicole","description":"Acting deputy director for the National Hurricane Center, Michael Brennan, urges people in Florida to prepare as soon as possible for Nicole. The state is...","publishedAt":"2022-11-08T16:51:28Z","content":"Acting deputy director for the National Hurricane Center, Michael Brennan, urges people in Florida to prepare as soon as possible for Nicole. The state is still recovering from Hurricane Ian."},{"source":{"id":"","name":"Digital Trends"},"author":"Georgina Torbet","title":"NASA still go for Artemis I launch despite minor damage from Hurricane Nicole","description":"NASA has announced that the Space Launch System rocket is still set to be launched this week, despite suffering minor damage during Hurricane Nicole.","publishedAt":"2022-11-12T14:15:27Z","content":"NASA has announced that the Space Launch System rocket is still set to be launched for the Artemis I mission this week, despite suffering very minor damage during Hurricane Nicole.\r\nThe rocket was  "},{"source":{"id":"usa-today","name":"USA Today"},"author":"USA TODAY, Cheryl McCloud and Ashley R. Williams, USA TODAY","title":"Subtropical Storm Nicole could reach hurricane strength before hitting Florida, forecasters say","description":"The storm's projected path brings it to Florida's east coast by Wednesday night. Impacts include coastal flooding, high winds, rain and beach erosion.","publishedAt":"2022-11-07T17:39:08Z","content":"WEST PALM BEACH, Fla. Withmore than three weeks left of hurricane season, Subtropical Storm Nicole posesa new threat to Florida this week even as the state continues its recovery from Hurricane I "},{"source":{"id":"","name":"Autoblog"},"author":"Joel Stocksdale","title":"Dodge announces Hurricane I6 crate engine, new Hellephants","description":"Filed under:\n Aftermarket,SEMA Show,Dodge,Performance\n Continue reading Dodge announces Hurricane I6 crate engine, new Hellephants\nDodge announces Hurricane I6 crate engine, new Hellephants originally appeared on Autoblog on Tue, 1 Nov 2022 00:01:00 EDT. Plea","publishedAt":"2022-11-01T04:01:00Z","content":"Dodge and Mopar have a history of offering some sweet crate engines, and there's no signs of that slowing. Over the next couple of years, the range of engines is expanding with options for both eight "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Woods, McIlroy, Thomas and Spieth to play in 'The Match' next month - Reuters","description":"Tiger Woods and Rory McIlroy will compete against fellow major winners Justin Thomas and Jordan Spieth at Pelican Golf Club in Belleair, Florida next month for the seventh edition of \"The Match\", Turner Sports said on Monday.","publishedAt":"2022-11-07T17:02:00Z","content":"Nov 7 (Reuters) - Tiger Woods and Rory McIlroy will compete against fellow major winners Justin Thomas and Jordan Spieth at Pelican Golf Club in Belleair, Florida next month for the seventh edition o "},{"source":{"id":"","name":"Boing Boing"},"author":"Elas Villoro","title":"How We Survive podcast tackles lithium's relationship to climate change","description":"\"The Climate crisis is here. The Western United States is burning; much of the Northeast is underwater after a hurricane; towns in Europe are swept away by massive floods. Time is slipping away to stop the worst effects of a warming planet, and the world is l","publishedAt":"2022-10-23T12:25:31Z","content":"\"The Climate crisis is here. The Western United States is burning; much of the Northeast is underwater after a hurricane; towns in Europe are swept away by massive floods. Time is slipping away to st "},{"source":{"id":"","name":"SciTechDaily"},"author":"","title":"Artemis I: Mega Moon Rocket Ready for Launch - SciTechDaily","description":"olliArtemis I: Mega Moon Rocket Ready for LaunchSciTechDaily\r\n/liliNasas rocket launch to the moon next week aims to close 50-year-long gapThe Guardian\r\n/liliNASA's moon rocket moved to pad for first launchAP Archive\r\n/liliThis Week NA","publishedAt":"2022-11-13T15:46:00Z","content":"ByEuropean Space Agency (ESA)November 13, 2022\r\nNASAs Space Launch System (SLS) rocket and the Orion spacecraft with its European Service Module, arrive at Launch Pad 39B at NASAs Kennedy Space Cente "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Practical provisions for commercial leases in light of changing times - Reuters","description":"Over the last two years, lawyers' standard lease language was tested by natural disasters, the pandemic and drastic changes in the way people work. To adapt to changing times, attorneys should consider incorporating a variety of practical provisions into thei","publishedAt":"2022-11-18T17:54:00Z","content":"Lease terms\r\nNovember 18, 2022 - Over the last two years, lawyers' standard lease language was tested by natural disasters, the pandemic and drastic changes in the way people work. To adapt to changi "},{"source":{"id":"","name":"Entrepreneur"},"author":"Jonathan Small","title":"The Cost of Halloween Candy Is Scary This Year, Thanks to Inflation","description":"Skittles and Starburst lead the pack with the biggest price hikes.","publishedAt":"2022-10-24T23:44:00Z","content":"This is not a trick. The cost of Halloween treats is way up in 2022.\r\nFor example, the price of Skittles has increased 42 from last year, according to analysis from Datasembly\r\nAnd if you want a jui "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"USA TODAY","title":"High winds, storm surge, flooding hit Florida as Nicole makes landfall as a hurricane","description":"Now downgraded to a tropical storm, Nicole made landfall along Florida's east coast as Category 1 hurricane.","publishedAt":"2022-11-10T14:02:51Z","content":"Now downgraded to a tropical storm, Nicole made landfall along Florida's east coast as Category 1 hurricane."},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Fox Weather","title":"Historical trunk washes ashore Florida beach after Hurricane Nicole","description":"Hurricane Nicole brought a storm surge of around 5 feet to Northeast Florida, which could be responsible for washing the trunk ashore.","publishedAt":"2022-11-19T02:30:07Z","content":"ST. AUGUSTINE, Fla. Discoveries that may not have been possible without the waves and wind from Hurricane Nicole are still being found along Floridas east coast, more than a week after the late-seaso "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"AccuWeather","title":"How a sustainable Florida neighborhood weathered Hurricane Ian","description":"A solar-powered neighborhood not far from Fort Myers made it through Hurricane Ian without losing electricity, water or even internet. An engineer behind the...","publishedAt":"2022-10-24T22:34:05Z","content":"A solar-powered neighborhood not far from Fort Myers made it through Hurricane Ian without losing electricity, water or even internet. An engineer behind the project explains what worked so well."},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"AccuWeather","title":"Significant storm surge flooding from Nicole","description":"The streets of St. Augustine, Florida, are swallowed by storm surge and coastal flooding from Hurricane Nicole on Nov. 10. Storm chaser Reed Timmer reports a...","publishedAt":"2022-11-10T16:05:47Z","content":"The streets of St. Augustine, Florida, are swallowed by storm surge and coastal flooding from Hurricane Nicole on Nov. 10. Storm chaser Reed Timmer reports a tornado watch in effect."},{"source":{"id":"","name":"NPR"},"author":"The Associated Press","title":"After suffering burns in a gasoline fire, Jay Leno says he's OK","description":"The cause and time of the fire wasn't immediately clear. The former \"Tonight Show\" host is known for his famed car collection, which is housed at a garage in Burbank, north of Los Angeles.","publishedAt":"2022-11-14T21:23:39Z","content":"Jay Leno attends the Hand in Hand: A Benefit for Hurricane Harvey Relief in Los Angeles on Sept. 12, 2017. Jay Leno suffered burns in a weekend fire at the car enthusiast's garage but said Monday tha "},{"source":{"id":"","name":"NPR"},"author":"The Associated Press","title":"A Miami building is evacuated near the site of the deadly Surfside condo collapse","description":"Residents of the 14-story building were forced to evacuate Thursday evening after officials determined the structure was unsafe and gave orders to leave.","publishedAt":"2022-10-28T10:41:02Z","content":"Coast Guard boats patrol in front of the partially collapsed Champlain Towers South condo building in Surfside, Fla. in July 2021. Residents of a Miami Beach building on the same street were forced t "},{"source":{"id":"","name":"The Guardian"},"author":"Robin McKie Science Editor","title":"Cop27 climate summit: window for avoiding catastrophe is closing fast","description":"The effects of global heating could soon reach a tipping point, but scientists fear that the meeting in Egypt will become bogged down in recriminationsIt has been an alarming time for climate scientists. One by one, the grim scenarios they had outlined for th","publishedAt":"2022-10-30T07:00:21Z","content":"It has been an alarming time for climate scientists. One by one, the grim scenarios they had outlined for the near future have been overtaken by events: extreme storms, droughts, floods and ice-sheet "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Jake Bittle, Grist","title":"9 in 10 U.S. Counties Hit by Climate Disaster Since 2011","description":"This story was originally published by Grist. You can subscribe to its weekly newsletter here.Read more...","publishedAt":"2022-11-16T14:50:56Z","content":"This story was originally published by Grist. You can subscribe to its weekly newsletter here.\r\nNinety percent of all counties in the United States have experienced a weather disaster over the past d "}]}