{"totalResults":52998,"articles":[{"source":{"id":"","name":"Lifehacker.com"},"author":"Daniel Oropeza","title":"Why You Should Buy Series I Bonds Right Now","description":"As inflation soars to the highest rate since 1981, youve very likely noticed how much its affecting the cost of many of your day-to-day necessities. But even beyond your checkbook and credit card statements, inflation is eating away at the purchasing power ","publishedAt":"2022-10-27T17:00:00Z","content":"As inflation soars to the highest rate since 1981, youve very likely noticed how much its affecting the cost of many of your day-to-day necessities. But even beyond your checkbook and credit card sta "},{"source":{"id":"cnn","name":"CNN"},"author":"Alicia Wallace","title":"Inflation data shows US prices were still uncomfortably high last month","description":"New inflation data shows that US prices were still uncomfortably high last month, despite aggressive action from the Federal Reserve to rein in decades-high inflation.","publishedAt":"2022-10-28T12:56:57Z","content":"MinneapolisCNN Business\r\n \r\nNew inflation data shows that US prices were still uncomfortably high last month, despite aggressive action from the Federal Reserve to rein in decades-high inflation.\r "},{"source":{"id":"","name":"Lifehacker.com"},"author":"Meredith Dietz","title":"These 20 States Are Sending Out Stimulus Checks","description":"Although theres little to see in terms of federal relief from record-breaking inflation, some states are stepping up to help their residents face our current economic reality. Twenty states are sending (or already sent) one-time rebate checks or other paymen","publishedAt":"2022-10-24T16:30:00Z","content":"Although theres little to see in terms of federal relief from record-breaking inflation, some states are stepping up to help their residents face our current economic reality. Twenty states are sendi "},{"source":{"id":"","name":"Lifehacker.com"},"author":"Elizabeth Yuko","title":"You Can Get a Free Wendys Frosty Every Day for a Year","description":"Inflation has hit us hard this year, and so far, things arent looking great for 2023. No, buying some fast food in order to get more fast food for free probably isnt going to fix things, but thanks to Wendys, you can try it out and see what happens. Heres","publishedAt":"2022-11-05T13:00:00Z","content":"Inflation has hit us hard this year, and so far, things arent looking great for 2023. No, buying some fast food in order to get more fast food for free probably isnt going to fix things, but thanks t "},{"source":{"id":"","name":"Lifehacker.com"},"author":"Meredith Dietz","title":"Do These Things to Save Money When Youre Hosting Thanksgiving","description":"Dont hold your breath for a Thanksgiving miracle this yearat least, not if youre hoping to find aninflation-proof turkey. According to TODAY.com, this years meal will no doubt cost you more than any other, with rising prices and supply chain issues hitti","publishedAt":"2022-11-15T17:30:00Z","content":"Dont hold your breath for a Thanksgiving miracle this yearat least, not if youre hoping to find aninflation-proof turkey. According to TODAY.com, this years meal will no doubt cost you more than any "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"US midterms: Why abortion matters in these crucial elections","description":"Inflation is voters' top issue, but Democrats hope anger over abortion bans will boost turnout.","publishedAt":"2022-11-06T00:58:18Z","content":"I met Susan Van Hoek at a pro-choice women's demonstration in Michigan's capital, Lansing. As she stood there with a placard, wearing her long grey hair loose, she remembered marching for abortion ri "},{"source":{"id":"cnn","name":"CNN"},"author":"Alicia Wallace","title":"Consumer confidence fell in October as inflation takes a toll","description":"US consumer confidence fell in October to the lowest level since July as high borrowing costs and soaring inflation take their toll on household budgets.","publishedAt":"2022-10-25T14:14:10Z","content":"MinneapolisCNN Business\r\n \r\nUS consumer confidence fell in October to the lowest level since July as high borrowing costs and soaring inflation take their toll on household budgets.\r\nThe consumer  "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"US midterm elections: What do people care about","description":"Abortion, inflation, gun control and voting rights are some topics being widely debated by US voters.","publishedAt":"2022-11-03T18:16:42Z","content":"Abortion, inflation, gun control and the right to vote are among the many topics Americans are debating ahead of this month's US midterm elections.\r\nOne voter in Illinois, Chicago said: \"I don't want "},{"source":{"id":"bbc-news","name":"BBC News"},"author":"","title":"Ghana economy: Chilli-sauce businesses feel the heat","description":"Freda Maku Yoobi lost her job as a make-up artist during Covid and now inflation has destroyed her business.","publishedAt":"2022-11-17T00:32:31Z","content":"Freda Maku Yoobi is hot and angry.\r\nThe 33-year-old Ghanaian has been hit twice over by her country's economic woes. First, Covid-19 restrictions ended her work as a make-up artist and now rising pri "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Polish central banker Kotecki sees inflation at 23-24 without anti-inflation shield - Reuters","description":"Polish inflation may reach 23-24 next year without anti-inflation shield next year, central banker Ludwik Kotecki said on Wednesday.","publishedAt":"2022-11-02T08:42:00Z","content":"WARSAW, Nov 2 (Reuters) - Polish inflation may reach 23-24 next year without anti-inflation shield next year, central banker Ludwik Kotecki said on Wednesday.\r\n\"In the budget bill there's no single "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Mexican headline inflation seen easing in October, core inflation up - Reuters","description":"Mexican inflation is expected to have moderated in October but remained well above the central bank's target, a Reuters poll showed Monday, likely cementing forecasts monetary policy makers will again hike the benchmark interest rate.","publishedAt":"2022-11-07T18:15:00Z","content":"MEXICO CITY, Nov 7 (Reuters) - Mexican inflation is expected to have moderated in October but remained well above the central bank's target, a Reuters poll showed Monday, likely cementing forecasts m "},{"source":{"id":"cnn","name":"CNN"},"author":"Paul R. La Monica","title":"All eyes on the consumer ahead of Black Friday and the holidays","description":"It has been a tough year for American consumers. Inflation everywhere. Rapidly rising interest rates. A housing market that is starting to cool off. That begs a question with the holidays right around the corner: Are shoppers finally tapped out","publishedAt":"2022-11-13T12:43:27Z","content":"A version of this story first appeared in CNN Business Before the Bell newsletter. Not a subscriber You can sign upright here.\r\nIt has been a tough year for American consumers. Inflation everywhere "},{"source":{"id":"cnn","name":"CNN"},"author":"Matt Egan","title":"Wall Street is bracing for midterm results  but Thursday's inflation report may be a bigger deal","description":"Wall Street is waiting for the results of Tuesday's midterm election like the rest of the world, but traders say this week's inflation report may prove to be far more consequential to markets.","publishedAt":"2022-11-08T19:41:29Z","content":"Wall Street is waiting for the results of Tuesdays midterm election like the rest of the world,but traders say this weeks inflation report may prove to be far more consequential to markets.\r\nObviousl "},{"source":{"id":"cnn","name":"CNN"},"author":"Alicia Wallace","title":"The economy was a big concern for voters. Today's inflation report likely won't help","description":"The economy was top of mind for voters in the midterm elections, exit polls showed, adding even more weight to a highly anticipated inflation report due out on Thursday.","publishedAt":"2022-11-10T10:53:01Z","content":"MinneapolisCNN Business\r\n \r\nThe economy was top of mind for voters in the midterm elections, exit polls showed, adding even more weight to a highly anticipated inflation report due out on Thursday "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Singapore September core inflation rises 5.3 - Reuters","description":"Singapore's key consumer price gauge rose 5.3 in September, slightly more than forecast, official data showed on Tuesday, driven by larger increases in the prices of food, services, retail and other goods.","publishedAt":"2022-10-25T06:04:19Z","content":"SINGAPORE, Oct 25 (Reuters) - Singapore's key consumer price gauge rose 5.3 in September, slightly more than forecast, official data showed on Tuesday, driven by larger increases in the prices of fo "},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"Germany dodges recession but inflation climbs - Reuters","description":"Germany staved off the threat of recession in the third quarter with unexpected growth but the economy remained in choppy waters as high inflation driven by a painful energy standoff with Russia surged, data showed on Friday (October 28). Francis Maguire repo","publishedAt":"2022-10-28T15:32:05Z","content":"Posted \r\nGermany staved off the threat of recession in the third quarter with unexpected growth but the economy remained in choppy waters as high inflation driven by a painful energy standoff with Ru "},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"McDonalds draws inflation-weary customers - Reuters","description":"Inflation weary diners are flocking to value meals. McDonalds restaurants in the U.S. had 6.2 more visitors in September compared to a year ago, outpacing traffic to the broader quick-service restaurants. This video is produced by Julia Sun.","publishedAt":"2022-10-27T23:24:27Z","content":"Posted \r\nInflation weary diners are flocking to value meals. McDonalds restaurants in the U.S. had 6.2 more visitors in September compared to a year ago, outpacing traffic to the broader quick-servi "},{"source":{"id":"engadget","name":"Engadget"},"author":"Kris Holt","title":"NYC will enforce Uber and Lyft driver pay increases by the end of the year","description":"New York City's Taxi and Limousine Commission (TLC) has voted to increase the minimum pay rates for Uber\r\n and Lyft\r\n drivers. Per-minute rates are going up by 7.4 percent and per-mile rates by 24 percent. In practical terms, that means a trip of 7.5 miles th","publishedAt":"2022-11-15T20:58:33Z","content":"New York City's Taxi and Limousine Commission (TLC) has voted to increase the minimum pay rates for Uber\r\n and Lyft\r\n drivers. Per-minute rates are going up by 7.4 percent and per-mile rates by 24 pe "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Goldman Sachs expects \"significant\" decline in U.S. inflation in 2023 - Reuters","description":"Goldman Sachs said it expects a \"significant\" decline in U.S. inflation next year due to easing in supply chain constraints, a peak in shelter inflation and slower wage growth.","publishedAt":"2022-11-14T09:07:00Z","content":"Nov 14 (Reuters) - Goldman Sachs said it expects a \"significant\" decline in U.S. inflation next year due to easing in supply chain constraints, a peak in shelter inflation and slower wage growth.\r\nTh "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Dollar dives as investors cheer after U.S. inflation misses forecasts - Reuters","description":"The dollar languished on Friday after U.S. inflation data came in cooler than expected, raising market hopes that inflation may have peaked and that the Federal Reserve will begin scaling back its hefty interest rate increases.","publishedAt":"2022-11-11T00:29:11Z","content":"SINGAPORE, Nov 11 (Reuters) - The dollar languished on Friday after U.S. inflation data came in cooler than expected, raising market hopes that inflation may have peaked and that the Federal Reserve  "},{"source":{"id":"","name":"Gizmodo.com"},"author":"Molly Taft","title":"What the Midterms Told Us About Climate Action","description":"Its that time of year again, when climate hawks gather around to read the tea leaves about what happened in U.S. national elections. This years climate campaign trail, for Democrats, was a lot different than previous years, thanks to the recent passage of t","publishedAt":"2022-11-10T14:50:00Z","content":"Its that time of year again, when climate hawks gather around to read the tea leaves about what happened in U.S. national elections. This years climate campaign trail, for Democrats, was a lot differ "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"BoE's Bailey says efforts to curb inflation likely to take 18 months to 2 years - Reuters","description":"Bank of England Governor Andrew Bailey said on Friday that efforts to bring inflation under control were likely to take between 18 months and two years, adding that inflation was \"way above where we (want) it to be\".","publishedAt":"2022-11-11T09:59:00Z","content":"LONDON, Nov 11 (Reuters) - Bank of England Governor Andrew Bailey said on Friday that efforts to bring inflation under control were likely to take between 18 months and two years, adding that inflati "},{"source":{"id":"reuters","name":"Reuters"},"author":"Matthew Weber","title":"What midterm voters care about, according to exit polls - Reuters","description":"What midterm voters thought about inflation, abortion and President Biden","publishedAt":"2022-11-09T04:16:00Z","content":"Midterm Polling\r\nWhat midterm voters care about, according to exit polls\r\nInflation, abortion and the direction of the country were top of voters minds\r\nVoters in the U.S. midterm election had a con "},{"source":{"id":"","name":"The Guardian"},"author":"Graeme Wearden","title":"Energy bills drive UK inflation to 40-year high of 11.1  business live","description":"Inflation continued to accelerate last month, lifted by gas and electricity bills, and pricier foodGas and electricity prices made the largest upward contribution to inflation, despite the governments energy price guarantee.Rising food prices also made a lar","publishedAt":"2022-11-16T07:03:53Z","content":"Newsflash: UK inflation hits 11.1\r\nUK inflation has hit a new 40-year high and even higher than feared.\r\nThe UKs annual inflation rate has risen to 11.1 in October, after millions of households wer "},{"source":{"id":"","name":"Castanet.net"},"author":"","title":"Wall Street surges, Dow up 1200 points on cooling inflation - Business News - Castanet.net","description":"olliWall Street surges, Dow up 1200 points on cooling inflation - Business NewsCastanet.net\r\n/liliU.S. inflation rate cools again, to 7.7CBC News\r\n/liliUS stocks mount biggest rally since 2020; Wall Street surges on cooling inflation  WION","publishedAt":"2022-11-10T23:08:00Z","content":"Wall Street blasted off Thursday to soar to its best day in more than two years as exhilaration swept through markets after a report showed inflation in the United States eased last month by even mor "},{"source":{"id":"","name":"Yahoo Entertainment"},"author":"Dani Romero","title":"Stock market news live updates: Stocks rise, Nasdaq jumps 1.5 amid optimistic inflation data - Yahoo Canada Finance","description":"olliStock market news live updates: Stocks rise, Nasdaq jumps 1.5 amid optimistic inflation dataYahoo Canada Finance\r\n/liliU.S. stocks climb again as traders mull inflation dataBNN Bloomberg\r\n/liliStocks Rally as Slower Inflation Eases Fed Ra","publishedAt":"2022-11-15T18:41:13Z","content":"U.S. stocks gained Tuesday amid another cooler-than-expected inflation report, even as fresh geopolitical tension threw a wrench into the rally midday.\r\nThe Samp;P 500 (GSPC) closed higher by 0.8, "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Column: Fed may harangue markets to prevent premature pivot - Reuters.com","description":"The euphoria that engulfed markets last week after surprisingly soft U.S. inflation figures was understandable.","publishedAt":"2022-11-15T16:59:00Z","content":"ORLANDO, Fla., Nov 15 (Reuters) - The euphoria that engulfed markets last week after surprisingly soft U.S. inflation figures was understandable.\r\nBut be careful what you wish for.\r\nThe surge in stoc "},{"source":{"id":"","name":"The Guardian"},"author":"Julia Kollewe","title":"Primark owner takes 1bn inflation hit but holds off more clothing price rises","description":"ABF warns of challenging economic conditions as consumers face soaring food and energy billsPrimarks owner has taken a 1bn hit from increased inflation this year and said rising costs and a weak consumer backdrop would be challenging in the coming months.","publishedAt":"2022-11-08T08:57:43Z","content":"Primarks owner has taken a 1bn hit from increased inflation this year and said rising costs and a weak consumer backdrop would be challenging in the coming months.\r\nAssociated British Foods said it  "},{"source":{"id":"","name":"StockNews.com"},"author":"Jaimini Desai","title":"InflationHow Low Can You Go","description":"The October CPI came in below expectations and fueled an explosive rally on Wall Street with the SP 500 (SPY) up by more than 4 and bonds also shooting higher....","publishedAt":"2022-11-13T12:00:00Z","content":"The October CPI came in below expectations and fueled an explosive rally on Wall Street with the Samp;P 500 (SPY) up by more than 4 and bonds also shooting higher. In essence, the odds of a soft la "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Euro zone October inflation surges amid growth slowdown - Reuters","description":"Euro zone inflation surged more than expected in October, data showed on Monday, fuelling expectations that the European Central Bank will press on with big interest rate hikes despite economic growth slowing.","publishedAt":"2022-10-31T15:31:00Z","content":"BRUSSELS, Oct 31 (Reuters) - Euro zone inflation surged more than expected in October, data showed on Monday, fuelling expectations that the European Central Bank will press on with big interest rate "},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"Euro zone inflation surges as growth slows - Reuters","description":"Euro zone inflation surged more than expected in October, data showed on Monday, fueling expectations that the European Central Bank will press on with big interest rate hikes despite economic growth slowing. Louisa Naks reports.","publishedAt":"2022-10-31T16:05:28Z","content":"Posted \r\nEuro zone inflation surged more than expected in October, data showed on Monday, fueling expectations that the European Central Bank will press on with big interest rate hikes despite econom "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"India's gold demand dips as inflation hits rural buyers - Reuters","description":"India's gold consumption in the months of October to December could fall by around a quarter from a year ago as inflation depresses rural demand, the World Gold Council (WGC) said on Tuesday.","publishedAt":"2022-11-01T00:34:31Z","content":"MUMBAI, Nov 1 (Reuters) - India's gold consumption in the months of October to December could fall by around a quarter from a year ago as inflation depresses rural demand, the World Gold Council (WGC "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"In Britain's inflation crisis, healthy diets are a casualty - Reuters.com","description":"Fresh vegetables and fish are falling off the menu. Packaged pizzas and processed meat are the dishes of the day.","publishedAt":"2022-10-28T05:02:00Z","content":"LONDON, Oct 28 (Reuters) - Fresh vegetables and fish are falling off the menu. Packaged pizzas and processed meat are the dishes of the day.\r\nMany British households are turning away from healthier f "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Higher production helps AngloGold Ashanti fight inflation - Reuters","description":"Gold miner AngloGold Ashanti a href=\"\" target=\"_blank\"(ANGJ.J)/a posted a 20 jump in third-quarter production on Thursday, helping it bring costs down by 6 from the same period a year earlier.","publishedAt":"2022-11-03T07:07:00Z","content":"JOHANNESBURG, Nov 3 (Reuters) - Gold miner AngloGold Ashanti (ANGJ.J) posted a 20 jump in third-quarter production on Thursday, helping it bring costs down by 6 from the same period a year earlier. "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Biden to warn Republicans will boost inflation in Syracuse - Reuters","description":"President Joe Biden will once again contrast his economic plan with Republicans' on Thursday in a last-ditch effort to convince voters Democrats are better equipped to battle high inflation and grow the economy, less than two weeks away from midterm elections.","publishedAt":"2022-10-27T09:02:00Z","content":"WASHINGTON, Oct 27 (Reuters) - President Joe Biden will once again contrast his economic plan with Republicans' on Thursday in a last-ditch effort to convince voters Democrats are better equipped to  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Japan cabinet approves spending package to ease inflation pain - Reuters.com","description":"Japan's government on Friday unveiled a new stimulus package with spending worth 39.0 trillion yen (265 billion) that it said would boost gross domestic product (GDP) by around 4.6.","publishedAt":"2022-10-28T08:40:00Z","content":"TOKYO, Oct 28 (Reuters) - Japan's government on Friday unveiled a new stimulus package with spending worth 39.0 trillion yen (265 billion) that it said would boost gross domestic product (GDP) by ar "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Venezuela's monthly inflation slows to 6.2 in October - Reuters Canada","description":"Venezuela's monthly inflation in October hit 6.2, a sharp slowdown from September when prices rose 28.7, according to data released on Friday by the country's central bank.","publishedAt":"2022-11-04T22:47:00Z","content":"CARACAS, Nov 4 (Reuters) - Venezuela's monthly inflation in October hit 6.2, a sharp slowdown from September when prices rose 28.7, according to data released on Friday by the country's central ban "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Philippines October inflation at highest since December 2008 - Reuters","description":"Philippine annual inflation accelerated to 7.7 in October a href=\"\" target=\"_blank\"(PHCPI=ECI)/a, the highest since December 2008 and up from the previous month's 6.9, the statistics agency said on Friday.","publishedAt":"2022-11-04T01:16:49Z","content":"MANILA, Nov 4 (Reuters) - Philippine annual inflation accelerated to 7.7 in October (PHCPI=ECI), the highest since December 2008 and up from the previous month's 6.9, the statistics agency said on  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Spain's 12-month inflation down to 7.3 in October - Reuters.com","description":"Spanish consumer prices rose 7.3 year-on-year in October, down from 8.9 in the period through September, final data released by the National Statistics Institute showed on Tuesday.","publishedAt":"2022-11-15T08:17:00Z","content":"Nov 15 (Reuters) - Spanish consumer prices rose 7.3 year-on-year in October, down from 8.9 in the period through September, final data released by the National Statistics Institute showed on Tuesda "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Australian consumer sentiment slides as rates, inflation surge - Reuters","description":"A measure of Australian consumer sentiment sank in November as rising interest rates and surging inflation clouded the outlook for family finances and the economy, though actual spending has yet to follow.","publishedAt":"2022-11-07T23:51:48Z","content":"SYDNEY, Nov 8 (Reuters) - A measure of Australian consumer sentiment sank in November as rising interest rates and surging inflation clouded the outlook for family finances and the economy, though ac "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Futures rise as focus shifts to inflation data - Reuters","description":"U.S. stock index futures inched higher on Thursday as investor focus turned to October inflation data for clues on the path of future interest rate hikes.","publishedAt":"2022-11-10T11:15:00Z","content":"Nov 10 (Reuters) - U.S. stock index futures inched higher on Thursday as investor focus turned to October inflation data for clues on the path of future interest rate hikes.\r\nRepublicans were edging  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Irish inflation hits 38-year high of 9.2 - Reuters","description":"Annual inflation in Ireland hit a 38-year high of 9.2 in October, up from 8.2 a month earlier after fresh electricity and gas price increases kicked in, Central Statistics Office data showed on Thursday.","publishedAt":"2022-11-10T11:18:00Z","content":"DUBLIN, Nov 10 (Reuters) - Annual inflation in Ireland hit a 38-year high of 9.2 in October, up from 8.2 a month earlier after fresh electricity and gas price increases kicked in, Central Statistic "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Greek workers walk out over 'suffocating' inflation - Reuters","description":"Greek workers began a day-long strike on Wednesday, demanding higher wages to combat surging inflation, as soaring energy prices and living costs in Europe have triggered industrial action and protests across the continent.","publishedAt":"2022-11-09T10:41:00Z","content":"ATHENS, Nov 9 (Reuters) - Greek workers began a day-long strike on Wednesday, demanding higher wages to combat surging inflation, as soaring energy prices and living costs in Europe have triggered in "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Constellation sees big benefits from U.S. Inflation Reduction Act - Reuters","description":"U.S. power company Constellation Energy Corp a href=\"\" target=\"_blank\"(CEG.O)/a said on Tuesday that the U.S. Inflation Reduction Act (IRA) significantly strengthened the long-term outlook of its nuclear fleet and pl","publishedAt":"2022-11-08T15:46:00Z","content":"Nov 8 (Reuters) - U.S. power company Constellation Energy Corp (CEG.O) said on Tuesday that the U.S. Inflation Reduction Act (IRA) significantly strengthened the long-term outlook of its nuclear flee "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Egypt's headline inflation jumps to 16.2 in October - Reuters","description":"Egypt's annual urban consumer inflation accelerated faster than expected in October, climbing to a four-year high of 16.2, data from the statistics agency CAPMAS showed on Thursday.","publishedAt":"2022-11-10T14:12:00Z","content":"CAIRO, Nov 10 (Reuters) - Egypt's annual urban consumer inflation accelerated faster than expected in October, climbing to a four-year high of 16.2, data from the statistics agency CAPMAS showed on  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"ECB's Panetta says green transition may help cut inflation - Reuters.com","description":"Greater use of renewable energy doesn't necessarily translate into higher prices and it may in fact help cut inflation compared to continued reliance on fossil fuels, European Central Bank board member Fabio Panetta said on Wednesday.","publishedAt":"2022-11-16T15:04:00Z","content":"FRANKFURT, Nov 16 (Reuters) - Greater use of renewable energy doesn't necessarily translate into higher prices and it may in fact help cut inflation compared to continued reliance on fossil fuels, Eu "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Inflation top worry for G20 countries -survey - Reuters","description":"Runaway inflation, an unfolding debt crisis and cost-of-living problems pose the biggest threats to doing business for G20 countries in the next two years, data from the World Economic Forum showed on Monday.","publishedAt":"2022-11-07T04:59:16Z","content":"Nov 7 (Reuters) - Runaway inflation, an unfolding debt crisis and cost-of-living problems pose the biggest threats to doing business for G20 countries in the next two years, data from the World Econo "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"S.Korea annual consumer inflation ticks up in Oct - Reuters","description":"South Korea's annual consumer inflation in October ticked up from September against market expectations for no change, government data showed on Wednesday.","publishedAt":"2022-11-01T23:05:44Z","content":"SEOUL, Nov 2 (Reuters) - South Korea's annual consumer inflation in October ticked up from September against market expectations for no change, government data showed on Wednesday.\r\nThe consumer pric "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"More inflation in the system to come - UK's Sainsbury's - Reuters.com","description":"There is more food price inflation yet to come through, the boss of Sainsbury's a href=\"\" target=\"_blank\"(SBRY.L)/a, Britain's second largest grocer, said on Thursday.","publishedAt":"2022-11-03T13:13:00Z","content":"LONDON, Nov 3 (Reuters) - There is more food price inflation yet to come through, the boss of Sainsbury's (SBRY.L), Britain's second largest grocer, said on Thursday.\r\n\"We're battling really hard to  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Bank of England's Mann says inflation drivers still strong - Reuters.com","description":"Britain is still facing strong domestic drivers of inflation on top of the impact of surging international energy prices and the after-effects of the coronavirus pandemic, Bank of England interest rate-setter Catherine Mann said on Thursday.","publishedAt":"2022-11-03T19:56:00Z","content":"LONDON, Nov 3 (Reuters) - Britain is still facing strong domestic drivers of inflation on top of the impact of surging international energy prices and the after-effects of the coronavirus pandemic, B "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Duke sees big benefits from U.S. Inflation Reduction Act - Reuters","description":"Duke Energy Corp a href=\"\" target=\"_blank\"(DUK.N)/a expects to receive significant tax incentives from the U.S. Inflation Reduction Act , the American company said on Friday.","publishedAt":"2022-11-04T14:15:00Z","content":"Nov 4 (Reuters) - Duke Energy Corp (DUK.N) expects to receive significant tax incentives from the U.S. Inflation Reduction Act , the American company said on Friday.\r\nThe Charlotte, North Carolina-ba "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Column: China reopening may add inflation headache - Reuters","description":"If China gets well, the rest of the world could catch a cold.","publishedAt":"2022-11-09T09:37:00Z","content":"LONDON, Nov 9 (Reuters) - If China gets well, the rest of the world could catch a cold.\r\nChina's seemingly endless battle with COVID-19 clearly has a ways to run as nationwide infections, even though "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"European shares inch down ahead of inflation data - Reuters","description":"European shares edged lower on Monday, led by declines in energy stocks and miners, while investors awaited key inflation reading in the euro zone which will likely show prices hitting new record highs in October.","publishedAt":"2022-10-31T08:32:00Z","content":"Oct 31 (Reuters) - European shares edged lower on Monday, led by declines in energy stocks and miners, while investors awaited key inflation reading in the euro zone which will likely show prices hit "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Portugal's October inflation revised slightly lower to 10.1 - Reuters","description":"Portuguese consumer prices rose 10.1 year-on-year in October, their fastest pace since May 1992, final official data showed on Friday, in a slight downward revision of an earlier estimate of 10.2. In September, inflation clocked 9.3.","publishedAt":"2022-11-11T11:22:00Z","content":"LISBON, Nov 11 (Reuters) - Portuguese consumer prices rose 10.1 year-on-year in October, their fastest pace since May 1992, final official data showed on Friday, in a slight downward revision of an  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Dollar steadies as Fed cautions on inflation - Reuters","description":"The U.S. dollar held firm on Monday following last week's bruising dive as Federal Reserve Governor Christopher Waller said that the central bank was not softening its fight against inflation.","publishedAt":"2022-11-14T02:22:10Z","content":"SINGAPORE, Nov 14 (Reuters) - The U.S. dollar held firm on Monday following last week's bruising dive as Federal Reserve Governor Christopher Waller said that the central bank was not softening its f "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"BOJ inflation target to be scrutinised at government forum - Reuters","description":"A government-affiliated think tank will host a forum next month to discuss the Bank of Japan's 2 inflation target and the \"challenges ahead\", the organisation said on Monday.","publishedAt":"2022-11-14T09:33:00Z","content":"Nov 14 (Reuters) - A government-affiliated think tank will host a forum next month to discuss the Bank of Japan's 2 inflation target and the \"challenges ahead\", the organisation said on Monday.\r\nThe "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Joyous market reaction to comfortably cool inflation report - Reuters","description":"U.S. stocks surged, the dollar slid and Treasury yields dropped on Thursday after a cooler-than-expected October consumer prices report suggested the Federal Reserve's barrage of interest rate hikes are beginning to have their intended effect.","publishedAt":"2022-11-10T17:45:00Z","content":"NEW YORK, Nov 10 (Reuters) - U.S. stocks surged, the dollar slid and Treasury yields dropped on Thursday after a cooler-than-expected October consumer prices report suggested the Federal Reserve's ba "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Saudi inflation eases to 3 in October - Reuters.com","description":"Saudi Arabia's annual inflation rate eased to 3 in October from 3.1 in September, with higher food prices driving the latest price rise, the General Authority for Statistics reported on Tuesday.","publishedAt":"2022-11-15T07:30:00Z","content":"DUBAI, Nov 15 (Reuters) - Saudi Arabia's annual inflation rate eased to 3 in October from 3.1 in September, with higher food prices driving the latest price rise, the General Authority for Statisti "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Brazil's inflation fight not over, central bank chief says - Reuters.com","description":"Brazil's central bank chief Roberto Campos Neto said on Tuesday that inflation is showing \"incipient\" signs of improvement, but he reiterated that Latin America's largest economy must \"persist\" in its battle to curb price pressures.","publishedAt":"2022-11-15T16:44:00Z","content":"Nov 15 (Reuters) - Brazil's central bank chief Roberto Campos Neto said on Tuesday that inflation is showing \"incipient\" signs of improvement, but he reiterated that Latin America's largest economy m "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Israel's inflation rate jumps to 5.1 in October - Reuters.com","description":"Israel's inflation rate rose a more than expected 5.1 in October over the prior 12 months from 4.6 in September, which is likely to garner a strong response from the Bank of Israel next week.","publishedAt":"2022-11-15T16:35:00Z","content":"JERUSALEM, Nov 15 (Reuters) - Israel's inflation rate rose a more than expected 5.1 in October over the prior 12 months from 4.6 in September, which is likely to garner a strong response from the B "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Fed's Jefferson says low inflation key to U.S. prosperity - Reuters","description":"High inflation hurts low-income households hardest, and bringing it down is the best way for the Federal Reserve to help bring prosperity to Americans broadly and narrow the economic gaps between demographic groups, a top Fed official said Thursday.","publishedAt":"2022-11-17T15:42:00Z","content":"Nov 17 (Reuters) - High inflation hurts low-income households hardest, and bringing it down is the best way for the Federal Reserve to help bring prosperity to Americans broadly and narrow the econom "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"S.Korea should prioritise inflation control, IMF official says - Reuters","description":"South Korea's central bank, the Bank of Korea, should keep up efforts to prioritise inflation control, even as it faces a trade-off with growth, a senior official of the International Monetary Fund said on Tuesday.","publishedAt":"2022-10-25T05:59:16Z","content":"SEOUL, Oct 25 (Reuters) - South Korea's central bank, the Bank of Korea, should keep up efforts to prioritise inflation control, even as it faces a trade-off with growth, a senior official of the Int "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"ECB could raise inflation projections, policymaker says - Reuters","description":"The European Central Bank (ECB) may need to raise its inflation projections further in December, Lithuanian policymaker Gediminas Simkus told reporters on Friday.","publishedAt":"2022-10-28T06:40:00Z","content":"VILNIUS, Oct 28 (Reuters) - The European Central Bank (ECB) may need to raise its inflation projections further in December, Lithuanian policymaker Gediminas Simkus told reporters on Friday.\r\nSimkus  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Indonesia inflation eases in Oct, still above c.bank target - Reuters.com","description":"Indonesia's inflation rate eased in October but remained above the central bank's target range for five straight months, statistics bureau data showed on Tuesday, against market expectations for a slight acceleration.","publishedAt":"2022-11-01T04:26:41Z","content":"JAKARTA, Nov 1 (Reuters) - Indonesia's inflation rate eased in October but remained above the central bank's target range for five straight months, statistics bureau data showed on Tuesday, against m "},{"source":{"id":"reuters","name":"Reuters"},"author":"Reuters Editorial","title":"'Hurting all of us': U.S. voters feel inflation pain - Reuters","description":"Rising costs of rent, food, and gasoline are forcing Americans - many of them already struggling financially - to take a hard look at their options in upcoming midterm elections that will decide who controls Congress. Zachary Goelman produced this report.","publishedAt":"2022-10-26T22:32:06Z","content":"Posted \r\nRising costs of rent, food, and gasoline are forcing Americans - many of them already struggling financially - to take a hard look at their options in upcoming midterm elections that will de "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Consumer inflation in Japan's capital hits 33-year high - Reuters","description":"Core consumer prices in Japan's capital, a leading indicator of nationwide figures, rose 3.4 in October from a year earlier, data showed on Friday, marking the fastest annual pace since 1989 in a sign of broadening inflationary pressure.","publishedAt":"2022-10-28T00:00:00Z","content":"TOKYO, Oct 28 (Reuters) - Core consumer prices in Japan's capital, a leading indicator of nationwide figures, rose 3.4 in October from a year earlier, data showed on Friday, marking the fastest annu "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Fed's soothsayers see signs of an inflation downshift - Reuters","description":"Is the U.S. economy stuck with such high inflation that it will take a recession to fix it. Or are prices about to crater and leave the Federal Reserve with a load of financial stress, slowed growth, and higher-than-needed interest rates to answer for","publishedAt":"2022-10-27T10:12:00Z","content":"WASHINGTON, Oct 27 (Reuters) - Is the U.S. economy stuck with such high inflation that it will take a recession to fix it. Or are prices about to crater and leave the Federal Reserve with a load of f "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Argentina inflation seen gaining pace again in October - Reuters","description":"Argentina's inflation rate is expected to have picked up pace slightly in October, analysts polled by Reuters said, with spiraling prices that are set to climb 100 this year hammering spending power and stoking anger on the streets.","publishedAt":"2022-11-11T16:45:00Z","content":"BUENOS AIRES, Nov 11 (Reuters) - Argentina's inflation rate is expected to have picked up pace slightly in October, analysts polled by Reuters said, with spiraling prices that are set to climb 100 t "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"TSX rises as investors cheer U.S. inflation data - Reuters.com","description":"Canadian stocks followed their Wall Street peers higher on Tuesday as oil prices rose and after fresh evidence of easing U.S. inflation raised expectations that the Federal Reserve will slow its pace of interest rate hikes.","publishedAt":"2022-11-15T21:31:00Z","content":"TORONTO, Nov 15 (Reuters) - Canadian stocks followed their Wall Street peers higher on Tuesday as oil prices rose and after fresh evidence of easing U.S. inflation raised expectations that the Federa "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"INDIA STOCKS Indian shares edge higher as inflation eases - Reuters.com","description":"Indian shares opened slightly higher on Tuesday, as data showing annual retail inflation eased to a three-month low in October strengthened bets of smaller interest rate hikes from the country's central bank.","publishedAt":"2022-11-15T04:14:00Z","content":"BENGALURU, Nov 15 (Reuters) - Indian shares opened slightly higher on Tuesday, as data showing annual retail inflation eased to a three-month low in October strengthened bets of smaller interest rate "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Poland to change anti-inflation policies, says PM - Reuters","description":"Poland will modify anti-inflation policies opposed by the European Union to avoid another dispute with Brussels, the prime minister said on Monday, as the country grapples with price growth not seen since the 1990s.","publishedAt":"2022-11-07T09:17:00Z","content":"WARSAW, Nov 7 (Reuters) - Poland will modify anti-inflation policies opposed by the European Union to avoid another dispute with Brussels, the prime minister said on Monday, as the country grapples w "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Breakingviews - Primark's price freeze is risky inflation gambit - Reuters","description":"Primark is breaking with the pack to navigate soaring inflation. The UK high street retailer best known for its throwaway fashion, which is owned by 12 billion pound Associated British Foods a href=\"\" target=\"_blank\"(A","publishedAt":"2022-11-08T12:43:38Z","content":"LONDON, Nov 8 (Reuters Breakingviews) - Primark is breaking with the pack to navigate soaring inflation. The UK high street retailer best known for its throwaway fashion, which is owned by 12 billion "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Euro zone consumers see higher inflation ahead, ECB says - Reuters","description":"Inflation expectations among euro zone consumers continued to rise in September, even as economic growth and income forecasts declined markedly, a new European Central Bank survey showed on Wednesday.","publishedAt":"2022-11-09T10:45:00Z","content":"FRANKFURT, Nov 9 (Reuters) - Inflation expectations among euro zone consumers continued to rise in September, even as economic growth and income forecasts declined markedly, a new European Central Ba "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Barkin: U.S. likely on \"back end\" of inflation surge - Reuters","description":"The U.S. is likely at the \"back end\" of the current inflation surge though it remained unclear how long it may take the rate of price increases to decline to the Fed's 2 target, Richmond Federal Reserve president Thomas Barkin said on Wednesday.","publishedAt":"2022-11-09T17:13:00Z","content":"WASHINGTON, Nov 9 (Reuters) - The U.S. is likely at the \"back end\" of the current inflation surge though it remained unclear how long it may take the rate of price increases to decline to the Fed's 2 "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S. consumer sentiment falls in November; inflation expectations rise - Reuters","description":"U.S. consumer sentiment fell in November, pulled down by persistent worries about inflation and higher borrowing costs, a survey showed on Friday.","publishedAt":"2022-11-11T15:09:00Z","content":"WASHINGTON, Nov 11 (Reuters) - U.S. consumer sentiment fell in November, pulled down by persistent worries about inflation and higher borrowing costs, a survey showed on Friday.\r\nThe University of Mi "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Breakingviews - Inflation has gig economy perk: more side hustlers - Reuters","description":"Some members of the shared economy are seeing a resurgence in the side hustle as inflation bites. People are becoming more interested in driving for Uber Technologies a href=\"\" target=\"_blank\"(UBER.N)/a and listing ","publishedAt":"2022-11-11T18:00:00Z","content":"TORONTO, Nov 11 (Reuters Breakingviews) - Some members of the shared economy are seeing a resurgence in the side hustle as inflation bites. People are becoming more interested in driving for Uber Tec "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Nepalis vote amid looming inflation, political stability concerns - Reuters","description":"Nepalis were voting on Sunday in a general election that few expect to bring drastic change - or a government able to quickly revive one of the slowest-growing economies in South Asia.","publishedAt":"2022-11-20T01:50:34Z","content":"KATHMANDU, Nov 20 (Reuters) - Nepalis were voting on Sunday in a general election that few expect to bring drastic change - or a government able to quickly revive one of the slowest-growing economies "},{"source":{"id":"cnn","name":"CNN"},"author":"Nicole Goodkind","title":"Why America's job market hasn't imploded","description":"Despite a stock-market bounce in October that gave the Dow its biggest monthly gain in more than 45 years, economists are warning that there's a very real danger of recession in the United States. Mortgage rates are at their highest levels since 2002, consume","publishedAt":"2022-11-01T12:34:43Z","content":"A version of this story first appeared in CNN Business Before the Bell newsletter. Not a subscriber You can sign upright here. You can listen to an audio version of the newsletter by clicking the s "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Fed's George says increasingly difficult to bring inflation down without a recession - WSJ - Reuters","description":"Inflation is at risk of becoming entrenched in the economy from an overheated job market, making it difficult for the Federal Reserve to bring down inflation without a recession, Kansas City Federal Reserve President Esther George told the Wall Street Journal.","publishedAt":"2022-11-16T10:59:00Z","content":"Nov 16 (Reuters) - Inflation is at risk of becoming entrenched in the economy from an overheated job market, making it difficult for the Federal Reserve to bring down inflation without a recession, K "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"EXCLUSIVE Yellen says doesn't know if lower U.S. inflation data is turning point - Reuters","description":"U.S. Treasury Secretary Janet Yellen told Reuters on Friday that it was good to see the latest U.S. inflation data that suggests upward pressures are easing, but added that it was unclear if inflation has a reached a turning point to continue moving lower.","publishedAt":"2022-11-11T10:12:00Z","content":"NEW DELHI, Nov 11 (Reuters) - U.S. Treasury Secretary Janet Yellen told Reuters on Friday that it was good to see the latest U.S. inflation data that suggests upward pressures are easing, but added t "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"U.S. producer prices rise less than expected in October - Reuters.com","description":"U.S. producer prices increased less than expected in October, further evidence that inflation was starting to subside.","publishedAt":"2022-11-15T13:44:00Z","content":"WASHINGTON, Nov 15 (Reuters) - U.S. producer prices increased less than expected in October, further evidence that inflation was starting to subside.\r\nThe producer price index for final demand rose 0 "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"ECB should hike interest rates further to combat inflation, Nagel says - Reuters.com","description":"The European Central Bank should hike interest further to bring inflation back under control, policymaker Joachim Nagel said on Thursday.","publishedAt":"2022-11-03T08:35:00Z","content":"MADRID, Nov 3 (Reuters) - The European Central Bank should hike interest further to bring inflation back under control, policymaker Joachim Nagel said on Thursday.\r\n\"The ECB should not refrain from f "},{"source":{"id":"","name":"CNET"},"author":"Toni Husbands","title":"Best 6-Month CD Rates for November 2022 - CNET","description":"Six-month CD rates are on the rise as inflation eats into traditional savings growth.","publishedAt":"2022-11-10T15:57:00Z","content":"A certificate of deposit, or CD, is a type of savings account offered by banks and credit unions that pays higher yields than a standard savings account as long as account holders agree to not to wit "},{"source":{"id":"","name":"The Guardian"},"author":"Richard Adams Education editor","title":"Inflation will erode funding for early years care, finds IFS","description":"Report foresees funding for childcare places in England falling by 8 over next three yearsThe fast pace of inflation will significantly erode funding for early years care in nurseries and childcare providers over the next three years, according to a report b","publishedAt":"2022-11-11T07:00:06Z","content":"The fast pace of inflation will significantly erode funding for early years care in nurseries and childcare providers over the next three years, according to a report by the Institute for Fiscal Stud "},{"source":{"id":"","name":"The Guardian"},"author":"Charles Pensulo in Thyolo","title":"Everythings gone up: soaring inflation hits Malawis market trade","description":"Farmers, entrepreneurs and sellers are struggling as rises in fuel and fertiliser prices make it harder to cover costsFriday is market day at Goliati in the Thyolo district of southern Malawi, and usually the stalls are bustling.The area is known for its frui","publishedAt":"2022-10-25T06:45:28Z","content":"Friday is market day at Goliati in the Thyolo district of southern Malawi, and usually the stalls are bustling.\r\nThe area is known for its fruit and vegetables such as tomatoes and cabbages and peopl "},{"source":{"id":"","name":"The Guardian"},"author":"Nils Pratley","title":"BT is feeling the squeeze as inflation clouds its future","description":"Telecoms company warns of job cuts as cost pressures and energy bills threaten its financial plansInflation, cost pressures and soaring energy prices. No, not the Bank of England, but BT, which is providing in miniature an illustration of how the squeeze from","publishedAt":"2022-11-03T18:36:05Z","content":"Inflation, cost pressures and soaring energy prices. No, not the Bank of England, but BT, which is providing in miniature an illustration of how the squeeze from many directions has intensified at pa "},{"source":{"id":"","name":"The Guardian"},"author":"Sarah Butler","title":"Heinz tomato ketchup tops inflation survey of UK branded groceries","description":"Which survey shows condiments price up 53 since 2020 as popular branded products outstrip overall rate of grocery inflationThe cost of Heinz tomato ketchup in UK supermarkets has shot up 53 since 2020, making it the biggest riser in of a list of leading b","publishedAt":"2022-11-15T00:01:08Z","content":"The cost of Heinz tomato ketchup in UK supermarkets has shot up 53 since 2020, making it the biggest riser in of a list of leading branded groceries.\r\nTwo other Heinz products also made the top 10 i "},{"source":{"id":"","name":"Global News"},"author":"Kalina Laframboise","title":"Quebec to give people up to 600, if they make under 100K, due to inflation spike - Global News","description":"olliQuebec to give people up to 600, if they make under 100K, due to inflation spikeGlobal News\r\n/liliMost Quebecers to get 400 or 600 from the government to fight inflationCTV News Montreal\r\n/liliQuebec defends decision to issue inflation","publishedAt":"2022-11-09T20:09:23Z","content":"Quebecers earning 100,000 or less will receive another cheque as of December to help offset the impact of rising inflation.\r\nFinance Minister Eric Girard announced Wednesday the additional cash to h "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"UK energy price caps will help to reduce inflation, ONS rules - Reuters UK","description":"Britain's energy price cap for consumers and government-funded discounts on bills for businesses will push official measures of inflation lower, the country's statistics office said on Monday.","publishedAt":"2022-10-31T08:12:00Z","content":"LONDON, Oct 31 (Reuters) - Britain's energy price cap for consumers and government-funded discounts on bills for businesses will push official measures of inflation lower, the country's statistics of "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Sri Lanka's key inflation rate slows to 66 in October - Reuters","description":"Sri Lanka's key inflation rate slowed to 66 in October after hitting 69.8 in September, the crisis-struck country's statistics department said on Monday.","publishedAt":"2022-10-31T09:42:00Z","content":"Oct 31 (Reuters) - Sri Lanka's key inflation rate slowed to 66 in October after hitting 69.8 in September, the crisis-struck country's statistics department said on Monday.\r\nThe surge in the Colomb "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Spanish services activity shrinks in Oct as prices weigh -PMI - Reuters","description":"Activity in the Spanish services sector contracted for the second straight month in October, weighed down by high inflation again, a survey showed on Friday.","publishedAt":"2022-11-04T08:21:00Z","content":"MADRID, Nov 4 (Reuters) - Activity in the Spanish services sector contracted for the second straight month in October, weighed down by high inflation again, a survey showed on Friday.\r\nSamp;P Global "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"ECB ready to do more if inflation becomes sticky, Lagarde says - Reuters","description":"The European Central Bank is ready to tighten monetary policy faster if the current, high inflation takes hold and expectations surge, ECB President Christine Lagarde said on Friday.","publishedAt":"2022-11-04T09:47:00Z","content":"FRANKFURT, Nov 4 (Reuters) - The European Central Bank is ready to tighten monetary policy faster if the current, high inflation takes hold and expectations surge, ECB President Christine Lagarde sai "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"German investor morale posts stronger-than-expected rise - ZEW - Reuters.com","description":"German investor sentiment saw a stronger-than-expected rise in November on hopes that inflation will fall soon, even though the economic outlook for Germany remains gloomy overall.","publishedAt":"2022-11-15T10:30:00Z","content":"BERLIN, Nov 14 (Reuters) - German investor sentiment saw a stronger-than-expected rise in November on hopes that inflation will fall soon, even though the economic outlook for Germany remains gloomy  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Europe's uneven inflation levels make ECB's action challenging, Spanish minister says - Reuters.com","description":"The different inflation levels in euro zone countries make the European Central Bank's monetary policy action challenging, Spanish Economy Minister Nadia Calvino said on Friday.","publishedAt":"2022-11-18T14:38:00Z","content":"MADRID, Nov 18 (Reuters) - The different inflation levels in euro zone countries make the European Central Bank's monetary policy action challenging, Spanish Economy Minister Nadia Calvino said on Fr "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"UK will increase state pensions and benefits in line with inflation - Reuters UK","description":"British finance minister Jeremy Hunt said on Thursday he would raise state retirement and welfare benefits payments in line with inflation.","publishedAt":"2022-11-17T12:51:00Z","content":"LONDON, Nov 17 (Reuters) - British finance minister Jeremy Hunt said on Thursday he would raise state retirement and welfare benefits payments in line with inflation.\r\nHunt said he would raise benefi "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Sterling slips as dollar edges higher, with all eyes on U.S. - Reuters","description":"The British pound fell on Tuesday as the dollar rose, with investors focused on U.S. inflation figures and the midterm elections.","publishedAt":"2022-11-08T10:17:00Z","content":"LONDON, Nov 8 (Reuters) - The British pound fell on Tuesday as the dollar rose, with investors focused on U.S. inflation figures and the midterm elections.\r\nU.S. consumer price index (CPI) inflation  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"India's Oct inflation seen falling below 7 - central bank chief - Reuters India","description":"India's retail price inflation is expected to fall below 7 in October from 7.41 in September, Reserve Bank of India Governor Shaktikanta Das said on Saturday.","publishedAt":"2022-11-12T11:57:00Z","content":"NEW DELHI, Nov 12 (Reuters) - India's retail price inflation is expected to fall below 7 in October from 7.41 in September, Reserve Bank of India Governor Shaktikanta Das said on Saturday.\r\nInflati "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"How clean energy could conquer - Reuters","description":"As rampant inflation and fears of recession roiled the global economy over the past year, one sector appears to have emerged in relatively good shape: renewable energy.","publishedAt":"2022-11-11T14:03:00Z","content":"As rampant inflation and fears of recession roiled the global economy over the past year, one sector appears to have emerged in relatively good shape: renewable energy.\r\nCosts for wind, solar and oth "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"The bear market blues: a diagnosis for our times - Reuters","description":"War. Inflation. Polarization. Appalling headlines ricochet around the internet, stocks are skidding, wealth is eroding and the mood on Wall Street has rarely been gloomier.","publishedAt":"2022-10-25T10:05:00Z","content":"Oct 25 (Reuters) - War. Inflation. Polarization. Appalling headlines ricochet around the internet, stocks are skidding, wealth is eroding and the mood on Wall Street has rarely been gloomier.\r\nWhile  "},{"source":{"id":"reuters","name":"Reuters"},"author":"","title":"Saudi bourse on course to extend losses on weak oil - Reuters","description":"Most stock markets in the Gulf were subdued in early trade on Wednesday on falling oil prices and amid caution ahead of the release of U.S. inflation data.","publishedAt":"2022-11-09T08:41:00Z","content":"Nov 9 (Reuters) - Most stock markets in the Gulf were subdued in early trade on Wednesday on falling oil prices and amid caution ahead of the release of U.S. inflation data.\r\nCrude prices - a key cat "}]}